{"": 0, "sub~reg8~imm": 1, "mov~reg8~ptr8": 2, "test~reg8~reg8": 3, "je": 4, "call~reg8": 5, "__gmon_start__": 6, "add~reg8~imm": 7, "ret": 8, "push~ptr8": 9, "jmp~ptr8": 10, "SSL_CTX_set_srp_username": 11, "OCSP_response_get1_basic": 12, "OPENSSL_sk_value": 13, "ENGINE_get_id": 14, "tcsetattr": 15, "EVP_DigestInit_ex": 16, "BIO_printf": 17, "fileno": 18, "MD4_Update": 19, "dup2": 20, "SSL_SESSION_free": 21, "OCSP_CERTID_free": 22, "OCSP_response_status": 23, "EVP_PKEY_get0_RSA": 24, "memset": 25, "ftell": 26, "TLS_client_method": 27, "SSL_CTX_set_cipher_list": 28, "ERR_get_error": 29, "SSL_CTX_set_default_passwd_cb_userdata": 30, "SSL_CTX_free": 31, "UI_method_set_reader": 32, "CRYPTO_get_ex_new_index": 33, "inet_pton": 34, "close": 35, "inflateEnd": 36, "X509_load_crl_file": 37, "X509_get_issuer_name": 38, "ioctl": 39, "memchr": 40, "UI_create_method": 41, "clock_gettime": 42, "SSL_CTX_use_certificate": 43, "SSL_CTX_sess_set_new_cb": 44, "isatty": 45, "utimes": 46, "X509_EXTENSION_get_data": 47, "puts": 48, "SSL_get_current_cipher": 49, "GENERAL_NAMES_free": 50, "DH_get0_key": 51, "ASN1_TIME_print": 52, "MD4_Init": 53, "X509_get_X509_PUBKEY": 54, "htons": 55, "__isoc99_sscanf": 56, "SSL_get_privatekey": 57, "getpeername": 58, "exit": 59, "__assert_fail": 60, "ERR_clear_error": 61, "getaddrinfo": 62, "strcasecmp": 63, "gettimeofday": 64, "SSL_CTX_add_client_CA": 65, "setvbuf": 66, "SSL_CTX_set_ciphersuites": 67, "ERR_error_string_n": 68, "X509_get_pubkey": 69, "PEM_X509_INFO_read_bio": 70, "OPENSSL_sk_pop": 71, "strpbrk": 72, "UI_method_set_closer": 73, "execl": 74, "read": 75, "strncmp": 76, "fopen": 77, "SSL_CTX_set_default_passwd_cb": 78, "SSL_write": 79, "ENGINE_get_first": 80, "recv": 81, "if_nametoindex": 82, "i2a_ASN1_OBJECT": 83, "unlink": 84, "X509_EXTENSION_get_object": 85, "BIO_puts": 86, "SSL_CTX_use_certificate_file": 87, "X509V3_EXT_print": 88, "UI_method_get_opener": 89, "UI_get0_user_data": 90, "EVP_PKEY_id": 91, "PEM_write_bio_X509": 92, "ENGINE_ctrl_cmd": 93, "SSL_get0_alpn_selected": 94, "__cxa_atexit": 95, "UI_set_result": 96, "X509_NAME_get_entry": 97, "OCSP_resp_find_status": 98, "setsockopt": 99, "BN_num_bits": 100, "SSL_set_fd": 101, "SSL_get_shutdown": 102, "getpid": 103, "X509_NAME_ENTRY_get_data": 104, "SSL_CTX_ctrl": 105, "UI_destroy_method": 106, "pthread_mutex_init": 107, "fgets": 108, "inflateInit2_": 109, "CRYPTO_malloc": 110, "ASN1_STRING_get0_data": 111, "getpwuid": 112, "EVP_DigestUpdate": 113, "UI_get_string_type": 114, "geteuid": 115, "SSL_CIPHER_get_name": 116, "OpenSSL_version_num": 117, "ENGINE_load_private_key": 118, "inflate": 119, "UI_method_get_closer": 120, "DSA_get0_key": 121, "BIO_s_file": 122, "X509_LOOKUP_file": 123, "UI_get_input_flags": 124, "CRYPTO_free": 125, "X509_get_version": 126, "freeaddrinfo": 127, "i2d_X509_PUBKEY": 128, "SSL_new": 129, "free": 130, "EVP_DigestFinal_ex": 131, "fnmatch": 132, "_IO_getc": 133, "strlen": 134, "ferror": 135, "pthread_create": 136, "ASN1_STRING_print": 137, "__xstat": 138, "__xpg_basename": 139, "zlibVersion": 140, "MD5_Final": 141, "SSL_read": 142, "MD5_Update": 143, "BIO_new": 144, "listen": 145, "__ctype_b_loc": 146, "DES_ecb_encrypt": 147, "SSL_CTX_load_verify_locations": 148, "SSL_CTX_use_PrivateKey": 149, "X509_get0_signature": 150, "sprintf": 151, "ENGINE_ctrl": 152, "SSL_CTX_get_cert_store": 153, "ntohs": 154, "EVP_PKEY_get0_DSA": 155, "X509_get0_extensions": 156, "fdopen": 157, "ntohl": 158, "strrchr": 159, "PEM_read_bio_PrivateKey": 160, "strtok_r": 161, "DES_set_key_unchecked": 162, "SSL_set_session": 163, "pipe": 164, "UI_method_set_opener": 165, "X509_STORE_add_crl": 166, "SSL_CTX_set_post_handshake_auth": 167, "pthread_join": 168, "d2i_OCSP_RESPONSE": 169, "poll": 170, "gmtime_r": 171, "ASN1_STRING_to_UTF8": 172, "kill": 173, "SSL_CTX_use_certificate_chain_file": 174, "i2t_ASN1_OBJECT": 175, "strerror": 176, "EVP_MD_CTX_new": 177, "BIO_s_mem": 178, "strstr": 179, "BIO_new_mem_buf": 180, "sigaction_0": 181, "getifaddrs": 182, "SSL_CTX_set_options": 183, "socketpair": 184, "SSL_alert_desc_string_long": 185, "OCSP_cert_status_str": 186, "getsockopt": 187, "fputs": 188, "lseek": 189, "strtol": 190, "OCSP_crl_reason_str": 191, "X509_STORE_add_cert": 192, "getsockname": 193, "atoi": 194, "OCSP_BASICRESP_free": 195, "SSL_connect": 196, "connect": 197, "gethostname": 198, "X509_PUBKEY_get0_param": 199, "EVP_sha1": 200, "tcgetattr": 201, "SSL_CTX_set_keylog_callback": 202, "PKCS12_PBE_add": 203, "X509_get_serialNumber": 204, "SSL_CTX_set_next_proto_select_cb": 205, "BIO_f_ssl": 206, "signal": 207, "strspn": 208, "SSL_CTX_use_PrivateKey_file": 209, "memmove": 210, "strchr": 211, "waitpid": 212, "X509_STORE_set_flags": 213, "X509_STORE_add_lookup": 214, "socket": 215, "SSL_free": 216, "__fxstat": 217, "X509_get0_notBefore": 218, "DES_set_odd_parity": 219, "getenv": 220, "ENGINE_finish": 221, "ENGINE_set_default": 222, "ERR_peek_last_error": 223, "ENGINE_free": 224, "PEM_read_bio_X509_AUX": 225, "__errno_location": 226, "qsort": 227, "SSL_get_peer_cert_chain": 228, "ERR_peek_error": 229, "strdup": 230, "OCSP_check_validity": 231, "d2i_X509_bio": 232, "__stack_chk_fail": 233, "X509_NAME_get_index_by_NID": 234, "UI_method_set_writer": 235, "X509_check_issued": 236, "strcmp": 237, "tolower": 238, "SSL_CTX_check_private_key": 239, "SSL_get_peer_certificate": 240, "send": 241, "OCSP_RESPONSE_free": 242, "SSL_get_verify_result": 243, "fsetxattr": 244, "MD4_Final": 245, "OPENSSL_init_ssl": 246, "ENGINE_init": 247, "strcpy": 248, "strtok": 249, "MD5_Init": 250, "UI_method_get_reader": 251, "freeifaddrs": 252, "BN_print": 253, "OCSP_cert_to_id": 254, "inflateInit_": 255, "SSL_shutdown": 256, "EVP_PKEY_get0_DH": 257, "OCSP_response_status_str": 258, "SSL_set_bio": 259, "pthread_detach": 260, "X509_get0_notAfter": 261, "memcmp": 262, "DSA_get0_pqg": 263, "X509_verify_cert_error_string": 264, "X509_get_subject_name": 265, "__xpg_strerror_r": 266, "EVP_MD_CTX_free": 267, "feof": 268, "SSL_pending": 269, "fclose": 270, "RAND_bytes": 271, "recvfrom": 272, "SSL_CTX_set_alpn_protos": 273, "strncpy": 274, "ENGINE_by_id": 275, "OCSP_basic_verify": 276, "SSL_get_certificate": 277, "SSL_CTX_set_msg_callback": 278, "EVP_PKEY_free": 279, "UI_method_get_writer": 280, "d2i_PrivateKey_bio": 281, "PEM_read_bio_X509": 282, "SSL_ctrl": 283, "SSL_CTX_set_srp_password": 284, "SSL_CTX_new": 285, "strcspn": 286, "ftruncate": 287, "SSL_set_connect_state": 288, "UI_OpenSSL": 289, "RSA_free": 290, "OPENSSL_sk_pop_free": 291, "access": 292, "fork": 293, "X509_get_ext_d2i": 294, "ASN1_STRING_type": 295, "BIO_ctrl": 296, "RSA_flags": 297, "ENGINE_get_next": 298, "sendto": 299, "bind": 300, "BIO_free": 301, "OPENSSL_sk_num": 302, "pthread_mutex_lock": 303, "RAND_status": 304, "getpwuid_r": 305, "EVP_sha256": 306, "EVP_DigestInit": 307, "setlocale": 308, "EVP_PKEY_get1_RSA": 309, "X509_NAME_print_ex": 310, "SSL_get_ex_data": 311, "localtime": 312, "pthread_mutex_destroy": 313, "write": 314, "strftime": 315, "SSL_get_error": 316, "accept": 317, "SSL_get_version": 318, "strtoul": 319, "pthread_mutex_unlock": 320, "PKCS12_parse": 321, "inet_ntop": 322, "memcpy": 323, "fcntl": 324, "d2i_PKCS12_bio": 325, "SSL_set_ex_data": 326, "open": 327, "EVP_PKEY_copy_parameters": 328, "rename": 329, "RSA_get0_key": 330, "strtod": 331, "PKCS12_free": 332, "mkdir": 333, "time": 334, "SSL_CTX_set_verify": 335, "fflush": 336, "DH_get0_pqg": 337, "ASN1_STRING_length": 338, "__imp_fseek": 339, "__imp_fputc": 340, "__imp___cxa_finalize": 341, "__imp_fread": 342, "__imp_fwrite": 343, "__imp_X509_free": 344, "xor~reg4~reg4": 345, "mov~reg8~reg8": 346, "pop~reg8": 347, "and~reg8~imm": 348, "push~reg8": 349, "lea~reg8~ptr": 350, "icall~ptr8": 351, "__libc_start_main": 352, "hlt": 353, "cmp~reg8~reg8": 354, "jmp~reg8": 355, "cmp~ptr1~imm": 356, "jne": 357, "cmp~ptr8~imm": 358, "call": 359, "mov~ptr1~imm": 360, "jmp": 361, "nop": 362, "mov~ptr8~reg8": 363, "mov~reg4~imm": 364, "leave": 365, "mov~ptr4~reg4": 366, "movzx~reg4~ptr1": 367, "test~reg1~reg1": 368, "mov~reg4~ptr4": 369, "test~reg4~reg4": 370, "sub~reg8~reg8": 371, "mov~ptr4~imm": 372, "add~reg8~reg8": 373, "mov~reg4~reg4": 374, "cmp~reg4~imm": 375, "cmp~ptr4~imm": 376, "ja": 377, "jae": 378, "jbe": 379, "mov~ptr8~imm": 380, "cmp~reg1~imm": 381, "xor~reg4~imm": 382, "sub~reg8~ptr8": 383, "add~ptr8~imm": 384, "cmp~ptr8~reg8": 385, "jb": 386, "and~reg4~imm": 387, "mov~ptr1~reg1": 388, "cdqe": 389, "call~imm": 390, "movzx~reg4~reg1": 391, "js": 392, "add~ptr8~reg8": 393, "cmp~reg8~ptr8": 394, "imul~reg8~ptr8": 395, "cmp~reg8~imm": 396, "sub~ptr8~imm": 397, "movsx~reg4~ptr1": 398, "sub~reg4~imm": 399, "lea~reg4~ptr": 400, "imul~reg8~reg8~imm": 401, "shr~reg8~imm": 402, "shr~reg4~imm": 403, "imul~reg4~reg4~imm": 404, "sub~reg4~reg4": 405, "cdq": 406, "idiv~ptr4": 407, "div~reg4": 408, "add~reg4~reg4": 409, "cmp~reg4~reg4": 410, "jl": 411, "jns": 412, "movabs~reg8~imm": 413, "jge": 414, "jg": 415, "setne~reg1": 416, "jle": 417, "pxor~reg16~reg16": 418, "cvtsi2sd~reg16~ptr8": 419, "divsd~reg16~reg16": 420, "movsd~ptr8~reg16": 421, "movsd~reg16~ptr8": 422, "mulsd~reg16~reg16": 423, "cvtsi2sd~reg16~ptr4": 424, "mulsd~reg16~ptr8": 425, "cvttsd2si~reg4~reg16": 426, "movsxd~reg8~reg4": 427, "movq~reg16~reg8": 428, "movzx~reg4~ptr2": 429, "movzx~reg4~reg2": 430, "sete~reg1": 431, "movaps~ptr2~reg16": 432, "add~ptr4~imm": 433, "mov~ptr2~imm": 434, "movsx~reg4~reg1": 435, "cmp~reg4~ptr4": 436, "shl~reg8~imm": 437, "mov~reg8~imm": 438, "cmp~ptr1~reg1": 439, "push~imm": 440, "or~reg8~imm": 441, "or~reg1~imm": 442, "or~reg4~imm": 443, "cmp~ptr4~reg4": 444, "and~reg4~ptr4": 445, "and~reg4~reg4": 446, "or~reg8~reg8": 447, "seta~reg1": 448, "shr~reg8~reg1": 449, "imul~reg8": 450, "sar~reg8~imm": 451, "cvttsd2si~reg8~reg16": 452, "or~ptr8~imm": 453, "or~reg4~reg4": 454, "comisd~reg16~reg16": 455, "movq~reg8~reg16": 456, "not~reg8": 457, "and~reg8~reg8": 458, "rep stosq~ptr8~reg8": 459, "cmovs~reg8~reg8": 460, "cqo": 461, "idiv~reg8": 462, "add~reg4~imm": 463, "cmovge~reg8~reg8": 464, "idiv~ptr8": 465, "and~ptr8~reg8": 466, "imul~reg8~reg8": 467, "div~reg8": 468, "cmp~reg1~reg1": 469, "idiv~reg4": 470, "sub~ptr4~imm": 471, "sub~ptr8~reg8": 472, "and~reg1~imm": 473, "shl~ptr8~imm": 474, "shr~reg1~imm": 475, "or~ptr4~imm": 476, "or~ptr2~imm": 477, "mov~ptr2~reg2": 478, "test~reg2~reg2": 479, "cwde": 480, "rep movsq~ptr8~ptr8": 481, "shl~reg4~imm": 482, "not~reg4": 483, "cvtsi2sd~reg16~reg8": 484, "addsd~reg16~reg16": 485, "sar~reg4~imm": 486, "or~ptr4~reg4": 487, "neg~reg8": 488, "add~ptr4~reg4": 489, "and~ptr4~imm": 490, "neg~ptr8": 491, "div~ptr8": 492, "comisd~reg16~ptr2": 493, "setbe~reg1": 494, "shl~reg4~reg1": 495, "sar~reg4~reg1": 496, "cmovs~reg4~reg4": 497, "shl~reg8~reg1": 498, "or~ptr1~imm": 499, "cmp~reg1~ptr1": 500, "setle~reg1": 501, "neg~reg4": 502, "cmovg~reg4~reg4": 503, "movapd~reg16~reg16": 504, "cmovbe~reg8~reg8": 505, "rol~reg4~imm": 506, "cmova~reg8~reg8": 507, "and~ptr1~imm": 508, "and~ptr8~imm": 509, "setg~reg1": 510, "cmovle~reg8~reg8": 511, "cmp~reg2~reg2": 512, "cmp~ptr2~reg2": 513, "shr~ptr8~imm": 514, "mul~reg8": 515, "cmp~ptr2~imm": 516, "cmp~reg2~imm": 517, "cmovbe~reg4~reg4": 518, "sub~reg4~ptr4": 519, "movsx~reg8~reg1": 520, "xor~ptr8~reg8": 521, "movsx~reg4~reg2": 522, "cmp~reg2~ptr2": 523, "shr~reg2~imm": 524, "and~reg8~ptr8": 525, "or~reg2~ptr2": 526, "sar~ptr4~imm": 527, "or~reg2~imm": 528, "nop~ptr4": 529, "__getreent": 530, "fwrite": 531, "fputc": 532, "__errno": 533, "__assert_func": 534, "stat": 535, "fstat": 536, "fread": 537, "fseek": 538, "getc": 539, "sscanf": 540, "__main": 541, "__locale_ctype_ptr": 542, "sigaction": 543, "basename": 544, "setb~reg1": 545, "X509_free": 546, "GetModuleHandleW": 547, "cygwin_internal": 548, "cmovne~reg8~ptr8": 549, "_dll_crt0": 550, "malloc": 551, "realloc": 552, "calloc": 553, "posix_memalign": 554, "movdqa~reg16~ptr2": 555, "movups~ptr2~reg16": 556, "GetModuleHandleA": 557, "msys_detach_dll": 558, "dll_dllcrt0": 559, "slist_wc.c": 560, "%02d:%02d:%02d.%06ld": 561, "tool_cb_dbg.c": 562, "Failed to create/open output": 563, "%s%s": 564, "[%zu bytes data]": 565, "%s== Info: %.*s": 566, "=> Send header": 567, "=> Send data": 568, "<= Recv header": 569, "<= Recv data": 570, "<= Recv SSL data": 571, "=> Send SSL data": 572, "%s%s, %zu bytes (0x%zx)": 573, "%04zx:": 574, "%02x": 575, "Header data exceeds single call write limit!": 576, "etag:": 577, "Content-disposition:": 578, "filename=": 579, "tool_cb_hdr.c": 580, "\u001b[1m%.*s\u001b[0m:": 581, "CURL_TESTDIR": 582, "-=O=-": 583, "%%-%ds %%5.1f%%%%": 584, "COLUMNS": 585, "tool_cb_wrt.c": 586, "config": 587, "Remote filename has no length!": 588, "%s/%s": 589, "out of memory": 590, "Failed to create the file %s: %s": 591, "CURL_ISATTY": 592, "Header data size exceeds single call write limit!": 593, "Data size exceeds single call write limit!": 594, "Invalid output struct data for write callback": 595, "tool_cfgable.c": 596, "You don't have permission to create %s.": 597, "The directory name %s is too long.": 598, "%s resides on a read-only file system.": 599, "No space left on the file system that will contain the directory %s.": 600, "Cannot create directory %s because you exceeded your quota.": 601, "Error creating directory %s.": 602, "tool_dirhie.c": 603, "hnd = curl_easy_init();": 604, "ret = curl_easy_perform(hnd);": 605, "curl_easy_cleanup(hnd);": 606, "hnd = NULL;": 607, "tool_easysrc.c": 608, "Failed to open %s to write libcurl code!": 609, "%s": 610, "Failed to get filetime: %s": 611, "Failed to set filetime %ld on '%s': %s": 612, "%s/%c%s": 613, "tool_findfile.c": 614, "fname && fname[0]": 615, "!dotscore || (fname[0] == '.')": 616, "tool_formparse.c": 617, "stdin: %s": 618, "Trailing data after quoted form parameter": 619, "Out of memory for field headers!": 620, "Header file %s read error: %s": 621, "File %s line %d: header too long (truncated)": 622, "type=": 623, "%127[^/ ]/%127[^;, ]": 624, "Illegally formatted content-type field!": 625, "headers=": 626, "Cannot read from %s: %s": 627, "Out of memory for field header!": 628, "encoder=": 629, "skip unknown form field: %s": 630, "Field content type not allowed here: %s": 631, "Field file name not allowed here: %s": 632, "Field encoder not allowed here: %s": 633, "Field headers not allowed here: %s": 634, "garbage at end of field specification: %s": 635, "pkcs11:": 636, "tool_getparam.c": 637, "invalid number specified for %s": 638, "unsupported %s unit. Use G, M, K or B!": 639, "The file name argument '%s' looks like a flag.": 640, "--trace overrides an earlier trace/verbose option": 641, "--trace-ascii overrides an earlier trace/verbose option": 642, "Failed to open %s!": 643, "max-filesize": 644, "- %6s": 645, "--metalink is disabled": 646, "Ignores instruction to use SSLv2": 647, "Ignores instruction to use SSLv3": 648, "Couldn't read data from file \"%s\", this makes an empty POST.": 649, "%.*s=%s": 650, ";auto": 651, "You must select either --fail or --fail-with-body, not both.": 652, "error trying read config from the '%s' file": 653, "unsupported range point": 654, "-v, --verbose overrides an earlier trace/verbose option": 655, "<stdin>": 656, "Failed to read %s": 657, "--url": 658, "option %s: %s": 659, "%-*s %s": 660, "%s: %s": 661, "%-11s %s": 662, "Usage: curl [options...] <url>": 663, "category": 664, "Invalid category provided, here is a list of all categories:": 665, "tool_help.c": 666, "Release-Date: %s": 667, "Protocols:": 668, "Features:": 669, "7.81.0-DEV": 670, "Build-time engines:": 671, "<none>": 672, "had unsupported trailing garbage": 673, "is unknown": 674, "is ambiguous": 675, "requires parameter": 676, "is badly used here": 677, "expected a proper numerical parameter": 678, "expected a positive numerical parameter": 679, "the installed libcurl version doesn't support this": 680, "a specified protocol is unsupported by libcurl": 681, "the given option can't be reversed with a --no- prefix": 682, "too large number": 683, "used '--no-' for option that isn't a boolean": 684, "showing headers and --remote-header-name cannot be combined": 685, "--continue-at and --remote-header-name cannot be combined": 686, "unknown error": 687, "POST (-d, --data)": 688, "You can only select one HTTP request method! You asked for both %s and %s.": 689, "Unnecessary use of -X or --request, %s is already inferred.": 690, "tool_hugehelp.c": 691, "1.2.11": 692, "CURL_MEMDEBUG": 693, "CURL_MEMLIMIT": 694, "tool_main.c": 695, "error initializing curl": 696, "Note:": 697, "Warning:": 698, "curl:": 699, "curl: try 'curl --help' or 'curl --manual' for more information": 700, "tool_operate.c": 701, "transfers": 702, "transfersl": 703, "CURLOPT_INFILESIZE_LARGE": 704, "curl: (%d) %s": 705, "curl: (%d) The requested URL returned error: %ld": 706, "Error setting extended attributes on '%s': %s": 707, "curl: (%d) Failed writing body": 708, "Problem %s. Will retry in %ld seconds. %ld retries left.": 709, "Throwing away %ld bytes": 710, "curl: (23) Failed to truncate file": 711, "curl: (23) Failed seeking to end of file": 712, "Failed to open %s": 713, "If-None-Match: \"\"": 714, "Failed to allocate memory for custom etag header": 715, "Failed to extract a sensible file name from the URL to use for storage!": 716, "Remote file name has no length!": 717, "bad output glob!": 718, "!outs->filename": 719, "per->infdopen == 0": 720, "per->infd == 0": 721, "fcntl failed on fd=%d: %s": 722, "<stdout>": 723, "[%lu/%lu]: %s --> %s": 724, "--_curl_--": 725, "%s%c%s": 726, "%s/?%s": 727, "CURLOPT_TCP_NODELAY": 728, "CURLOPT_TCP_FASTOPEN": 729, "CURLOPT_WRITEDATA": 730, "CURLOPT_INTERLEAVEDATA": 731, "CURLOPT_WRITEFUNCTION": 732, "CURLOPT_READDATA": 733, "CURLOPT_READFUNCTION": 734, "CURLOPT_SEEKDATA": 735, "CURLOPT_SEEKFUNCTION": 736, "CURLOPT_BUFFERSIZE": 737, "CURLOPT_URL": 738, "CURLOPT_NOPROGRESS": 739, "CURLOPT_NOBODY": 740, "CURLOPT_XOAUTH2_BEARER": 741, "CURLOPT_PROXY": 742, "CURLOPT_PROXYTYPE": 743, "CURLOPT_PROXYUSERPWD": 744, "CURLOPT_HTTPPROXYTUNNEL": 745, "CURLOPT_PRE_PROXY": 746, "CURLOPT_PROXYAUTH": 747, "CURLOPT_NOPROXY": 748, "CURLOPT_SUPPRESS_CONNECT_HEADERS": 749, "CURLOPT_FAILONERROR": 750, "CURLOPT_REQUEST_TARGET": 751, "CURLOPT_UPLOAD": 752, "CURLOPT_DIRLISTONLY": 753, "CURLOPT_APPEND": 754, "CURLOPT_NETRC": 755, "CURLOPT_NETRC_FILE": 756, "CURLOPT_TRANSFERTEXT": 757, "CURLOPT_LOGIN_OPTIONS": 758, "CURLOPT_USERPWD": 759, "CURLOPT_RANGE": 760, "CURLOPT_ERRORBUFFER": 761, "CURLOPT_TIMEOUT_MS": 762, "CURLOPT_POSTFIELDS": 763, "CURLOPT_POSTFIELDSIZE_LARGE": 764, "CURLOPT_MIMEPOST": 765, "CURLOPT_MIME_OPTIONS": 766, "CURLOPT_HTTPAUTH": 767, "CURLOPT_HTTPHEADER": 768, "CURLOPT_REFERER": 769, "CURLOPT_USERAGENT": 770, "CURLOPT_FOLLOWLOCATION": 771, "CURLOPT_UNRESTRICTED_AUTH": 772, "CURLOPT_AUTOREFERER": 773, "CURLOPT_PROXYHEADER": 774, "CURLOPT_HEADEROPT": 775, "CURLOPT_MAXREDIRS": 776, "CURLOPT_HTTP_VERSION": 777, "CURLOPT_POSTREDIR": 778, "CURLOPT_ACCEPT_ENCODING": 779, "CURLOPT_TRANSFER_ENCODING": 780, "CURLOPT_HTTP09_ALLOWED": 781, "HTTP/0.9 is not supported in this build!": 782, "CURLOPT_FTPPORT": 783, "CURLOPT_LOW_SPEED_LIMIT": 784, "CURLOPT_LOW_SPEED_TIME": 785, "CURLOPT_MAX_SEND_SPEED_LARGE": 786, "CURLOPT_MAX_RECV_SPEED_LARGE": 787, "CURLOPT_RESUME_FROM_LARGE": 788, "CURLOPT_KEYPASSWD": 789, "CURLOPT_PROXY_KEYPASSWD": 790, "CURLOPT_SSH_PRIVATE_KEYFILE": 791, "CURLOPT_SSH_PUBLIC_KEYFILE": 792, "CURLOPT_SSH_HOST_PUBLIC_KEY_MD5": 793, "CURLOPT_SSH_HOST_PUBLIC_KEY_SHA256": 794, "CURLOPT_SSH_COMPRESSION": 795, "CURLOPT_CAINFO": 796, "CURLOPT_PROXY_CAINFO": 797, "CURLOPT_CAPATH": 798, "SSL_CERT_DIR environment variable": 799, "--capath": 800, "ignoring %s, not supported by libcurl": 801, "CURLOPT_PROXY_CAPATH": 802, "ignoring --proxy-capath, not supported by libcurl": 803, "CURLOPT_CRLFILE": 804, "CURLOPT_PROXY_CRLFILE": 805, "CURLOPT_PINNEDPUBLICKEY": 806, "CURLOPT_SSL_EC_CURVES": 807, "loadmem=": 808, "CURLOPT_SSLCERT_BLOB": 809, "CURLOPT_SSLCERT": 810, "CURLOPT_PROXY_SSLCERT": 811, "CURLOPT_SSLCERTTYPE": 812, "CURLOPT_PROXY_SSLCERTTYPE": 813, "CURLOPT_SSLKEY_BLOB": 814, "CURLOPT_SSLKEY": 815, "CURLOPT_PROXY_SSLKEY": 816, "CURLOPT_SSLKEYTYPE": 817, "CURLOPT_PROXY_SSLKEYTYPE": 818, "CURLOPT_AWS_SIGV4": 819, "CURLOPT_SSL_VERIFYPEER": 820, "CURLOPT_SSL_VERIFYHOST": 821, "CURLOPT_DOH_SSL_VERIFYPEER": 822, "CURLOPT_DOH_SSL_VERIFYHOST": 823, "CURLOPT_PROXY_SSL_VERIFYPEER": 824, "CURLOPT_PROXY_SSL_VERIFYHOST": 825, "CURLOPT_SSL_VERIFYSTATUS": 826, "CURLOPT_DOH_SSL_VERIFYSTATUS": 827, "CURLOPT_SSL_FALSESTART": 828, "CURLOPT_SSLVERSION": 829, "CURLOPT_PROXY_SSLVERSION": 830, "CURLOPT_SSL_OPTIONS": 831, "CURLOPT_PROXY_SSL_OPTIONS": 832, "CURLOPT_PATH_AS_IS": 833, ".ssh/known_hosts": 834, "CURLOPT_SSH_KNOWNHOSTS": 835, "Couldn't find a known_hosts file!": 836, "CURLOPT_FILETIME": 837, "CURLOPT_CRLF": 838, "CURLOPT_QUOTE": 839, "CURLOPT_POSTQUOTE": 840, "CURLOPT_PREQUOTE": 841, "CURLOPT_COOKIE": 842, "CURLOPT_COOKIEFILE": 843, "CURLOPT_COOKIEJAR": 844, "CURLOPT_COOKIESESSION": 845, "CURLOPT_TIMECONDITION": 846, "CURLOPT_TIMEVALUE_LARGE": 847, "CURLOPT_CUSTOMREQUEST": 848, "CURLOPT_STDERR": 849, "CURLOPT_INTERFACE": 850, "CURLOPT_KRBLEVEL": 851, "CURLOPT_XFERINFOFUNCTION": 852, "CURLOPT_XFERINFODATA": 853, "CURLOPT_DNS_SERVERS": 854, "CURLOPT_DNS_INTERFACE": 855, "CURLOPT_DNS_LOCAL_IP4": 856, "CURLOPT_DNS_LOCAL_IP6": 857, "CURLOPT_TELNETOPTIONS": 858, "CURLOPT_RANDOM_FILE": 859, "CURLOPT_EGDSOCKET": 860, "CURLOPT_CONNECTTIMEOUT_MS": 861, "CURLOPT_DOH_URL": 862, "CURLOPT_SSL_CIPHER_LIST": 863, "CURLOPT_PROXY_SSL_CIPHER_LIST": 864, "CURLOPT_TLS13_CIPHERS": 865, "CURLOPT_PROXY_TLS13_CIPHERS": 866, "CURLOPT_FTP_USE_EPSV": 867, "CURLOPT_FTP_USE_EPRT": 868, "CURLOPT_DEBUGFUNCTION": 869, "CURLOPT_DEBUGDATA": 870, "CURLOPT_VERBOSE": 871, "CURLOPT_SSLENGINE": 872, "CURLOPT_FTP_CREATE_MISSING_DIRS": 873, "CURLOPT_MAXFILESIZE_LARGE": 874, "CURLOPT_IPRESOLVE": 875, "CURLOPT_USE_SSL": 876, "CURLOPT_FTP_SSL_CCC": 877, "CURLOPT_SOCKS5_GSSAPI_NEC": 878, "CURLOPT_SOCKS5_AUTH": 879, "CURLOPT_PROXY_SERVICE_NAME": 880, "CURLOPT_SERVICE_NAME": 881, "CURLOPT_FTP_ACCOUNT": 882, "CURLOPT_IGNORE_CONTENT_LENGTH": 883, "CURLOPT_FTP_SKIP_PASV_IP": 884, "CURLOPT_FTP_FILEMETHOD": 885, "CURLOPT_LOCALPORT": 886, "CURLOPT_LOCALPORTRANGE": 887, "CURLOPT_FTP_ALTERNATIVE_TO_USER": 888, "CURLOPT_SSL_SESSIONID_CACHE": 889, "CURLOPT_HTTP_CONTENT_DECODING": 890, "CURLOPT_HTTP_TRANSFER_DECODING": 891, "CURLOPT_TCP_KEEPALIVE": 892, "CURLOPT_TCP_KEEPIDLE": 893, "CURLOPT_TCP_KEEPINTVL": 894, "CURLOPT_TFTP_BLKSIZE": 895, "CURLOPT_MAIL_FROM": 896, "CURLOPT_MAIL_RCPT": 897, "CURLOPT_MAIL_RCPT_ALLLOWFAILS": 898, "CURLOPT_FTP_USE_PRET": 899, "CURLOPT_NEW_FILE_PERMS": 900, "CURLOPT_PROTOCOLS": 901, "CURLOPT_REDIR_PROTOCOLS": 902, "CURLOPT_HEADERFUNCTION": 903, "CURLOPT_HEADERDATA": 904, "CURLOPT_RESOLVE": 905, "CURLOPT_CONNECT_TO": 906, "CURLOPT_TLSAUTH_USERNAME": 907, "CURLOPT_TLSAUTH_PASSWORD": 908, "CURLOPT_TLSAUTH_TYPE": 909, "CURLOPT_PROXY_TLSAUTH_USERNAME": 910, "CURLOPT_PROXY_TLSAUTH_PASSWORD": 911, "CURLOPT_PROXY_TLSAUTH_TYPE": 912, "CURLOPT_GSSAPI_DELEGATION": 913, "CURLOPT_MAIL_AUTH": 914, "CURLOPT_SASL_AUTHZID": 915, "CURLOPT_SASL_IR": 916, "CURLOPT_SSL_ENABLE_NPN": 917, "CURLOPT_SSL_ENABLE_ALPN": 918, "CURLOPT_ABSTRACT_UNIX_SOCKET": 919, "CURLOPT_UNIX_SOCKET_PATH": 920, "CURLOPT_DEFAULT_PROTOCOL": 921, "CURLOPT_EXPECT_100_TIMEOUT_MS": 922, "CURLOPT_TFTP_NO_OPTIONS": 923, "CURLOPT_HAPPY_EYEBALLS_TIMEOUT_MS": 924, "CURLOPT_HAPROXYPROTOCOL": 925, "CURLOPT_DISALLOW_USERNAME_IN_URL": 926, "CURLOPT_ALTSVC": 927, "CURLOPT_HSTS": 928, "Transfer aborted due to critical error in another transfer": 929, "no transfer performed": 930, "no URL specified!": 931, "CURL_CA_BUNDLE": 932, "SSL_CERT_DIR": 933, "SSL_CERT_FILE": 934, "--disable": 935, "tool_operhlp.c": 936, "http://": 937, "https://": 938, "tool_paramhlp.c": 939, "unrecognized protocol '%s'": 940, "Enter %s password for user '%s':": 941, "Enter %s password for user '%s' on URL #%zu:": 942, "%s:%s": 943, "singlecwd": 944, "nocwd": 945, "multicwd": 946, "unrecognized ftp file method '%s', using default": 947, "passive": 948, "active": 949, "unrecognized ftp CCC method '%s', using default": 950, "policy": 951, "always": 952, "unrecognized delegation method '%s', using none": 953, "curl/7.81.0-DEV": 954, "proxy": 955, ".curlrc": 956, "tool_parsecfg.c": 957, "filename": 958, "%s:%d: warning: '%s' %s": 959, "%4ldk": 960, "%2ld.%0ldM": 961, "%4ldM": 962, "%2ld.%0ldG": 963, "%4ldG": 964, "%4ldT": 965, "%4ldP": 966, "%2ld:%02ld:%02ld": 967, "%3ldd %02ldh": 968, "%7ldd": 969, "DL% UL% Dled Uled Xfers Live Qd Total Current Left Speed": 970, "%-3s %-3s %s %s %5ld %5ld %5ld %s %s %s %s %5s": 971, "tool_setopt.c": 972, "\\x%02x": 973, "curl_easy_setopt(hnd, %s, %ldL);": 974, "curl_easy_setopt(hnd, %s, (long)%s);": 975, "option %s returned error (%d)": 976, "curl_easy_setopt(hnd, %s,": 977, "%s(long)%s%s": 978, "%s%ldL);": 979, "%s%luUL);": 980, "struct curl_slist *slist%d;": 981, "slist%d = NULL;": 982, "curl_slist_free_all(slist%d);": 983, "slist%d = curl_slist_append(slist%d, \"%s\");": 984, "part%d = curl_mime_addpart(mime%d);": 985, "curl_mime_subparts(part%d, mime%d);": 986, "mime%d = NULL;": 987, "curl_mime_data(part%d, \"%s\", CURL_ZERO_TERMINATED);": 988, "curl_mime_filedata(part%d, \"%s\");": 989, "curl_mime_filename(part%d, NULL);": 990, "curl_mime_data_cb(part%d, -1, (curl_read_callback) fread, \\": 991, "(curl_seek_callback) fseek, NULL, stdin);": 992, "curl_mime_encoder(part%d, \"%s\");": 993, "curl_mime_filename(part%d, \"%s\");": 994, "curl_mime_name(part%d, \"%s\");": 995, "curl_mime_type(part%d, \"%s\");": 996, "curl_mime_headers(part%d, slist%d, 1);": 997, "curl_mime *mime%d;": 998, "mime%d = curl_mime_init(hnd);": 999, "curl_mime_free(mime%d);": 1000, "curl_mimepart *part%d;": 1001, "curl_easy_setopt(hnd, %s, mime%d);": 1002, "curl_easy_setopt(hnd, %s, slist%d);": 1003, "functionpointer": 1004, "objectpointer": 1005, "(curl_off_t)%ld": 1006, "blobpointer": 1007, "%s set to a %s": 1008, "curl_easy_setopt(hnd, %s, \"%s\");": 1009, "curl_easy_setopt(hnd, %s, %s);": 1010, "tool_urlglob.c": 1011, "unmatched brace": 1012, "nested brace": 1013, "empty string within braces": 1014, "range overflow": 1015, "unexpected close bracket": 1016, "%c-%c%c": 1017, "bad range": 1018, "bad range specification": 1019, "unmatched close brace/bracket": 1020, "too many globs": 1021, "%s in URL position %zu: %s %*s^": 1022, "internal error: invalid pattern type (%d)": 1023, "%0*lu": 1024, "wovar->writefunc == writeTime": 1025, "tool_writeout.c": 1026, "\"%s\":": 1027, "%lu.%06lu": 1028, "\"%s\":null": 1029, "wovar->writefunc == writeString": 1030, "strinfo": 1031, "\"%s\":\"": 1032, "wovar->writefunc == writeLong": 1033, "\"%s\":%ld": 1034, "%03ld": 1035, "wovar->writefunc == writeOffset": 1036, "curl: unknown --write-out variable: '%s'": 1037, "u%04x": 1038, "\"curl_version\":\"": 1039, "ulnum <= (unsigned long) ((unsigned short)~0)": 1040, "ulnum <= (unsigned long) ((unsigned char)~0)": 1041, "uznum <= (size_t) (((unsigned long)~0) >> 1)": 1042, "uznum <= (size_t) (((unsigned int)~0) >> 1)": 1043, "uznum <= (size_t) ((unsigned int)~0)": 1044, "slnum >= 0": 1045, "(unsigned long) slnum <= (unsigned long) (((unsigned int)~0) >> 1)": 1046, "(unsigned long) slnum <= (unsigned long) ((unsigned int)~0)": 1047, "(unsigned long) slnum <= (unsigned long) ((unsigned short)~0)": 1048, "uznum <= (size_t) (((size_t)~0) >> 1)": 1049, "sonum >= 0": 1050, "sznum >= 0": 1051, "(size_t) sznum <= (size_t) (((unsigned int)~0) >> 1)": 1052, "uinum <= (unsigned int) ((unsigned short)~0)": 1053, "sinum >= 0": 1054, "../lib/dynbuf.c": 1055, "toobig": 1056, "s->init == 0xbee51da": 1057, "s->toobig": 1058, "indx < s->toobig": 1059, "!s->leng || s->bufr": 1060, "!indx": 1061, "Error: Curl_ssl_init failed": 1062, "Error: resolver_global_init failed": 1063, "CURL_GLOBAL_INIT": 1064, "easy.c": 1065, "Error: curl_global_init failed": 1066, "Error: Curl_open failed": 1067, "socket cb: socket %d REMOVED": 1068, "socket cb: socket %d UPDATED as %s%s": 1069, "socket cb: socket %d ADDED as %s%s": 1070, "call curl_multi_socket_action(socket %d)": 1071, "easy handle already used in multi handle": 1072, "pause: no change, early return": 1073, "CONNECT_ONLY is required!": 1074, "Failed to get recent socket": 1075, "escape.c": 1076, "%%%02X": 1077, "string": 1078, "ctrl >= REJECT_NADA": 1079, "getenv.c": 1080, "getinfo.c": 1081, "CURL_TIME": 1082, "CURL_DEBUG_SIZE": 1083, "hsts.c": 1084, "max-age=": 1085, "includesubdomains": 1086, "%d%02d%02d %02d:%02d:%02d": 1087, "%s%s \"%d%02d%02d %02d:%02d:%02d\"": 1088, "%s%s \"%s\"": 1089, "%s.%s.tmp": 1090, "%256s \"%64[^\"]\"": 1091, "unlimited": 1092, "Digest": 1093, "http_digest.c": 1094, "Proxy-": 1095, "LIMIT %s:%d %s reached memlimit": 1096, "wantedsize != 0": 1097, "MEM %s:%d malloc(%zu) = %p": 1098, "wanted_elements != 0": 1099, "wanted_size != 0": 1100, "MEM %s:%d calloc(%zu,%zu) = %p": 1101, "str != ((void *)0)": 1102, "MEM %s:%d strdup(%p) (%zu) = %p": 1103, "MEM %s:%d realloc(%p, %zu) = %p": 1104, "MEM %s:%d free(%p)": 1105, "SEND %s:%d send(%lu) = %ld": 1106, "RECV %s:%d recv(%lu) = %ld": 1107, "FD %s:%d socketpair() = %d %d": 1108, "FD %s:%d accept() = %d": 1109, "FD %s:%d sclose(%d)": 1110, "FILE %s:%d fopen(\"%s\",\"%s\") = %p": 1111, "FILE %s:%d fdopen(\"%d\",\"%s\") = %p": 1112, "file != ((void *)0)": 1113, "FILE %s:%d fclose(%p)": 1114, "mime.c": 1115, "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/": 1116, "0123456789ABCDEF": 1117, "Content-Type": 1118, "Can't add itself as a subpart!": 1119, "; boundary=": 1120, "Content-Type: %s%s%s": 1121, "multipart/mixed": 1122, "application/octet-stream": 1123, "text/plain": 1124, "Content-Disposition": 1125, "multipart/": 1126, "attachment": 1127, "; filename=\"": 1128, "; name=\"": 1129, "Content-Disposition: %s%s%s%s%s%s%s": 1130, "Content-Transfer-Encoding": 1131, "Content-Transfer-Encoding: %s": 1132, "multipart/form-data": 1133, "form-data": 1134, "0123456789abcdefghijklmnopqrstuvwxyz": 1135, "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ": 1136, "(nil)": 1137, "strlen(work) <= sizeof(work)": 1138, "mprintf.c": 1139, "STATE: %s => %s handle %p; line %d (connection #%ld)": 1140, "data->multi->num_alive > 0": 1141, "multi.c": 1142, "!(data)->state.conncache_lock": 1143, "(data)->state.conncache_lock": 1144, "multi_done: status: %d prem: %d done: %d": 1145, "Connection still in use %zu, no more multi_done now!": 1146, "disconnecting": 1147, "Connection #%ld to host %s left intact": 1148, "Removing connect-only easy handle": 1149, "Removed with partial response": 1150, "!data->conn": 1151, "conn->handler": 1152, "Resolving timed out after %ld milliseconds": 1153, "Connection timed out after %ld milliseconds": 1154, "Operation timed out after %ld milliseconds with %ld out of %ld bytes received": 1155, "Operation timed out after %ld milliseconds with %ld bytes received": 1156, "Disconnected with pending data": 1157, "protocol_done": 1158, "multi changed, check CONNECT_PEND queue!": 1159, "data->conn": 1160, "Transfer was pending, now try another": 1161, "Hostname '%s' was found in DNS cache": 1162, "operation aborted by pre-request callback": 1163, "CONNECT_ONLY": 1164, "Transfer returned error": 1165, "data->state.buffer": 1166, "Aborted by callback": 1167, "((void *)0)": 1168, "data->magic == 0xc0dedbadU": 1169, "id < EXPIRE_LAST": 1170, "Internal error removing splay node = %d": 1171, "Internal error clearing splay node = %d": 1172, "Expire cleared (transfer %p)": 1173, "data->multi": 1174, "conn->bundle": 1175, "data->mstate == MSTATE_PENDING": 1176, "* Multi status: %d handles, %d alive": 1177, "handle %p, state %s, %d sockets": 1178, "INTERNAL CONFUSION": 1179, "SENDING": 1180, "RECVING": 1181, "[%s %s]": 1182, "multi": 1183, "%31[ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz]": 1184, "%02d:%02d:%02d%n": 1185, "%02d:%02d%n": 1186, "** Resuming transfer from byte position %ld": 1187, "%3ld %s %3ld %s %3ld %s %s %s %s %s %s %s": 1188, "Callback aborted": 1189, "CURL_ENTROPY": 1190, "/dev/urandom": 1191, "WARNING: Using weak random seed": 1192, "num > 0": 1193, "0123456789abcdef": 1194, "num > 1": 1195, "!strchr(fmt, '\\n')": 1196, "sendf.c": 1197, "CURL_SMALLSENDS": 1198, "Send failure: %s": 1199, "Recv failure: %s": 1200, "i < 3": 1201, "Write callback asked for PAUSE when not supported!": 1202, "Failure writing output to destination": 1203, "Failed writing header": 1204, "!(type & ~((1<<0)|(1<<1)))": 1205, "setopt.c": 1206, "FLUSH": 1207, "RELOAD": 1208, "Set-Cookie:": 1209, "share.c": 1210, "slist.c": 1211, "SXSTATE: %s => %s conn %p; line %d": 1212, "SOCKS4%s: connecting to HTTP proxy %s port %d": 1213, "SOCKS4 communication to %s:%d": 1214, "SOCKS4 non-blocking resolve of %s": 1215, "Hostname '%s' was found": 1216, "SOCKS4 connect to IPv4 %s (locally resolved)": 1217, "SOCKS4 connection to %s not supported": 1218, "Failed to resolve \"%s\" for SOCKS4 connect.": 1219, "Too long SOCKS proxy user name, can't use!": 1220, "SOCKS4: too long host name": 1221, "Failed to send SOCKS4 connect request.": 1222, "SOCKS4: Failed receiving connect request ack: %s": 1223, "connection to proxy closed": 1224, "SOCKS4 reply has wrong version, version should be 0.": 1225, "SOCKS4%s request granted.": 1226, "Can't complete SOCKS4 connection to %d.%d.%d.%d:%d. (%d), Unknown.": 1227, "SOCKS5: connecting to HTTP proxy %s port %d": 1228, "warning: unsupported value passed to CURLOPT_SOCKS5_AUTH: %lu": 1229, "Unable to send initial SOCKS5 request.": 1230, "Unable to receive initial SOCKS5 response.": 1231, "Connection to proxy closed": 1232, "Received invalid version in initial SOCKS5 response.": 1233, "SOCKS5 GSSAPI per-message authentication is not supported.": 1234, "No authentication method was acceptable.": 1235, "Undocumented SOCKS5 mode attempted to be used by server.": 1236, "Excessive user name length for proxy auth": 1237, "Excessive password length for proxy auth": 1238, "Failed to send SOCKS5 sub-negotiation request.": 1239, "Unable to receive SOCKS5 sub-negotiation response.": 1240, "User was rejected by the SOCKS5 server (%d %d).": 1241, "SOCKS5: hostname '%s' found": 1242, "Failed to resolve \"%s\" for SOCKS5 connect.": 1243, "SOCKS5 connect to IPv4 %s (locally resolved)": 1244, "SOCKS5 connect to IPv6 %s (locally resolved)": 1245, "SOCKS5 connection to %s not supported": 1246, "SOCKS5 connect to %s:%d (remotely resolved)": 1247, "Failed to send SOCKS5 connect request.": 1248, "Failed to receive SOCKS5 connect request ack.": 1249, "SOCKS5 reply has wrong version, version should be 5.": 1250, "Can't complete SOCKS5 connection to %s. (%d)": 1251, "SOCKS5 reply has wrong address type.": 1252, "SOCKS5 request granted.": 1253, "Operation too slow. Less than %ld bytes/sec transferred the last %ld seconds": 1254, "strdup.c": 1255, "No error": 1256, "Unsupported protocol": 1257, "Failed initialization": 1258, "URL using bad/illegal format or missing URL": 1259, "Couldn't resolve proxy name": 1260, "Couldn't resolve host name": 1261, "Couldn't connect to server": 1262, "Weird server reply": 1263, "Access denied to remote resource": 1264, "FTP: The server failed to connect to data port": 1265, "FTP: Accepting server connect has timed out": 1266, "FTP: The server did not accept the PRET command.": 1267, "FTP: unknown PASS reply": 1268, "FTP: unknown PASV reply": 1269, "FTP: unknown 227 response format": 1270, "FTP: can't figure out the host in the PASV response": 1271, "Error in the HTTP2 framing layer": 1272, "FTP: couldn't set file type": 1273, "Transferred a partial file": 1274, "FTP: couldn't retrieve (RETR failed) the specified file": 1275, "Quote command returned error": 1276, "HTTP response code said error": 1277, "Failed writing received data to disk/application": 1278, "Upload failed (at start/before it took off)": 1279, "Failed to open/read local data from file/application": 1280, "Out of memory": 1281, "Timeout was reached": 1282, "FTP: command PORT failed": 1283, "FTP: command REST failed": 1284, "Requested range was not delivered by the server": 1285, "Internal problem setting up the POST": 1286, "SSL connect error": 1287, "Couldn't resume download": 1288, "Couldn't read a file:// file": 1289, "LDAP: cannot bind": 1290, "LDAP: search failed": 1291, "A required function in the library was not found": 1292, "Operation was aborted by an application callback": 1293, "A libcurl function was given a bad argument": 1294, "Failed binding local connection end": 1295, "Number of redirects hit maximum amount": 1296, "An unknown option was passed in to libcurl": 1297, "Malformed option provided in a setopt": 1298, "Server returned nothing (no headers, no data)": 1299, "SSL crypto engine not found": 1300, "Can not set SSL crypto engine as default": 1301, "Failed to initialise SSL crypto engine": 1302, "Failed sending data to the peer": 1303, "Failure when receiving data from the peer": 1304, "Problem with the local SSL certificate": 1305, "Couldn't use specified SSL cipher": 1306, "SSL peer certificate or SSH remote key was not OK": 1307, "Problem with the SSL CA cert (path? access rights?)": 1308, "Unrecognized or bad HTTP Content or Transfer-Encoding": 1309, "Invalid LDAP URL": 1310, "Maximum file size exceeded": 1311, "Requested SSL level failed": 1312, "Failed to shut down the SSL connection": 1313, "Failed to load CRL file (path? access rights?, format?)": 1314, "Issuer check against peer certificate failed": 1315, "Send failed since rewinding of the data stream failed": 1316, "Login denied": 1317, "TFTP: File Not Found": 1318, "TFTP: Access Violation": 1319, "Disk full or allocation exceeded": 1320, "TFTP: Illegal operation": 1321, "TFTP: Unknown transfer ID": 1322, "Remote file already exists": 1323, "TFTP: No such user": 1324, "Conversion failed": 1325, "Caller must register CURLOPT_CONV_ callback options": 1326, "Remote file not found": 1327, "Error in the SSH layer": 1328, "Socket not ready for send/recv": 1329, "RTSP CSeq mismatch or invalid CSeq": 1330, "RTSP session error": 1331, "Unable to parse FTP file list": 1332, "Chunk callback failed": 1333, "The max connection limit is reached": 1334, "SSL public key does not match pinned public key": 1335, "SSL server certificate status verification FAILED": 1336, "Stream error in the HTTP/2 framing layer": 1337, "API function called from within callback": 1338, "An authentication function returned an error": 1339, "HTTP/3 error": 1340, "QUIC connection error": 1341, "proxy handshake error": 1342, "SSL Client Certificate required": 1343, "Unknown error": 1344, "Please call curl_multi_perform() soon": 1345, "Invalid multi handle": 1346, "Invalid easy handle": 1347, "Internal error": 1348, "Invalid socket argument": 1349, "Unknown option": 1350, "The easy handle is already added to a multi handle": 1351, "Wakeup is unavailable or failed": 1352, "Unknown share option": 1353, "Share currently in use": 1354, "Invalid share handle": 1355, "Feature not enabled in this library": 1356, "CURLSHcode unknown": 1357, "An invalid CURLU pointer was passed as argument": 1358, "An invalid 'part' argument was passed as argument": 1359, "Malformed input to a URL function": 1360, "Port number was not a decimal number between 0 and 65535": 1361, "This libcurl build doesn't support the given URL scheme": 1362, "URL decode error, most likely because of rubbish in the input": 1363, "A memory function failed": 1364, "Credentials was passed in the URL when prohibited": 1365, "An unknown part ID was passed to a URL API function": 1366, "No scheme part in the URL": 1367, "No user part in the URL": 1368, "No password part in the URL": 1369, "No options part in the URL": 1370, "No host part in the URL": 1371, "No port part in the URL": 1372, "No query part in the URL": 1373, "No fragment part in the URL": 1374, "No zoneid part in the URL": 1375, "Bad login part": 1376, "Bad IPv6 address": 1377, "Bad hostname": 1378, "Bad file:// URL": 1379, "Unsupported number of slashes": 1380, "Bad scheme": 1381, "Bad path": 1382, "Bad fragment": 1383, "Bad query": 1384, "Bad password": 1385, "Bad user": 1386, "CURLUcode unknown": 1387, "err >= 0": 1388, "Unknown error %d": 1389, "thislen": 1390, "thisheader[thislen-1] != ':'": 1391, "transfer.c": 1392, "Moving trailers state machine from initialized to sending.": 1393, "operation aborted by trailing headers callback": 1394, "Successfully compiled trailers.": 1395, "operation aborted by callback": 1396, "Read callback asked for PAUSE when not supported!": 1397, "read function returned funny value": 1398, "%zx%s": 1399, "Signaling end of chunked upload after trailers.": 1400, "Signaling end of chunked upload via terminating chunk.": 1401, "Cannot rewind mime/post data": 1402, "seek callback returned error %d": 1403, "the ioctl callback returned %d": 1404, "ioctl callback returned error %d": 1405, "necessary data rewind wasn't possible": 1406, "The requested document is not new enough": 1407, "The requested document is not old enough": 1408, "readwrite_data: we're done!": 1409, "nread <= 0, server closed connection, bailing": 1410, "Excess found: excess = %zd url = %s (zero-length body)": 1411, "ignoring body": 1412, "Failed reading the chunked-encoded stream": 1413, "%s in chunked-encoding": 1414, "Leftovers after chunking: % ldu bytes": 1415, "Increasing bytecount by %zu": 1416, "excess found in a read": 1417, "we are done reading and this is set to close, stop send": 1418, "Failed to alloc scratch buffer!": 1419, "We are completely uploaded and fine": 1420, "Curl_readwrite: forcibly told to drain data": 1421, "select/poll returned error": 1422, "Done waiting for 100-continue": 1423, "transfer closed with %ld bytes remaining to read": 1424, "transfer closed with outstanding read data remaining": 1425, "conn->sockfd != -1": 1426, "conn->writesockfd != -1": 1427, "No URL set!": 1428, "User-Agent: %s": 1429, "type != FOLLOW_NONE": 1430, "data->state.uh": 1431, "Maximum (%ld) redirects followed": 1432, "Issue another request to this URL: '%s'": 1433, "Switch from POST to GET": 1434, "Switch to %s": 1435, "REFUSED_STREAM, retrying a fresh connect": 1436, "Connection died, tried %d times before giving up": 1437, "retry": 1438, "conn != ((void *)0)": 1439, "(sockindex <= 1) && (sockindex >= -1)": 1440, "url.c": 1441, "h->family": 1442, "/etc/ssl/certs/ca-certificates.crt": 1443, "Error: calloc of Curl_easy failed": 1444, "Closing connection %ld": 1445, "!conn->bundle": 1446, "Curl_disconnect when inuse: %zu": 1447, "Too old connection (%ld seconds idle), disconnect it": 1448, "Too old connection (%ld seconds since creation), disconnect it": 1449, "Connection %ld seems to be dead!": 1450, "can multiplex": 1451, "serially": 1452, "Found bundle for host %s: %p [%s]": 1453, "Server doesn't support multiplex yet, wait": 1454, "Server doesn't support multiplex (yet)": 1455, "Could multiplex, but not asked to!": 1456, "Can not multiplex, even if we wanted to!": 1457, "Connection #%ld is still name resolving, can't reuse": 1458, "Connection #%ld isn't open enough, can't reuse": 1459, "Connection #%ld has different SSL parameters, can't reuse": 1460, "Connection #%ld has not started SSL connect, can't reuse": 1461, "Multiplexed connection found!": 1462, "Found pending candidate for reuse and CURLOPT_PIPEWAIT is set": 1463, "Connected to %s (%s) port %u (#%ld)": 1464, "IDN support not present, can't parse Unicode domains": 1465, "Default to force-close": 1466, "Protocol \"%s\" not supported or disabled in libcurl": 1467, "Invalid zoneid: %s; %s": 1468, "%s://%s": 1469, "curl_url_set rejected %s: %s": 1470, "https": 1471, "Switched from HTTP to HTTPS due to HSTS => %s": 1472, "http_proxy": 1473, "all_proxy": 1474, "ALL_PROXY": 1475, "Uses proxy env variable %s == '%s'": 1476, "socks5h": 1477, "socks5": 1478, "socks4a": 1479, "socks4": 1480, "socks": 1481, "Unsupported proxy scheme for '%s'": 1482, "Unsupported proxy syntax in '%s'": 1483, "Unsupported proxy '%s', libcurl is built without the HTTPS-proxy support.": 1484, "memory shortage": 1485, "no_proxy": 1486, "NO_PROXY": 1487, "Couldn't find host %s in the %s file; using defaults": 1488, "ftp@example.com": 1489, "Please URL encode %% as %%25, see RFC 6874.": 1490, "Invalid IPv6 address format": 1491, "No valid port number in connect to host string (%s)": 1492, "%s%s%s": 1493, "Connecting to hostname: %s": 1494, "Connecting to port: %d": 1495, "CURL_ALTSVC_HTTP": 1496, "Alt-svc connecting from [%s]%s:%d to [%s]%s:%d": 1497, "Unix socket path too long: '%s'": 1498, "Failed to resolve host '%s' with timeout after %ld ms": 1499, "Could not resolve host: %s": 1500, "Couldn't resolve proxy '%s'": 1501, "conn->dns_entry == ((void *)0)": 1502, "conn->handler->connect_it": 1503, "conn->handler->done": 1504, "conn->user": 1505, "conn->passwd": 1506, "Re-using existing connection! (#%ld) with %s %s": 1507, "No more connections allowed to host %s: %zu": 1508, "No connections available in cache": 1509, "No connections available.": 1510, "NTLM picked AND auth done set, clear picked!": 1511, "NTLM-proxy picked AND auth done set, clear picked!": 1512, "urlapi.c": 1513, "%%%02x": 1514, "!buf || (buflen > 40)": 1515, "[%*45[0123456789abcdefABCDEF:.]%c%n": 1516, "%*[^]]%c%n": 1517, "0123456789abcdefABCDEF:.": 1518, "%u.%u.%u.%u": 1519, "localhost/": 1520, "127.0.0.1/": 1521, "dict.": 1522, "ldap.": 1523, "imap.": 1524, "smtp.": 1525, "pop3.": 1526, "file://%s%s%s": 1527, "%%25%s]": 1528, "storep": 1529, "CURL_VERSION": 1530, "zlib/%s": 1531, "i <= 17": 1532, "wc->protdata == ((void *)0)": 1533, "wildcard.c": 1534, "vauth/digest.c": 1535, "auth-int": 1536, "auth-conf": 1537, "nonce=\"": 1538, "realm=\"": 1539, "algorithm=": 1540, "qop=\"": 1541, "md5-sess": 1542, "nonce": 1543, "stale": 1544, "realm": 1545, "opaque": 1546, "algorithm": 1547, "MD5-sess": 1548, "SHA-256": 1549, "SHA-256-SESS": 1550, "SHA-512-256": 1551, "SHA-512-256-SESS": 1552, "userhash": 1553, "%s:%s:%s": 1554, "%s:%s:%08x:%s:%s:%s": 1555, "username=\"%s\", realm=\"%s\", nonce=\"%s\", uri=\"%s\", response=\"%s\"": 1556, "%s/%s@%s": 1557, "%s@%s": 1558, "vtls/vtls.c": 1559, "!*dest": 1560, "Unrecognized parameter value passed via CURLOPT_SSLVERSION": 1561, "CURL_SSLVERSION_MAX incompatible with CURL_SSLVERSION": 1562, "conn->bits.proxy_ssl_connected[sockindex]": 1563, "Didn't find": 1564, "Found": 1565, "%s Session ID in cache for %s %s://%s:%d": 1566, "PROXY": 1567, "server": 1568, "Added Session ID to cache for %s://%s:%d [%s]": 1569, "-----BEGIN PUBLIC KEY-----": 1570, "-----END PUBLIC KEY-----": 1571, "sha256//": 1572, ";sha256//": 1573, "%s%s%s%s": 1574, "CURL_SSL_BACKEND": 1575, "altsvc.c": 1576, "%10s %512s %u %10s %512s %u \"%64[^\"]\" %u %u": 1577, "%s %s %u %s %s %u \"%d%02d%02d %02d:%02d:%02d\" %u %d": 1578, "Excessive alt-svc header, ignoring.": 1579, "clear": 1580, "Excessive alt-svc host name, ignoring.": 1581, "Unknown alt-svc port number, ignoring.": 1582, "persist": 1583, "Added alt-svc: %s:%d over %s": 1584, "Unknown alt-svc protocol \"%s\", skipping.": 1585, "srchost": 1586, "dstentry": 1587, "asyn-thread.c": 1588, "hints": 1589, "td->thread_hnd != (pthread_t *)0": 1590, "asynch resolve failed": 1591, "entry": 1592, "getaddrinfo() thread failed to start": 1593, "base64.c": 1594, "%c%c==": 1595, "%c%c%c=": 1596, "%c%c%c%c": 1597, "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_": 1598, "bufref.c": 1599, "br->signature == 0x5c48e9b2": 1600, "br->ptr || !br->len": 1601, "ptr || !len": 1602, "len <= 8000000": 1603, "*bundlep == ((void *)0)": 1604, "conncache.c": 1605, "%ld%s": 1606, "Added connection %ld. The cache now contains %zu members": 1607, "The cache now contains %zu members": 1608, "Connection cache is full, closing the oldest one": 1609, "kill all": 1610, "Failed to set SO_KEEPALIVE on fd %d": 1611, "Failed to set TCP_KEEPIDLE on fd %d": 1612, "Failed to set TCP_KEEPINTVL on fd %d": 1613, "Couldn't bind to interface '%s'": 1614, "Local Interface %s is ip %s using address family %i": 1615, "Name '%s' family %i resolved to '%s' family %i": 1616, "Couldn't bind to '%s'": 1617, "getsockname() failed with errno %d: %s": 1618, "Local port: %hu": 1619, "Bind to local port %hu failed, trying next": 1620, "bind failed with errno %d: %s": 1621, "getpeername() failed with errno %d: %s": 1622, "ssrem inet_ntop() failed with errno %d: %s": 1623, "ssloc inet_ntop() failed with errno %d: %s": 1624, "unknown proxytype option given": 1625, "sockindex >= 0 && sockindex <= 1": 1626, "After %ldms connect time, move on!": 1627, "connect to %s port %u failed: %s": 1628, "Connection timeout after %ld ms": 1629, "Failed to connect to %s port %u after %ld ms: %s": 1630, "Could not set TCP_NODELAY: %s": 1631, "sa_addr inet_ntop() failed with errno %d: %s": 1632, "Trying %s:%d...": 1633, "Failed to enable TCP Fast Open on fd %d": 1634, "Immediate connect fail for %s: %s": 1635, "Connection time-out": 1636, "family0 == %s, family1 == %s": 1637, "connect.c": 1638, "content_encoding.c": 1639, "Error while processing content unencoding: %s": 1640, "1.2.0.4": 1641, "identity": 1642, "chunked": 1643, "cookie.c": 1644, "ignoring failed cookie_init for %s": 1645, "localhost": 1646, "%4095[^; =] =%4095[^; ]": 1647, "oversized cookie dropped, name/val %zu + %zu bytes": 1648, "__Secure-": 1649, "__Host-": 1650, "secure": 1651, "httponly": 1652, "domain": 1653, "skipped cookie with bad tailmatch domain: %s": 1654, "version": 1655, "max-age": 1656, "expires": 1657, "#HttpOnly_": 1658, "FALSE": 1659, "Replaced": 1660, "Added": 1661, "%s cookie %s=\"%s\" for domain %s, path %s, expire %ld": 1662, "unknown": 1663, "%s%s%s %s %s %s %ld %s %s": 1664, "WARNING: failed to save cookies in %s: %s": 1665, "curl_addrinfo.c": 1666, "(he->h_name != ((void *)0)) && (he->h_addr_list != ((void *)0))": 1667, "inaddr && hostname": 1668, "ADDR %s:%d freeaddrinfo(%p)": 1669, "ADDR %s:%d getaddrinfo() = %p": 1670, 