{"": 0, "push~reg8": 1, "mov~reg8~reg8": 2, "sub~reg8~imm": 3, "mov~ptr8~reg8": 4, "mov~reg8~ptr8": 5, "mov~reg4~imm": 6, "call": 7, "cmp~ptr8~imm": 8, "jne": 9, "jmp": 10, "leave": 11, "ret": 12, "add~reg8~imm": 13, "pop~reg8": 14, "lea~reg8~ptr": 15, "je": 16, "mov~ptr4~reg4": 17, "xor~reg4~reg4": 18, "movzx~reg4~ptr1": 19, "test~reg1~reg1": 20, "mov~reg4~ptr4": 21, "test~reg4~reg4": 22, "sub~reg8~reg8": 23, "mov~ptr4~imm": 24, "time": 25, "add~reg8~reg8": 26, "mov~reg4~reg4": 27, "localtime": 28, "test~reg8~reg8": 29, "strcmp": 30, "__getreent": 31, "mov~ptr1~imm": 32, "cmp~reg4~imm": 33, "xor~reg4~imm": 34, "mov~ptr8~imm": 35, "cmp~reg1~imm": 36, "sub~reg8~ptr8": 37, "fwrite": 38, "call~imm": 39, "nop": 40, "cmp~ptr4~imm": 41, "cmp~reg8~ptr8": 42, "jb": 43, "cmp~ptr8~reg8": 44, "jbe": 45, "movzx~reg4~reg1": 46, "add~ptr8~reg8": 47, "fputc": 48, "fflush": 49, "imul~reg8~ptr8": 50, "cmp~reg8~imm": 51, "and~reg4~imm": 52, "ja": 53, "memcmp": 54, "add~ptr8~imm": 55, "memchr": 56, "memcpy": 57, "mov~ptr1~reg1": 58, "movsx~reg4~ptr1": 59, "strchr": 60, "strrchr": 61, "strlen": 62, "memmove": 63, "sub~reg4~imm": 64, "lea~reg4~ptr": 65, "cdqe": 66, "imul~reg8~reg8~imm": 67, "shr~reg8~imm": 68, "shr~reg4~imm": 69, "imul~reg4~reg4~imm": 70, "sub~reg4~reg4": 71, "cdq": 72, "idiv~ptr4": 73, "div~reg4": 74, "fputs": 75, "jns": 76, "movabs~reg8~imm": 77, "cmp~reg8~reg8": 78, "jge": 79, "jle": 80, "jg": 81, "setne~reg1": 82, "pxor~reg16~reg16": 83, "cvtsi2sd~reg16~ptr8": 84, "divsd~reg16~reg16": 85, "movsd~ptr8~reg16": 86, "movsd~reg16~ptr8": 87, "mulsd~reg16~reg16": 88, "cvtsi2sd~reg16~ptr4": 89, "mulsd~reg16~ptr8": 90, "cvttsd2si~reg4~reg16": 91, "movsxd~reg8~reg4": 92, "movq~reg16~reg8": 93, "memset": 94, "movapd~reg16~reg16": 95, "strtol": 96, "ioctl": 97, "movzx~reg4~ptr2": 98, "movzx~reg4~reg2": 99, "read": 100, "__errno": 101, "lseek": 102, "__assert_func": 103, "open": 104, "close": 105, "strerror": 106, "sete~reg1": 107, "cmp~ptr1~imm": 108, "strtok": 109, "strcpy": 110, "add~ptr4~imm": 111, "stat": 112, "js": 113, "utimes": 114, "mov~ptr2~imm": 115, "movsx~reg4~reg1": 116, "shl~reg8~imm": 117, "geteuid": 118, "getpwuid": 119, "fileno": 120, "ftell": 121, "cwde": 122, "jl": 123, "fread": 124, "fseek": 125, "jmp~reg8": 126, "mov~reg8~imm": 127, "getc": 128, "sscanf": 129, "jae": 130, "push~imm": 131, "strpbrk": 132, "strcspn": 133, "strncpy": 134, "cmp~ptr1~reg1": 135, "strstr": 136, "or~reg1~imm": 137, "or~reg8~imm": 138, "and~reg8~imm": 139, "or~reg4~imm": 140, "strdup": 141, "free": 142, "tcgetattr": 143, "tcsetattr": 144, "sub~ptr8~imm": 145, "and~reg4~ptr4": 146, "puts": 147, "strcasecmp": 148, "and~reg4~reg4": 149, "qsort": 150, "cmp~ptr4~reg4": 151, "or~reg8~reg8": 152, "pipe": 153, "__main": 154, "signal": 155, "fstat": 156, "push~ptr8": 157, "imul~reg8": 158, "sar~reg8~imm": 159, "ftruncate": 160, "shr~reg8~reg1": 161, "isatty": 162, "or~reg4~reg4": 163, "comisd~reg16~reg16": 164, "strncmp": 165, "movq~reg8~reg16": 166, "strtod": 167, "not~reg8": 168, "and~reg8~reg8": 169, "rep stosq~ptr8~reg8": 170, "fgets": 171, "cmovs~reg8~reg8": 172, "cqo": 173, "idiv~reg8": 174, "add~reg4~imm": 175, "cvttsd2si~reg8~reg16": 176, "cmovge~reg8~reg8": 177, "idiv~ptr8": 178, "__locale_ctype_ptr": 179, "and~ptr8~reg8": 180, "poll": 181, "imul~reg8~reg8": 182, "div~reg8": 183, "strtoul": 184, "idiv~reg4": 185, "sub~ptr4~imm": 186, "add~reg4~reg4": 187, "cmp~reg1~reg1": 188, "cmp~reg4~reg4": 189, "sub~ptr8~reg8": 190, "clock_gettime": 191, "gettimeofday": 192, "call~reg8": 193, "fsetxattr": 194, "fcntl": 195, "and~reg1~imm": 196, "getenv": 197, "mov~ptr2~reg2": 198, "test~reg2~reg2": 199, "rep movsq~ptr8~ptr8": 200, "shl~reg4~imm": 201, "not~reg4": 202, "cmp~reg4~ptr4": 203, "cvtsi2sd~reg16~reg8": 204, "unlink": 205, "fclose": 206, "fopen": 207, "socket": 208, "send": 209, "recv": 210, "socketpair": 211, "accept": 212, "fdopen": 213, "basename": 214, "sar~reg4~imm": 215, "or~ptr4~reg4": 216, "seta~reg1": 217, "neg~reg8": 218, "add~ptr4~reg4": 219, "or~ptr4~imm": 220, "and~ptr4~imm": 221, "neg~ptr8": 222, "div~ptr8": 223, "comisd~reg16~ptr2": 224, "sprintf": 225, "shr~reg1~imm": 226, "setbe~reg1": 227, "shl~reg4~reg1": 228, "sar~reg4~reg1": 229, "cmovs~reg4~reg4": 230, "shl~reg8~reg1": 231, "setle~reg1": 232, "gmtime_r": 233, "cmovg~reg4~reg4": 234, "cmovbe~reg8~reg8": 235, "ntohl": 236, "rol~reg4~imm": 237, "cmova~reg8~reg8": 238, "rename": 239, "and~ptr1~imm": 240, "or~ptr8~imm": 241, "and~ptr8~imm": 242, "__xpg_strerror_r": 243, "cmovle~reg8~reg8": 244, "cmp~reg2~reg2": 245, "if_nametoindex": 246, "tolower": 247, "strspn": 248, "inet_pton": 249, "zlibVersion": 250, "strtok_r": 251, "cmp~ptr2~reg2": 252, "pthread_mutex_destroy": 253, "pthread_mutex_init": 254, "pthread_mutex_lock": 255, "pthread_mutex_unlock": 256, "shl~ptr8~imm": 257, "shr~ptr8~imm": 258, "mul~reg8": 259, "setsockopt": 260, "cmp~ptr2~imm": 261, "htons": 262, "atoi": 263, "bind": 264, "getsockname": 265, "cmp~reg2~imm": 266, "ntohs": 267, "getsockopt": 268, "inet_ntop": 269, "getpeername": 270, "connect": 271, "cmovbe~reg4~reg4": 272, "sub~reg4~ptr4": 273, "inflate": 274, "inflateEnd": 275, "inflateInit2_": 276, "inflateInit_": 277, "movsx~reg8~reg1": 278, "xor~ptr8~reg8": 279, "movsx~reg4~reg2": 280, "freeaddrinfo": 281, "getaddrinfo": 282, "pthread_create": 283, "pthread_detach": 284, "pthread_join": 285, "write": 286, "cmp~reg2~ptr2": 287, "listen": 288, "shr~reg2~imm": 289, "setg~reg1": 290, "and~reg8~ptr8": 291, "strftime": 292, "getifaddrs": 293, "freeifaddrs": 294, "or~reg2~ptr2": 295, "MD5_Init": 296, "MD5_Update": 297, "MD5_Final": 298, "getpwuid_r": 299, "EVP_MD_CTX_new": 300, "EVP_sha256": 301, "EVP_DigestInit_ex": 302, "EVP_DigestUpdate": 303, "EVP_DigestFinal_ex": 304, "EVP_MD_CTX_free": 305, "getpid": 306, "sendto": 307, "recvfrom": 308, "ERR_error_string_n": 309, "CRYPTO_get_ex_new_index": 310, "RAND_status": 311, "UI_get_string_type": 312, "UI_get0_user_data": 313, "UI_OpenSSL": 314, "UI_method_get_reader": 315, "UI_get_input_flags": 316, "UI_set_result": 317, "UI_method_get_writer": 318, "BIO_new_mem_buf": 319, "d2i_X509_bio": 320, "PEM_read_bio_X509": 321, "X509_free": 322, "BIO_free": 323, "SSL_CTX_use_certificate": 324, "PEM_read_bio_PrivateKey": 325, "d2i_PrivateKey_bio": 326, "SSL_CTX_use_PrivateKey": 327, "EVP_PKEY_free": 328, "ERR_clear_error": 329, "PEM_read_bio_X509_AUX": 330, "ERR_peek_error": 331, "SSL_CTX_ctrl": 332, "ERR_peek_last_error": 333, "SSL_CTX_set_default_passwd_cb_userdata": 334, "SSL_CTX_set_default_passwd_cb": 335, "SSL_CTX_use_certificate_chain_file": 336, "ERR_get_error": 337, "SSL_CTX_use_certificate_file": 338, "ENGINE_ctrl": 339, "ENGINE_ctrl_cmd": 340, "BIO_s_file": 341, "BIO_new": 342, "d2i_PKCS12_bio": 343, "BIO_ctrl": 344, "PKCS12_PBE_add": 345, "PKCS12_parse": 346, "PKCS12_free": 347, "SSL_CTX_check_private_key": 348, "SSL_CTX_add_client_CA": 349, "SSL_CTX_use_PrivateKey_file": 350, "UI_create_method": 351, "UI_method_get_opener": 352, "UI_method_set_opener": 353, "UI_method_get_closer": 354, "UI_method_set_closer": 355, "UI_method_set_reader": 356, "UI_method_set_writer": 357, "ENGINE_load_private_key": 358, "UI_destroy_method": 359, "SSL_new": 360, "SSL_get_certificate": 361, "X509_get_pubkey": 362, "SSL_get_privatekey": 363, "EVP_PKEY_copy_parameters": 364, "EVP_PKEY_id": 365, "EVP_PKEY_get1_RSA": 366, "RSA_flags": 367, "SSL_free": 368, "RSA_free": 369, "BIO_s_mem": 370, "X509_NAME_print_ex": 371, "OPENSSL_init_ssl": 372, "ENGINE_by_id": 373, "ENGINE_finish": 374, "ENGINE_free": 375, "ENGINE_init": 376, "ENGINE_set_default": 377, "ENGINE_get_id": 378, "ENGINE_get_first": 379, "ENGINE_get_next": 380, "SSL_read": 381, "SSL_shutdown": 382, "SSL_set_connect_state": 383, "SSL_CTX_free": 384, "SSL_get_error": 385, "SSL_SESSION_free": 386, "X509_get_ext_d2i": 387, "ASN1_STRING_get0_data": 388, "ASN1_STRING_length": 389, "GENERAL_NAMES_free": 390, "X509_get_subject_name": 391, "X509_NAME_get_entry": 392, "X509_NAME_ENTRY_get_data": 393, "ASN1_STRING_type": 394, "ASN1_STRING_to_UTF8": 395, "CRYPTO_malloc": 396, "CRYPTO_free": 397, "SSL_ctrl": 398, "d2i_OCSP_RESPONSE": 399, "OCSP_response_status": 400, "OCSP_response_status_str": 401, "OCSP_response_get1_basic": 402, "SSL_get_peer_cert_chain": 403, "SSL_CTX_get_cert_store": 404, "OCSP_basic_verify": 405, "SSL_get_peer_certificate": 406, "X509_check_issued": 407, "EVP_sha1": 408, "OCSP_cert_to_id": 409, "OCSP_resp_find_status": 410, "OCSP_CERTID_free": 411, "OCSP_check_validity": 412, "OCSP_cert_status_str": 413, "OCSP_crl_reason_str": 414, "OCSP_BASICRESP_free": 415, "OCSP_RESPONSE_free": 416, "sar~ptr4~imm": 417, "SSL_alert_desc_string_long": 418, "SSL_get_ex_data": 419, "PEM_X509_INFO_read_bio": 420, "X509_STORE_add_cert": 421, "X509_STORE_add_crl": 422, "TLS_client_method": 423, "SSL_CTX_new": 424, "SSL_CTX_set_msg_callback": 425, "SSL_CTX_set_options": 426, "SSL_CTX_set_next_proto_select_cb": 427, "SSL_CTX_set_alpn_protos": 428, "SSL_CTX_set_cipher_list": 429, "SSL_CTX_set_ciphersuites": 430, "SSL_CTX_set_post_handshake_auth": 431, "SSL_CTX_load_verify_locations": 432, "X509_LOOKUP_file": 433, "X509_STORE_add_lookup": 434, "X509_load_crl_file": 435, "X509_STORE_set_flags": 436, "SSL_CTX_set_verify": 437, "SSL_CTX_set_keylog_callback": 438, "SSL_CTX_sess_set_new_cb": 439, "SSL_set_session": 440, "BIO_f_ssl": 441, "SSL_set_fd": 442, "SSL_set_bio": 443, "SSL_connect": 444, "SSL_get_current_cipher": 445, "SSL_CIPHER_get_name": 446, "SSL_get_version": 447, "SSL_get_verify_result": 448, "SSL_get0_alpn_selected": 449, "i2t_ASN1_OBJECT": 450, "BN_print": 451, "X509_EXTENSION_get_object": 452, "X509V3_EXT_print": 453, "X509_EXTENSION_get_data": 454, "ASN1_STRING_print": 455, "X509_get_issuer_name": 456, "X509_get_version": 457, "BIO_printf": 458, "X509_get_serialNumber": 459, "BIO_puts": 460, "X509_get0_signature": 461, "i2a_ASN1_OBJECT": 462, "X509_get_X509_PUBKEY": 463, "X509_PUBKEY_get0_param": 464, "X509_get0_extensions": 465, "X509_get0_notBefore": 466, "ASN1_TIME_print": 467, "X509_get0_notAfter": 468, "EVP_PKEY_get0_DSA": 469, "DSA_get0_pqg": 470, "DSA_get0_key": 471, "EVP_PKEY_get0_RSA": 472, "RSA_get0_key": 473, "BN_num_bits": 474, "EVP_PKEY_get0_DH": 475, "DH_get0_pqg": 476, "DH_get0_key": 477, "PEM_write_bio_X509": 478, "i2d_X509_PUBKEY": 479, "X509_verify_cert_error_string": 480, "SSL_pending": 481, "OpenSSL_version_num": 482, "RAND_bytes": 483, "EVP_DigestInit": 484, "SSL_set_ex_data": 485, "fnmatch": 486, "gethostname": 487, "DES_set_odd_parity": 488, "DES_set_key_unchecked": 489, "DES_ecb_encrypt": 490, "waitpid": 491, "kill": 492, "access": 493, "fork": 494, "dup2": 495, "exit": 496, "execl": 497, "or~reg2~imm": 498, "MD4_Init": 499, "MD4_Update": 500, "MD4_Final": 501, "setvbuf": 502, "printf": 503, "fprintf": 504, "xor~ptr4~reg4": 505, "xor~reg4~ptr4": 506, "toupper": 507, "sub~ptr4~reg4": 508, "abort": 509, "malloc": 510, "calloc": 511, "realloc": 512, "movss~reg16~ptr4": 513, "movss~ptr4~reg16": 514, "getloadavg": 515, "cvtsd2ss~reg16~reg16": 516, "getpwnam": 517, "getgrnam": 518, "pcre_compile2": 519, "pcre_fullinfo": 520, "pcre_exec": 521, "imul~reg4~ptr4": 522, "times": 523, "sar~reg1~imm": 524, "or~reg1~ptr1": 525, "or~reg8~ptr8": 526, "or~ptr8~reg8": 527, "and~ptr4~reg4": 528, "atol": 529, "xor~ptr4~imm": 530, "sar~reg8~reg1": 531, "putchar": 532, "openlog": 533, "strncasecmp": 534, "cmp~ptr4": 535, "xor~reg8~ptr8": 536, "syslog": 537, "strcat": 538, "sysconf": 539, "getpgid": 540, "getpgrp": 541, "sigemptyset": 542, "sigaction": 543, "neg~ptr4": 544, "getrlimit": 545, "semctl": 546, "chown": 547, "__imp___iob_func": 548, "__imp_isalpha": 549, "xor~reg8~reg8": 550, "rol~reg8~imm": 551, "ror~reg8~imm": 552, "rewind": 553, "__imp__stat64": 554, "__imp__errno": 555, "cvtsi2sd~reg16~reg4": 556, "subsd~reg16~reg16": 557, "sar~ptr8~imm": 558, "imul~reg4~reg4": 559, "imul~reg4": 560, "ucomisd~reg16~reg16": 561, "movq~reg16~ptr8": 562, "xorpd~reg16~reg16": 563, "sar~ptr8~reg1": 564, "setl~reg1": 565, "neg~reg4": 566, "setae~reg1": 567, "addsd~reg16~reg16": 568, "system": 569, "__imp__unlink": 570, "__imp_isprint": 571, "__imp_isspace": 572, "cmp~reg1~ptr1": 573, "putc": 574, "__imp__strdup": 575, "cmovge~reg4~ptr4": 576, "or~reg4~ptr4": 577, "fgetc": 578, "__imp__access": 579, "__imp__pclose": 580, "__imp__wunlink": 581, "__imp__popen": 582, "__imp__isatty": 583, "__imp_SetConsoleCtrlHandler": 584, "addsd~reg16~ptr8": 585, "divsd~reg16~ptr8": 586, "ucomisd~reg16~ptr8": 587, "fld~ptr2": 588, "fnstcw~ptr2": 589, "fldcw~ptr2": 590, "fistp~ptr4": 591, "fild~ptr4": 592, "fstp~ptr2": 593, "fsubp~st(1)": 594, "fmulp~st(1)": 595, "fld~ptr8": 596, "fldz": 597, "fucomip~st(1)": 598, "fstp~st(0)": 599, "fchs": 600, "fstp~ptr8": 601, "faddp~st(1)": 602, "fld1": 603, "fdivp~st(1)": 604, "cmovns~reg4~ptr4": 605, "add~ptr1~reg1": 606, "fild~ptr8": 607, "cvtsi2ss~reg16~ptr8": 608, "mulss~reg16~reg16": 609, "cvtss2sd~reg16~reg16": 610, "shl~ptr4~imm": 611, "shr~ptr4~imm": 612, "bswap~reg4": 613, "jno": 614, "movsx~reg4~ptr2": 615, "bsr~reg8~ptr8": 616, "xor~reg8~imm": 617, "shr~ptr8~reg1": 618, "sub~reg2~imm": 619, "div~ptr4": 620, "mul~reg4": 621, "mov~reg1~imm": 622, "cmovbe~reg4~ptr4": 623, "cmovle~reg4~ptr4": 624, "rol~reg2~imm": 625, "cmovle~reg4~reg4": 626, "sub~reg2~ptr2": 627, "sub~reg1~ptr1": 628, "and~reg2~ptr2": 629, "cmovle~reg8~ptr8": 630, "setp~reg1": 631, "cmovne~reg4~reg4": 632, "jp": 633, "and~reg2~imm": 634, "subsd~reg16~ptr8": 635, "cmovns~reg8~reg8": 636, "cmovl~reg8~reg8": 637, "cmovl~reg4~reg4": 638, "movsx~reg8~reg2": 639, "movsx~reg8~ptr2": 640, "cmova~reg4~reg4": 641, "or~ptr1~imm": 642, "xor~reg1~imm": 643, "and~reg1~ptr1": 644, "xor~reg1~ptr1": 645, "movsx~reg8~ptr1": 646, "ror~reg4~imm": 647, "test~reg8~imm": 648, "nop~ptr4": 649, "dec~reg4": 650, "bt~reg8~imm": 651, "test~reg4~imm": 652, "aesenc~reg16~reg16": 653, "movups~reg16~ptr2": 654, "aesenclast~reg16~reg16": 655, "movups~ptr2~reg16": 656, "endbr64": 657, "xorps~reg16~reg16": 658, "aesdec~reg16~reg16": 659, "aesdeclast~reg16~reg16": 660, "pxor~xmm8~reg16": 661, "pxor~xmm9~reg16": 662, "aesenc~xmm8~reg16": 663, "aesenc~xmm9~reg16": 664, "aesenclast~xmm8~reg16": 665, "aesenclast~xmm9~reg16": 666, "movdqu~reg16~ptr2": 667, "movups~ptr2~xmm8": 668, "movdqu~xmm8~ptr2": 669, "movups~ptr2~xmm9": 670, "movdqu~xmm9~ptr2": 671, "xorps~xmm9~xmm9": 672, "movdqa~xmm9~ptr2": 673, "movdqa~reg16~ptr2": 674, "movdqa~reg16~reg16": 675, "pshufb~reg16~reg16": 676, "paddq~reg16~xmm9": 677, "dec~reg8": 678, "xorps~xmm8~reg16": 679, "movaps~ptr2~reg16": 680, "pxor~xmm8~xmm8": 681, "pxor~xmm9~xmm9": 682, "pxor~xmm10~xmm10": 683, "pxor~xmm11~xmm11": 684, "pxor~xmm12~xmm12": 685, "pxor~xmm13~xmm13": 686, "pxor~xmm14~xmm14": 687, "pxor~xmm15~xmm15": 688, "movups~xmm11~ptr2": 689, "xorps~reg16~xmm11": 690, "pxor~xmm10~reg16": 691, "movdqa~xmm8~reg16": 692, "pxor~reg16~xmm10": 693, "pxor~reg16~xmm11": 694, "pxor~reg16~xmm12": 695, "pxor~reg16~xmm13": 696, "pxor~xmm8~xmm15": 697, "pxor~reg16~xmm14": 698, "pxor~reg16~xmm8": 699, "pxor~xmm10~xmm9": 700, "pxor~xmm11~xmm9": 701, "movdqa~ptr2~xmm10": 702, "pxor~xmm12~xmm9": 703, "pxor~xmm13~xmm9": 704, "movdqa~ptr2~xmm11": 705, "pxor~xmm14~xmm9": 706, "movdqa~ptr2~xmm12": 707, "pxor~xmm8~xmm9": 708, "movdqa~ptr2~xmm14": 709, "movdqa~ptr2~xmm8": 710, "pshufd~xmm9~xmm15~imm": 711, "xorps~reg16~xmm10": 712, "pxor~xmm12~reg16": 713, "bsf~reg8~reg8": 714, "xorps~reg16~xmm12": 715, "xorps~reg16~xmm13": 716, "movdqa~xmm10~xmm14": 717, "movdqa~xmm11~xmm15": 718, "movdqu~ptr2~reg16": 719, "movdqa~reg16~xmm10": 720, "movdqa~xmm15~reg16": 721, "movaps~xmm10~xmm11": 722, "aesdec~xmm8~reg16": 723, "aesdec~xmm9~reg16": 724, "aesimc~reg16~reg16": 725, "movaps~xmm11~reg16": 726, "movaps~xmm13~reg16": 727, "movaps~xmm10~xmm13": 728, "movdqa~xmm8~ptr2": 729, "pxor~xmm15~xmm8": 730, "pshufb~xmm15~reg16": 731, "movdqa~xmm9~reg16": 732, "psrlq~reg16~imm": 733, "movdqa~xmm10~reg16": 734, "pand~reg16~reg16": 735, "psllq~reg16~imm": 736, "pxor~reg16~xmm9": 737, "movdqa~xmm10~xmm15": 738, "psrlq~xmm15~imm": 739, "pxor~xmm15~reg16": 740, "pand~xmm15~reg16": 741, "pxor~reg16~xmm15": 742, "psllq~xmm15~imm": 743, "pxor~xmm15~xmm10": 744, "pand~reg16~xmm8": 745, "pand~xmm15~xmm8": 746, "movdqa~xmm12~reg16": 747, "movdqa~xmm11~reg16": 748, "movdqa~xmm13~xmm10": 749, "movdqa~reg16~xmm9": 750, "pxor~xmm11~xmm15": 751, "movdqa~xmm14~xmm10": 752, "por~xmm9~xmm8": 753, "por~xmm10~xmm11": 754, "pxor~xmm14~reg16": 755, "pand~xmm13~xmm11": 756, "pxor~xmm11~xmm8": 757, "pand~xmm14~xmm11": 758, "pand~xmm12~xmm11": 759, "pxor~xmm10~xmm12": 760, "pxor~xmm9~xmm12": 761, "pxor~xmm11~reg16": 762, "movdqa~xmm8~xmm12": 763, "por~xmm8~xmm11": 764, "pxor~xmm10~xmm14": 765, "pxor~xmm9~xmm13": 766, "pxor~xmm8~xmm14": 767, "pxor~xmm8~xmm13": 768, "movdqa~xmm13~reg16": 769, "pand~xmm11~reg16": 770, "movdqa~xmm14~reg16": 771, "pand~xmm12~xmm15": 772, "pand~xmm13~reg16": 773, "por~xmm14~reg16": 774, "pxor~xmm10~xmm11": 775, "movdqa~xmm11~xmm10": 776, "pand~xmm10~xmm8": 777, "movdqa~xmm14~xmm11": 778, "pxor~xmm13~xmm10": 779, "pand~xmm14~xmm13": 780, "movdqa~xmm12~xmm8": 781, "pand~xmm12~xmm10": 782, "movdqa~xmm9~xmm13": 783, "pxor~xmm8~xmm12": 784, "pand~xmm9~reg16": 785, "pand~xmm13~xmm14": 786, "pxor~xmm13~xmm11": 787, "movdqa~xmm9~xmm14": 788, "pand~reg16~xmm14": 789, "pand~reg16~xmm13": 790, "pxor~xmm14~xmm12": 791, "pxor~xmm13~xmm8": 792, "movdqa~xmm9~xmm12": 793, "pxor~xmm10~xmm13": 794, "pxor~xmm9~xmm8": 795, "pand~xmm10~xmm11": 796, "pand~xmm9~xmm15": 797, "pand~reg16~xmm12": 798, "pand~xmm11~xmm13": 799, "pxor~xmm11~xmm10": 800, "pxor~xmm15~xmm11": 801, "pand~xmm10~reg16": 802, "pxor~xmm15~ptr2": 803, "pxor~reg16~ptr2": 804, "pshufd~reg16~xmm15~imm": 805, "pshufd~xmm8~reg16~imm": 806, "pshufd~xmm9~reg16~imm": 807, "pshufd~xmm10~reg16~imm": 808, "pshufd~xmm11~reg16~imm": 809, "pshufd~xmm12~reg16~imm": 810, "pshufd~xmm13~reg16~imm": 811, "pshufd~xmm14~reg16~imm": 812, "pshufd~xmm15~xmm15~imm": 813, "pshufd~reg16~reg16~imm": 814, "pxor~xmm13~reg16": 815, "movdqa~reg16~xmm8": 816, "pxor~xmm10~xmm15": 817, "pxor~xmm12~xmm15": 818, "movdqa~xmm12~xmm15": 819, "pand~xmm12~reg16": 820, "pxor~xmm15~xmm13": 821, "movdqa~reg16~xmm13": 822, "pcmpeqd~reg16~reg16": 823, "movdqa~ptr2~reg16": 824, "pand~xmm8~reg16": 825, "pcmpeqb~xmm8~reg16": 826, "pcmpeqb~xmm9~reg16": 827, "pcmpeqb~xmm10~reg16": 828, "pcmpeqb~xmm11~reg16": 829, "pcmpeqb~xmm12~reg16": 830, "movdqa~ptr2~xmm9": 831, "pcmpeqb~xmm13~reg16": 832, "pand~xmm14~reg16": 833, "pcmpeqb~xmm14~reg16": 834, "pcmpeqb~xmm15~reg16": 835, "movdqa~ptr2~xmm13": 836, "movdqa~ptr2~xmm15": 837, "movdqu~xmm12~ptr2": 838, "inc~reg4": 839, "pshufd~xmm13~xmm14~imm": 840, "paddq~reg16~reg16": 841, "pand~xmm13~xmm12": 842, "pcmpgtd~xmm14~reg16": 843, "movdqu~ptr2~xmm15": 844, "movdqu~xmm10~ptr2": 845, "add~reg1~ptr1": 846, "add~reg1~imm": 847, "or~ptr1~reg1": 848, "ud2": 849, "pandn~reg16~reg16": 850, "psrld~reg16~imm": 851, "pand~reg16~xmm9": 852, "movdqa~reg16~xmm11": 853, "movdqa~reg16~xmm12": 854, "movdqa~reg16~xmm15": 855, "movdqa~reg16~xmm14": 856, "palignr~reg16~reg16~imm": 857, "movhlps~reg16~reg16": 858, "palignr~reg16~xmm8~imm": 859, "palignr~xmm8~xmm8~imm": 860, "pslldq~reg16~imm": 861, "movaps~reg16~ptr2": 862, "movaps~xmm8~ptr2": 863, "movaps~xmm9~ptr2": 864, "movaps~xmm10~ptr2": 865, "movaps~xmm11~ptr2": 866, "movaps~xmm12~ptr2": 867, "movaps~xmm13~ptr2": 868, "movaps~xmm14~ptr2": 869, "movaps~xmm15~ptr2": 870, "cmovbe~reg8~ptr8": 871, "__imp__strnicmp": 872, "mfence": 873, "__imp_DeleteFiber": 874, "__imp_CreateFiber": 875, "__imp_SwitchToFiber": 876, "__imp_ntohs": 877, "setb~reg1": 878, "__imp_getsockopt": 879, "__imp_WSAGetLastError": 880, "__imp_gethostbyname": 881, "__imp_ioctlsocket": 882, "repne scasb~reg1~ptr1": 883, "__imp_setsockopt": 884, "__imp_getsockname": 885, "cld": 886, "__imp_socket": 887, "__imp_connect": 888, "__imp_bind": 889, "__imp_closesocket": 890, "__imp_shutdown": 891, "__imp_WSASetLastError": 892, "__imp_recv": 893, "__imp_send": 894, "__imp_sendto": 895, "perror": 896, "__imp_GetSystemTime": 897, "__imp_SystemTimeToFileTime": 898, "__imp__close": 899, "__imp_SetLastError": 900, "__imp__read": 901, "__imp__write": 902, "__imp__lseek": 903, "__imp_GetLastError": 904, "ferror": 905, "feof": 906, "__imp__fileno": 907, "mul~ptr8": 908, "adc~reg8~imm": 909, "adc~reg8~reg8": 910, "shl~ptr4~reg1": 911, "cmovge~reg4~reg4": 912, "shl~ptr8~reg1": 913, "cmove~reg4~reg4": 914, "mulx~reg8~reg8~reg8": 915, "mulx~reg8~reg8~ptr8": 916, "adcx~reg8~reg8": 917, "adox~reg8~reg8": 918, "add~reg8~ptr8": 919, "adc~reg8~ptr8": 920, "sbb~reg8~reg8": 921, "psrldq~reg16~imm": 922, "pclmulqdq~reg16~reg16~imm": 923, "cmovb~reg8~reg8": 924, "adc~reg4~imm": 925, "shr~reg4~reg1": 926, "vmovdqa~ptr2~xmm11": 927, "vmovdqa~ptr2~reg16": 928, "vmovdqa~ptr2~xmm14": 929, "vpxor~reg16~reg16~ptr2": 930, "vpxor~xmm13~xmm13~ptr2": 931, "vpxor~xmm15~xmm15~ptr2": 932, "vpxor~xmm10~xmm10~ptr2": 933, "vpxor~xmm9~xmm9~ptr2": 934, "vpxor~xmm11~xmm11~ptr2": 935, "vpxor~xmm14~xmm14~ptr2": 936, "vpxor~xmm8~xmm8~ptr2": 937, "vpxor~xmm12~xmm12~ptr2": 938, "vmovdqu~ptr2~reg16": 939, "vmovdqu~ptr2~xmm13": 940, "vmovdqu~ptr2~xmm15": 941, "vmovdqu~ptr2~xmm10": 942, "vmovdqu~ptr2~xmm9": 943, "vmovdqu~ptr2~xmm11": 944, "vmovdqu~ptr2~xmm14": 945, "vmovdqu~ptr2~xmm8": 946, "vmovdqu~ptr2~xmm12": 947, "vmovdqa~ptr2~xmm8": 948, "vmovdqa~ptr2~xmm12": 949, "vmovdqa~ptr2~ymm3": 950, "vmovdqa~ptr2~ymm7": 951, "vbroadcasti128~ymm0~cs:xmmword_135B40": 952, "vbroadcasti128~ymm1~ptr2": 953, "vbroadcasti128~ymm2~ptr2": 954, "vbroadcasti128~ymm3~ptr2": 955, "vmovdqa32~ymm16~ymm0": 956, "vmovdqa32~ymm17~ymm1": 957, "vmovdqa32~ymm18~ymm2": 958, "vpaddd~ymm3~ymm3~ptr2": 959, "vmovdqa32~ymm20~ptr2": 960, "vmovdqa32~ymm19~ymm3": 961, "vpaddd~zmm0~zmm0~zmm1": 962, "vpxord~zmm3~zmm3~zmm0": 963, "vprold~zmm3~zmm3~10h": 964, "vpaddd~zmm2~zmm2~zmm3": 965, "vpxord~zmm1~zmm1~zmm2": 966, "vprold~zmm1~zmm1~0Ch": 967, "vprold~zmm3~zmm3~imm": 968, "vprold~zmm1~zmm1~imm": 969, "vpshufd~zmm2~zmm2~imm": 970, "vpshufd~zmm1~zmm1~imm": 971, "vpshufd~zmm3~zmm3~imm": 972, "vpaddd~ymm0~ymm0~ymm4": 973, "vpaddd~ymm1~ymm1~ymm5": 974, "vpaddd~ymm2~ymm2~ymm6": 975, "vpaddd~ymm3~ymm3~ymm7": 976, "vpxor~ymm12~ymm12~ymm0": 977, "vpxor~ymm13~ymm13~ymm1": 978, "vpxor~ymm14~ymm14~ymm2": 979, "vpxor~ymm15~ymm15~ymm3": 980, "vprold~ymm12~ymm12~10h": 981, "vprold~ymm13~ymm13~10h": 982, "vprold~ymm14~ymm14~10h": 983, "vprold~ymm15~ymm15~10h": 984, "vpaddd~ymm8~ymm8~ymm12": 985, "vpaddd~ymm9~ymm9~ymm13": 986, "vpaddd~ymm10~ymm10~ymm14": 987, "vpaddd~ymm11~ymm11~ymm15": 988, "vpxor~ymm4~ymm4~ymm8": 989, "vpxor~ymm5~ymm5~ymm9": 990, "vpxor~ymm6~ymm6~ymm10": 991, "vpxor~ymm7~ymm7~ymm11": 992, "vprold~ymm4~ymm4~0Ch": 993, "vprold~ymm5~ymm5~0Ch": 994, "vprold~ymm6~ymm6~0Ch": 995, "vprold~ymm7~ymm7~0Ch": 996, "vprold~ymm12~ymm12~imm": 997, "vprold~ymm13~ymm13~imm": 998, "vprold~ymm14~ymm14~imm": 999, "vprold~ymm15~ymm15~imm": 1000, "vprold~ymm4~ymm4~imm": 1001, "vprold~ymm5~ymm5~imm": 1002, "vprold~ymm6~ymm6~imm": 1003, "vprold~ymm7~ymm7~imm": 1004, "vpaddd~ymm0~ymm0~ymm5": 1005, "vpaddd~ymm1~ymm1~ymm6": 1006, "vpaddd~ymm2~ymm2~ymm7": 1007, "vpaddd~ymm3~ymm3~ymm4": 1008, "vpxor~ymm15~ymm15~ymm0": 1009, "vpxor~ymm12~ymm12~ymm1": 1010, "vpxor~ymm13~ymm13~ymm2": 1011, "vpxor~ymm14~ymm14~ymm3": 1012, "vpaddd~ymm10~ymm10~ymm15": 1013, "vpaddd~ymm11~ymm11~ymm12": 1014, "vpaddd~ymm8~ymm8~ymm13": 1015, "vpaddd~ymm9~ymm9~ymm14": 1016, "vpxor~ymm5~ymm5~ymm10": 1017, "vpxor~ymm6~ymm6~ymm11": 1018, "vpxor~ymm7~ymm7~ymm8": 1019, "vpxor~ymm4~ymm4~ymm9": 1020, "vpxor~ymm5~ymm5~ptr2": 1021, "vpxor~ymm13~ymm13~ptr2": 1022, "vmovdqu~ptr2~ymm5": 1023, "vmovdqu~ptr2~ymm13": 1024, "vpbroadcastd~ymm2~ptr4": 1025, "vpbroadcastd~ymm3~ptr4": 1026, "vpaddd~ymm28~ymm28~ptr2": 1027, "vmovdqa64~ymm4~ymm20": 1028, "vmovdqa64~ymm5~ymm21": 1029, "vmovdqa64~ymm6~ymm22": 1030, "vmovdqa64~ymm7~ymm23": 1031, "vmovdqa64~ymm8~ymm24": 1032, "vmovdqa64~ymm9~ymm25": 1033, "vmovdqa64~ymm10~ymm26": 1034, "vmovdqa64~ymm11~ymm27": 1035, "vmovdqa64~ymm12~ymm28": 1036, "vmovdqa64~ymm13~ymm29": 1037, "vmovdqa64~ymm14~ymm30": 1038, "vmovdqa64~ymm15~ymm31": 1039, "vmovdqa64~ymm16~ymm0": 1040, "vmovdqa64~ymm17~ymm1": 1041, "vmovdqa64~ymm18~ymm2": 1042, "vmovdqa64~ymm19~ymm3": 1043, "__imp__stricmp": 1044, "movsxd~reg8~ptr4": 1045, "shl~ptr1~imm": 1046, "shr~ptr1~imm": 1047, "xor~ptr1~reg1": 1048, "and~ptr1~reg1": 1049, "mov~reg2~imm": 1050, "adc~ptr8~reg8": 1051, "sbb~ptr8~reg8": 1052, "shrd~reg8~reg8~imm": 1053, "tzcnt~reg4~reg4": 1054, "sar~ptr1~imm": 1055, "not~ptr8": 1056, "lock xadd~ptr4~reg4": 1057, "add~ptr1~imm": 1058, "sub~ptr2~imm": 1059, "sub~ptr2~reg2": 1060, "bswap~reg8": 1061, "cmovns~reg8~ptr8": 1062, "lock add~ptr8~imm": 1063, "lock add~ptr4~imm": 1064, "rol~ptr4~reg1": 1065, "raise": 1066, "_exit": 1067, "__imp_GetEnvironmentVariableW": 1068, "_onexit": 1069, "__imp_GetModuleHandleExW": 1070, "__imp_VirtualProtect": 1071, "xor~ptr8~imm": 1072, "cmovae~reg8~ptr8": 1073, "__imp_MultiByteToWideChar": 1074, "gmtime": 1075, "bt~reg4~imm": 1076, "movd~reg4~reg16": 1077, "cpuid": 1078, "vmovdqu~reg16~ptr2": 1079, "vpxor~reg16~reg16~reg16": 1080, "vmovdqu~xmm15~ptr2": 1081, "vpaddb~xmm10~reg16~reg16": 1082, "vpaddb~xmm11~xmm10~reg16": 1083, "vpaddb~xmm12~xmm11~reg16": 1084, "vpaddb~xmm13~xmm12~reg16": 1085, "vpaddb~xmm14~xmm13~reg16": 1086, "vpxor~xmm9~reg16~xmm15": 1087, "vpaddb~reg16~xmm14~reg16": 1088, "vpxor~xmm10~xmm10~xmm15": 1089, "vpxor~xmm11~xmm11~xmm15": 1090, "vpshufb~reg16~reg16~reg16": 1091, "vpaddd~xmm10~reg16~ptr2": 1092, "vpaddd~xmm11~reg16~reg16": 1093, "vpaddd~xmm12~xmm10~reg16": 1094, "vpshufb~xmm10~xmm10~reg16": 1095, "vpaddd~xmm13~xmm11~reg16": 1096, "vpshufb~xmm11~xmm11~reg16": 1097, "vpaddd~xmm14~xmm12~reg16": 1098, "vpshufb~xmm12~xmm12~reg16": 1099, "vpaddd~reg16~xmm13~reg16": 1100, "vpshufb~xmm13~xmm13~reg16": 1101, "vpshufb~xmm14~xmm14~reg16": 1102, "vpclmulqdq~reg16~reg16~reg16": 1103, "vpxor~xmm12~xmm12~xmm15": 1104, "vmovups~reg16~ptr2": 1105, "vaesenc~xmm9~xmm9~reg16": 1106, "vpxor~xmm13~xmm13~xmm15": 1107, "vaesenc~xmm10~xmm10~reg16": 1108, "vpxor~xmm14~xmm14~xmm15": 1109, "vaesenc~xmm11~xmm11~reg16": 1110, "vaesenc~xmm12~xmm12~reg16": 1111, "vpxor~xmm8~xmm8~reg16": 1112, "vaesenc~xmm13~xmm13~reg16": 1113, "vmovups~xmm15~ptr2": 1114, "vaesenc~xmm14~xmm14~reg16": 1115, "vaesenc~xmm9~xmm9~xmm15": 1116, "vaesenc~xmm10~xmm10~xmm15": 1117, "movbe~reg8~ptr8": 1118, "vaesenc~xmm11~xmm11~xmm15": 1119, "vaesenc~xmm12~xmm12~xmm15": 1120, "vaesenc~xmm13~xmm13~xmm15": 1121, "vaesenc~xmm14~xmm14~xmm15": 1122, "vpclmulqdq~reg16~xmm8~reg16": 1123, "vpclmulqdq~xmm8~xmm8~reg16": 1124, "vpslldq~reg16~reg16~imm": 1125, "vpxor~reg16~reg16~xmm8": 1126, "vpalignr~reg16~reg16~reg16": 1127, "vpsrldq~reg16~reg16~imm": 1128, "vpalignr~xmm8~reg16~reg16": 1129, "vaesenclast~xmm9~xmm9~reg16": 1130, "vaesenclast~xmm10~xmm10~reg16": 1131, "vpaddb~reg16~reg16~reg16": 1132, "vaesenclast~xmm11~xmm11~reg16": 1133, "vaesenclast~xmm12~xmm12~reg16": 1134, "vaesenclast~xmm13~xmm13~reg16": 1135, "vaesenclast~xmm14~xmm14~reg16": 1136, "vmovups~ptr2~xmm9": 1137, "vmovups~ptr2~xmm10": 1138, "vmovdqa~xmm10~reg16": 1139, "vmovups~ptr2~xmm11": 1140, "vmovdqa~xmm11~reg16": 1141, "vmovups~ptr2~xmm12": 1142, "vmovdqa~xmm12~reg16": 1143, "vmovups~ptr2~xmm13": 1144, "vmovdqa~xmm13~reg16": 1145, "vmovups~ptr2~xmm14": 1146, "vmovdqa~xmm14~reg16": 1147, "cmp~reg4": 1148, "movaps~ptr2~xmm8": 1149, "movaps~ptr2~xmm9": 1150, "movaps~ptr2~xmm10": 1151, "movaps~ptr2~xmm11": 1152, "movaps~ptr2~xmm12": 1153, "movaps~ptr2~xmm13": 1154, "movaps~ptr2~xmm14": 1155, "movaps~ptr2~xmm15": 1156, "movdqa~xmm10~ptr2": 1157, "pshufb~reg16~xmm10": 1158, "vpunpckhqdq~xmm8~xmm15~xmm15": 1159, "vpclmulqdq~reg16~xmm15~reg16": 1160, "vpxor~xmm8~xmm8~xmm15": 1161, "vmovdqu~xmm14~ptr2": 1162, "vpshufb~xmm15~xmm14~xmm13": 1163, "vmovd~reg16~ptr4": 1164, "setbuf": 1165, "clearerr": 1166, "__imp__chmod": 1167, "inc~reg1": 1168, "add~reg1~reg1": 1169, "cmove~reg8~reg8": 1170, "mov~reg1~ptr1": 1171, "xchg~reg8~reg8": 1172, "punpckldq~reg16~reg16": 1173, "punpcklqdq~reg16~reg16": 1174, "punpckhqdq~xmm8~reg16": 1175, "pshufd~xmm8~xmm8~imm": 1176, "movd~reg16~ptr4": 1177, "shrd~reg4~reg4~imm": 1178, "add~reg4~ptr4": 1179, "vpaddd~xmm9~xmm11~reg16": 1180, "shld~reg4~reg4~imm": 1181, "vpsrldq~xmm8~reg16~imm": 1182, "vmovdqa~ptr2~xmm9": 1183, "vpsrld~xmm8~reg16~imm": 1184, "vpslldq~xmm10~reg16~imm": 1185, "vpaddd~reg16~reg16~reg16": 1186, "vpsrld~xmm9~xmm10~imm": 1187, "vpor~reg16~reg16~xmm8": 1188, "vpslld~xmm10~xmm10~imm": 1189, "vpxor~reg16~reg16~xmm9": 1190, "vpxor~reg16~reg16~xmm10": 1191, "vmovdqa~xmm11~ptr2": 1192, "vpslld~reg16~reg16~imm": 1193, "pshufd~xmm12~xmm12~imm": 1194, "pshufd~xmm13~xmm13~imm": 1195, "pshufd~xmm14~xmm14~imm": 1196, "punpckldq~xmm12~xmm14": 1197, "punpckhdq~reg16~xmm14": 1198, "punpckldq~xmm13~xmm15": 1199, "punpckhdq~reg16~xmm15": 1200, "movq~ptr8~xmm12": 1201, "psrldq~xmm12~imm": 1202, "movq~ptr8~reg16": 1203, "movq~ptr8~xmm13": 1204, "psrldq~xmm13~imm": 1205, "movq~xmm12~ptr8": 1206, "movq~xmm13~ptr8": 1207, "movq~xmm8~ptr8": 1208, "movq~xmm9~ptr8": 1209, "movq~xmm10~ptr8": 1210, "movq~xmm11~ptr8": 1211, "punpckldq~xmm12~reg16": 1212, "punpckldq~xmm13~reg16": 1213, "punpckldq~xmm8~xmm9": 1214, "punpckldq~xmm10~xmm11": 1215, "movdqa~xmm14~xmm12": 1216, "movdqa~xmm15~xmm13": 1217, "punpcklqdq~xmm12~xmm8": 1218, "punpcklqdq~xmm13~xmm10": 1219, "punpckhqdq~xmm14~xmm8": 1220, "punpckhqdq~xmm15~xmm10": 1221, "rol~ptr8~imm": 1222, "rol~reg4~reg1": 1223, "setge~reg1": 1224, "ror~reg8~reg1": 1225, "ror~reg4~reg1": 1226, "__imp_tolower": 1227, "add~ptr2~reg2": 1228, "shr~ptr2~imm": 1229, "stp~reg8~reg8~ptr": 1230, "adrp~reg8~imm": 1231, "mov~reg8~sp": 1232, "ldr~reg8~ptr": 1233, "cbnz~reg8": 1234, "movz~reg8~imm": 1235, "hint~imm": 1236, "ldp~reg8~reg8~ptr": 1237, "b": 1238, "test~ptr1~imm": 1239, "cmovne~reg8~reg8": 1240, "str~reg8~ptr": 1241, "bl": 1242, "add~reg8~reg8~reg8": 1243, "ldrb~reg4~ptr": 1244, "csel~reg8~reg8~xzr": 1245, "seto~reg1": 1246, "umulh~reg8~reg8~reg8": 1247, "mul~reg8~reg8~reg8": 1248, "cset~reg8~ne": 1249, "tbnz~reg8": 1250, "movz~reg4~imm": 1251, "adrp~reg8": 1252, "movk~reg4~lsl #16~imm": 1253, "cbz~reg8": 1254, "eor~reg8~reg8~reg8": 1255, "nop~ptr2": 1256, "blr~reg8": 1257, "add~reg8~reg8~imm": 1258, "mrs~reg8~tpidr_el0": 1259, "sub~reg8~reg8~imm": 1260, "b.eq": 1261, "add~reg8~sp~imm": 1262, "str~reg4~ptr": 1263, "ldr~reg4~ptr": 1264, "b.ne": 1265, "subs~reg8~reg8~imm": 1266, "str~wzr~ptr": 1267, "hlt": 1268, "brk~imm": 1269, "and~reg4~reg4~imm": 1270, "tbnz~reg4": 1271, "icall~ptr8": 1272, "cbnz~reg4": 1273, "add~reg8~reg8~reg4": 1274, "lock dec~ptr4": 1275, "cmp~reg4~lsl #12~imm": 1276, "sub~sp~sp~imm": 1277, "cmp~reg8~lsl #12~imm": 1278, "ccmp~reg4~hi~imm": 1279, "cbz~reg4": 1280, "sub~reg4~reg4~imm": 1281, "b.ls": 1282, "movn~reg8~imm": 1283, "mov~sp~reg8": 1284, "sub~reg8~reg8~reg8": 1285, "and~reg8~reg8~imm": 1286, "sub~reg8~sp~reg8": 1287, "cmp~sp~reg8": 1288, "lsl~reg8~reg8~imm": 1289, "str~reg8~ptr~imm": 1290, "imul~reg4~ptr4~imm": 1291, "stur~reg4~ptr": 1292, "lsl~reg4~reg4~imm": 1293, "sub~reg4~reg4~reg4": 1294, "sxtw~reg8~reg4": 1295, "stur~reg8~ptr": 1296, "orr~reg4~reg4~imm": 1297, "csel~reg4~reg4~reg4": 1298, "ldur~reg8~ptr": 1299, "cmn~reg8~imm": 1300, "cset~reg4~eq": 1301, "add~reg4~reg4~imm": 1302, "str~wzr~ptr~imm": 1303, "b.hs": 1304, "ldr~reg8~ptr~imm": 1305, "ldur~reg4~ptr": 1306, "tbz~reg4": 1307, "str~xzr~ptr": 1308, "csel~reg8~reg8~reg8": 1309, "stp~xzr~xzr~ptr": 1310, "stp~xzr~reg8~ptr": 1311, "b.gt": 1312, "b.lt": 1313, "stp~reg4~reg4~ptr": 1314, "ldp~reg4~reg4~ptr": 1315, "add~reg4~reg4~reg4": 1316, "b.lo": 1317, "ldurb~reg4~ptr": 1318, "strb~reg4~ptr~imm": 1319, "strb~wzr~ptr~imm": 1320, "sbfiz~reg8~reg8~imm": 1321, "b.ge": 1322, "ubfiz~reg8~reg8~imm": 1323, "ldrh~reg4~ptr": 1324, "sturb~reg4~ptr": 1325, "strb~wzr~ptr": 1326, "ccmp~reg8~reg8~gt": 1327, "csinc~reg4~reg4~wzr": 1328, "test~reg1~imm": 1329, "ldrsb~reg4~ptr": 1330, "strb~reg4~ptr": 1331, "orr~reg4~reg4~reg4": 1332, "b.hi": 1333, "lsr~reg8~reg8~imm": 1334, "udiv~reg4~reg4~reg4": 1335, "msub~reg4~reg4~reg4": 1336, "cmn~reg4~imm": 1337, "movn~reg4~imm": 1338, "umull~reg8~reg4~reg4": 1339, "stur~xzr~ptr": 1340, "b.le": 1341, "csel~reg4~reg4~wzr": 1342, "cmp~reg8~reg4~uxtw": 1343, "cmp~reg8~reg8~lsl #2": 1344, "tst~reg8~imm": 1345, "movz~reg4~lsl #16~imm": 1346, "tst~reg4~reg4": 1347, "ldrb~reg4~ptr~imm": 1348, "ror~reg4~reg4~imm": 1349, "bt~reg4~reg4": 1350, "asr~reg4~reg4~reg4": 1351, "csinv~reg8~reg8~xzr": 1352, "lsr~reg4~reg4~reg4": 1353, "and~reg4~reg4~reg4": 1354, "neg~reg4~reg4": 1355, "xchg~ptr8~reg8": 1356, "str~reg4~ptr~imm": 1357, "cset~reg8~eq": 1358, "rev~reg4~reg4": 1359, "tst~reg4~imm": 1360, "strh~reg4~ptr": 1361, "repe cmpsb~ptr1~ptr1": 1362, "sbb~reg1~imm": 1363, "ccmp~reg8~ne~imm": 1364, "ccmp~reg4~ne~imm": 1365, "asr~reg4~reg4~imm": 1366, "subs~reg8~reg8~reg8": 1367, "cset~reg4~ne": 1368, "sub~sp~reg8~imm": 1369, "add~sp~sp~imm": 1370, "mvn~reg8~reg8": 1371, "adds~reg8~reg8~reg8": 1372, "b.ls~imm": 1373, "bfxil~reg8~reg8~imm": 1374, "mul~reg4~reg4~reg4": 1375, "udiv~reg8~reg8~reg8": 1376, "msub~reg8~reg8~reg8": 1377, "ccmp~reg8~eq~imm": 1378, "ccmp~reg4~reg4~ne": 1379, "fmul~ptr4": 1380, "orr~reg8~reg8~imm": 1381, "fmov~d0~reg8": 1382, "fmov~ptr~reg8": 1383, "fmov~reg8~d0": 1384, "movz~reg8~lsl #48~imm": 1385, "fmov~d0~imm": 1386, "fmul~d0~d1~d0": 1387, "str~d0~ptr": 1388, "movn~reg8~lsl #48~imm": 1389, "lsr~reg8~reg8~reg8": 1390, "tst~reg8~reg8": 1391, "str~d1~ptr": 1392, "bic~reg8~reg8~reg8": 1393, "fmov~d2~reg8": 1394, "fsub~d0~d0~d2": 1395, "andpd~reg16~ptr2": 1396, "orpd~reg16~ptr2": 1397, "ldr~d1~ptr": 1398, "bsl~v0.8b~v2.8b~v1.8b": 1399, "fmul~d0~d0~d1": 1400, "orr~reg8~reg8~reg8": 1401, "fmul~d2~d2~d0": 1402, "fmov~reg8~d2": 1403, "ubfx~reg8~reg8~imm": 1404, "fmov~reg4~s0": 1405, "lsr~reg4~reg4~imm": 1406, "mulss~reg16~ptr4": 1407, "fmov~s0~imm": 1408, "fmul~s0~s1~s0": 1409, "str~s0~ptr": 1410, "movn~reg4~lsl #16~imm": 1411, "movd~reg16~reg4": 1412, "fmov~s0~reg4": 1413, "str~s1~ptr": 1414, "subss~reg16~reg16": 1415, "movaps~reg16~reg16": 1416, "bic~reg4~reg4~reg4": 1417, "fmov~s2~reg4": 1418, "fsub~s0~s0~s2": 1419, "andps~reg16~ptr2": 1420, "orps~reg16~ptr2": 1421, "movi~v0.2s~lsl #24~imm": 1422, "fmov~s1~reg4": 1423, "fmul~s0~s0~s1": 1424, "fmul~s2~s2~s0": 1425, "fmov~reg4~s2": 1426, "btr~reg8~imm": 1427, "str~q0~ptr": 1428, "neg~reg8~reg8": 1429, "pand~reg16~ptr2": 1430, "por~reg16~reg16": 1431, "str~q1~ptr": 1432, "ldr~q0~ptr": 1433, "asr~reg8~reg8~reg8": 1434, "and~reg8~reg8~reg8": 1435, "ldr~q1~ptr": 1436, "fmov~reg8~ptr": 1437, "br~reg8": 1438, "str~xzr~ptr~imm": 1439, "ccmn~reg8~ls~imm": 1440, "ands~reg4~reg4~imm": 1441, "lsl~reg8~reg8~reg8": 1442, "orr~reg8~xzr~imm": 1443, "ccmp~reg8~ls~imm": 1444, "rol~reg8~reg1": 1445, "test~ptr8~reg8": 1446, "syscall": 1447, "svc~imm": 1448, "cmn~reg8~lsl #12~imm": 1449, "madd~reg8~reg8~reg8": 1450, "stp~reg8~xzr~ptr": 1451, "ldr~reg4~ptr~imm": 1452, "movsq~ptr8~ptr8": 1453, "asr~reg8~reg8~imm": 1454, "dmb~ish": 1455, "sdiv~reg4~reg4~reg4": 1456, "bfi~reg8~reg8~imm": 1457, "sdiv~reg8~reg8~reg8": 1458, "csinv~reg4~reg4~wzr": 1459, "smull~reg8~reg4~reg4": 1460, "madd~reg4~reg4~reg4": 1461, "cmovns~reg4~reg4": 1462, "subs~reg4~reg4~imm": 1463, "b.pl": 1464, "ldr~d0~ptr": 1465, "fmov~d1~reg8": 1466, "fsub~d0~d1~d0": 1467, "ldursw~reg8~ptr": 1468, "movk~reg8~lsl #16~imm": 1469, "movk~reg8~lsl #32~imm": 1470, "ldrsw~reg8~ptr": 1471, "add~reg8~reg8~lsl #12": 1472, "csinc~reg8~reg8~reg8": 1473, "lsl~reg4~reg4~reg4": 1474, "mvn~reg4~reg4": 1475, "seta~ptr1": 1476, "cset~reg4~mi": 1477, "xorpd~reg16~ptr2": 1478, "fneg~d0~d0": 1479, "sbb~reg4~imm": 1480, "cinc~reg4~reg4~ne": 1481, "stp~reg4~wzr~ptr": 1482, "cmovne~reg8~ptr8": 1483, "movi~v1.2d~imm": 1484, "str~q2~ptr": 1485, "ccmp~reg4~eq~imm": 1486, "csinc~reg8~xzr~reg8": 1487, "cinc~reg8~reg8~eq": 1488, "ccmp~reg8~reg8~ne": 1489, "sbb~reg4~reg4": 1490, "cneg~reg4~reg4~hi": 1491, "b.mi": 1492, "cinc~reg8~reg8~hs": 1493, "sbb~reg8~imm": 1494, "sbc~reg8~reg8~xzr": 1495, "sbc~reg8~reg8~reg8": 1496, "bts~reg8~imm": 1497, "bsr~reg8~reg8": 1498, "clz~reg8~reg8": 1499, "pextrw~reg4~reg16~imm": 1500, "test~reg2~imm": 1501, "movsb~ptr1~ptr1": 1502, "eor~reg8~reg8~imm": 1503, "ubfx~reg4~reg4~imm": 1504, "cneg~reg4~reg4~lt": 1505, "adds~reg4~reg4~reg4": 1506, "negs~reg4~reg4": 1507, "csneg~reg4~reg4~reg4": 1508, "tzcnt~reg8~reg8": 1509, "rbit~reg8~reg8": 1510, "eor~reg4~reg4~imm": 1511, "and~reg1~reg1": 1512, "neg~reg8~reg8~lsl #2": 1513, "cmp~reg4~reg4~lsl #1": 1514, "neg~reg8~reg8~asr #2": 1515, "subs~reg4~reg4~reg4": 1516, "sub~reg8~reg8~reg4": 1517, "tzcnt~reg8~ptr8": 1518, "cmp~reg8~reg4~sxtw": 1519, "movk~reg8~imm": 1520, "fmov~reg8~d8": 1521, "ldr~d8~ptr": 1522, "or~ptr2~reg2": 1523, "bfi~reg4~reg4~imm": 1524, "ubfiz~reg4~reg4~imm": 1525, "sub~sp~sp~reg8": 1526, "add~sp~sp~reg8": 1527, "csetm~reg4~eq": 1528, "csetm~reg4~ne": 1529, "cmp~reg4~reg4~uxtb": 1530, "cmove~reg8~ptr8": 1531, "test~ptr4~imm": 1532, "stur~wzr~ptr": 1533, "sub~reg8~reg8~lsl #12": 1534, "rep movsb~ptr1~ptr1": 1535, "sturb~wzr~ptr": 1536, "ccmp~reg4~reg4~eq": 1537, "csinv~reg8~reg8~reg8": 1538, "or~reg1~reg1": 1539, "ccmp~reg4~ls~imm": 1540, "bics~wzr~reg4~reg4": 1541, "cmovae~reg8~reg8": 1542, "cinc~reg8~reg8~ne": 1543, "cmp~reg8~reg8~asr #2": 1544, "ccmn~reg4~ne~imm": 1545, "cset~reg4~gt": 1546, "mneg~reg8~reg8~reg8": 1547, "cmp~reg8~reg8~lsr #1": 1548, "cmovg~reg8~reg8": 1549, "adds~reg8~reg8~imm": 1550, "csneg~reg8~reg8~reg8": 1551, "cmp~reg8~reg8~lsl #1": 1552, "cmp~xzr~reg8~asr #5": 1553, "ccmp~reg4~ge~imm": 1554, "eor~reg4~reg4~reg4": 1555, "movz~reg8~lsl #16~imm": 1556, "lock xadd~ptr8~reg8": 1557, "ldaxr~reg8~ptr": 1558, "stxr~reg4~xzr~ptr": 1559, "ands~reg8~reg8~imm": 1560, "ands~reg8~reg8~reg8": 1561, "cmp~reg4~reg4~lsr #4": 1562, "ccmp~reg8~reg8~eq": 1563, "setne~ptr1": 1564, "ccmp~reg8~reg8~hi": 1565, "ccmp~reg8~hi~imm": 1566, "csel~reg8~xzr~reg8": 1567, "not~ptr1": 1568, "cmovge~reg8~ptr8": 1569, "cmp~xzr~reg8~lsr #32": 1570, "jo": 1571, "cset~reg4~lo": 1572, "cset~reg4~ls": 1573, "cinc~reg4~reg4~eq": 1574, "cmovb~reg8~ptr8": 1575, "xor~ptr1~imm": 1576, "ccmp~reg4~reg4~hs": 1577, "pmovmskb~reg4~reg16": 1578, "bsr~reg4~reg4": 1579, "pcmpeqb~reg16~reg16": 1580, "ccmn~reg4~ls~imm": 1581, "adds~reg4~reg4~imm": 1582, "cset~reg4~vs": 1583, "cmp~xzr~reg8~asr #2": 1584, "add~reg4~reg4~lsl #12": 1585, "cneg~reg4~reg4~ls": 1586, "csetm~reg4~lo": 1587, "movk~reg8~lsl #48~imm": 1588, "smulh~reg8~reg8~reg8": 1589, "imul~reg8~ptr8~imm": 1590, "mov~v1.16b~v0.16b": 1591, "ldr~q2~ptr": 1592, "mov~v0.16b~v2.16b": 1593, "ror~reg8~reg8~imm": 1594, "cset~reg8~le": 1595, "b.vs": 1596, "smaddl~reg8~reg4~reg4": 1597, "ldpsw~reg8~reg8~ptr": 1598, "cneg~reg4~reg4~eq": 1599, "strh~wzr~ptr": 1600, "ccmp~reg8~reg8~ls": 1601, "cset~reg4~ge": 1602, "cset~reg4~lt": 1603, "test~ptr4~reg4": 1604, "cmp~reg8~reg8~lsr #20": 1605, "tbz~reg8": 1606, "cset~reg4~le": 1607, "cmove~reg4~ptr4": 1608, "cneg~reg8~reg8~eq": 1609, "cmn~reg4~lsl #12~imm": 1610, "csneg~reg4~wzr~reg4": 1611, "umaddl~reg8~reg4~reg4": 1612, "cmovg~reg8~ptr8": 1613, "cmovg~reg4~ptr4": 1614, "ccmn~reg8~ne~imm": 1615, "cinc~reg8~reg8~lo": 1616, "sub~reg4~reg4~lsl #12": 1617, "cneg~reg8~reg8~ne": 1618, "cset~reg4~hi": 1619, "ccmn~reg4~hi~imm": 1620, "sbfx~reg8~reg8~imm": 1621, "and~ptr2~reg2": 1622, "cmovb~reg4~reg4": 1623, "orr~reg4~wzr~imm": 1624, "bt~reg8~reg8": 1625, "bfxil~reg4~reg4~imm": 1626, "sub~sp~sp~lsl #12": 1627, "ccmp~reg4~gt~imm": 1628, "ccmp~reg4~reg4~pl": 1629, "test~ptr8~imm": 1630, "sturh~wzr~ptr": 1631, "cmp~reg8~reg4~uxtb": 1632, "movz~reg8~lsl #32~imm": 1633, "csel~reg4~wzr~reg4": 1634, "ccmp~reg4~reg4~ge": 1635, "stp~wzr~reg4~ptr": 1636, "ccmp~reg4~le~imm": 1637, "ccmp~reg4~reg4~gt": 1638, "ccmn~reg4~eq~imm": 1639, "sete~ptr1": 1640, "stp~wzr~wzr~ptr": 1641, "ldrsh~reg4~ptr": 1642, "sxth~reg4~reg4": 1643, "xor~reg1~reg1": 1644, "sbc~reg4~reg4~wzr": 1645, "or~ptr2~imm": 1646, "cmn~reg8~reg8": 1647, "ccmp~reg8~ge~imm": 1648, "ldar~reg8~ptr": 1649, "strh~reg4~ptr~imm": 1650, "cmpltsd~reg16~reg16": 1651, "andpd~reg16~reg16": 1652, "andnpd~reg16~reg16": 1653, "orpd~reg16~reg16": 1654, "fcmpe~d0~imm": 1655, "fneg~d2~d0": 1656, "fcsel~d2~d2~d0": 1657, "fcmpe~d2~d1": 1658, "fld~st(1)": 1659, "fabs": 1660, "fxch~st(1)": 1661, "fcomi~st(2)": 1662, "fcmovbe~st(0)~st(2)": 1663, "fcomi~st(1)": 1664, "cinc~reg4~reg4~lo": 1665, "add~ptr2~imm": 1666, "cmp~wzr~reg4~asr #24": 1667, "cmp~reg8~reg4~sxtw #2": 1668, "rev16~reg4~reg4": 1669, "add~reg8~sp~reg8": 1670, "cmp~wzr~reg4~lsr #2": 1671, "cmovne~reg4~ptr4": 1672, "stlr~reg4~ptr": 1673, "ccmp~reg8~reg8~lo": 1674, "ccmp~reg8~reg8~hs": 1675, "add~reg2~imm": 1676, "jmp~ptr8": 1677, "ccmp~reg8~reg8~ge": 1678, "xchg~ptr4~reg4": 1679, "sxtb~reg4~reg4": 1680, "ldar~reg4~ptr": 1681, "fcvtzs~reg8~d0": 1682, "scvtf~d0~reg8": 1683, "fcmpe~d1~d0": 1684, "fcmp~d0~imm": 1685, "fcmpe~d0~d1": 1686, "fdiv~d0~d1~d0": 1687, "fmov~d2~d0": 1688, "ucvtf~d0~reg8": 1689, "fmul~d0~d2~d0": 1690, "adr~reg8~imm": 1691, "adc~reg8~reg8~reg8": 1692, "rbit~reg4~reg4": 1693, "clz~reg4~reg4": 1694, "fcvtzs~reg4~d0": 1695, "scvtf~d0~reg4": 1696, "fcvtzu~reg4~d0": 1697, "cneg~reg8~reg8~lt": 1698, "movi~d1~imm": 1699, "fadd~d0~d0~d1": 1700, "fcvtzu~reg8~d0": 1701, "rev~reg8~reg8": 1702, "ror~reg4~reg4~reg4": 1703, "ror~reg8~reg8~reg8": 1704, "cset~reg4~hs": 1705}