{
    "": 0,
    "push~reg8": 1,
    "mov~reg8~reg8": 2,
    "lea~reg8~ptr": 3,
    "pop~reg8": 4,
    "ret": 5,
    "sub~reg8~imm": 6,
    "mov~reg8~ptr8": 7,
    "mov~ptr8~reg8": 8,
    "xor~reg4~reg4": 9,
    "call": 10,
    "mov~reg4~imm": 11,
    "mov~ptr4~reg4": 12,
    "cmp~ptr4~imm": 13,
    "jne": 14,
    "printf": 15,
    "mov~reg4~ptr4": 16,
    "cmp~reg4~imm": 17,
    "jmp": 18,
    "puts": 19,
    "nop": 20,
    "leave": 21,
    "add~reg8~imm": 22,
    "mov~ptr4~imm": 23,
    "mov~reg4~reg4": 24,
    "exit": 25,
    "test~reg8~reg8": 26,
    "je": 27,
    "mov~ptr8~imm": 28,
    "__getreent": 29,
    "fprintf": 30,
    "sub~reg8~ptr8": 31,
    "strlen": 32,
    "cmp~ptr8~imm": 33,
    "__main": 34,
    "test~reg4~reg4": 35,
    "strcmp": 36,
    "movzx~reg4~ptr1": 37,
    "movzx~reg4~reg1": 38,
    "call~reg8": 39,
    "add~reg4~imm": 40,
    "lea~reg4~ptr": 41,
    "add~ptr8~imm": 42,
    "memset": 43,
    "mov~ptr2~reg2": 44,
    "test~reg1~reg1": 45,
    "add~reg8~reg8": 46,
    "cmp~reg1~imm": 47,
    "ja": 48,
    "mov~ptr1~imm": 49,
    "movzx~reg4~ptr2": 50,
    "movzx~reg4~reg2": 51,
    "test~reg2~reg2": 52,
    "shr~reg4~imm": 53,
    "xor~ptr4~reg4": 54,
    "xor~reg4~ptr4": 55,
    "cdqe": 56,
    "cmp~reg2~reg2": 57,
    "cmp~ptr2~reg2": 58,
    "sub~reg8~reg8": 59,
    "sub~reg4~imm": 60,
    "add~ptr4~imm": 61,
    "movsxd~reg8~reg4": 62,
    "memcmp": 63,
    "setne~reg1": 64,
    "and~reg4~imm": 65,
    "__locale_ctype_ptr": 66,
    "movsx~reg4~reg1": 67,
    "mov~ptr1~reg1": 68,
    "tolower": 69,
    "strchr": 70,
    "strcasecmp": 71,
    "cmp~reg8~ptr8": 72,
    "strncmp": 73,
    "shl~reg8~imm": 74,
    "cmp~reg4~reg4": 75,
    "cmp~reg1~reg1": 76,
    "jbe": 77,
    "cmp~ptr1~imm": 78,
    "jb": 79,
    "not~reg8": 80,
    "sub~reg4~reg4": 81,
    "cmp~reg8~reg8": 82,
    "add~ptr8~reg8": 83,
    "cmp~reg8~imm": 84,
    "memcpy": 85,
    "push~imm": 86,
    "push~ptr8": 87,
    "sub~ptr8~imm": 88,
    "jg": 89,
    "strrchr": 90,
    "movsx~reg4~ptr1": 91,
    "cmp~ptr1~reg1": 92,
    "cmp~ptr8~reg8": 93,
    "sub~ptr8~reg8": 94,
    "memmove": 95,
    "jae": 96,
    "sete~reg1": 97,
    "sub~ptr4~imm": 98,
    "sub~reg4~ptr4": 99,
    "js": 100,
    "jle": 101,
    "add~reg4~reg4": 102,
    "shr~reg1~imm": 103,
    "toupper": 104,
    "getpid": 105,
    "__errno": 106,
    "jns": 107,
    "imul~reg8~reg8~imm": 108,
    "imul~reg8~reg8": 109,
    "mov~ptr2~imm": 110,
    "movabs~reg8~imm": 111,
    "and~reg8~imm": 112,
    "cmp~reg4~ptr4": 113,
    "write": 114,
    "sub~ptr4~reg4": 115,
    "abort": 116,
    "malloc": 117,
    "calloc": 118,
    "realloc": 119,
    "imul~reg4~reg4~imm": 120,
    "cdq": 121,
    "idiv~ptr4": 122,
    "movss~reg16~ptr4": 123,
    "movss~ptr4~reg16": 124,
    "getloadavg": 125,
    "movsd~reg16~ptr8": 126,
    "cvtsd2ss~reg16~reg16": 127,
    "not~reg4": 128,
    "cwde": 129,
    "movsx~reg4~reg2": 130,
    "qsort": 131,
    "atoi": 132,
    "getpwnam": 133,
    "getgrnam": 134,
    "strtol": 135,
    "shl~reg4~imm": 136,
    "cmp~ptr4~reg4": 137,
    "jl": 138,
    "jge": 139,
    "sar~reg4~imm": 140,
    "or~ptr4~reg4": 141,
    "pcre_compile2": 142,
    "pcre_fullinfo": 143,
    "pcre_exec": 144,
    "free": 145,
    "imul~reg4~ptr4": 146,
    "times": 147,
    "strpbrk": 148,
    "shl~ptr8~imm": 149,
    "add~ptr4~reg4": 150,
    "or~reg4~reg4": 151,
    "and~reg4~reg4": 152,
    "and~reg8~reg8": 153,
    "or~reg8~reg8": 154,
    "sar~reg1~imm": 155,
    "getenv": 156,
    "or~reg4~imm": 157,
    "or~reg1~ptr1": 158,
    "or~reg1~imm": 159,
    "mov~reg8~imm": 160,
    "or~reg8~ptr8": 161,
    "shl~reg8~reg1": 162,
    "or~ptr8~reg8": 163,
    "and~reg8~ptr8": 164,
    "and~ptr4~reg4": 165,
    "strstr": 166,
    "atol": 167,
    "or~ptr4~imm": 168,
    "strcpy": 169,
    "jmp~reg8": 170,
    "setle~reg1": 171,
    "setg~reg1": 172,
    "xor~ptr4~imm": 173,
    "sar~reg8~imm": 174,
    "shr~reg8~imm": 175,
    "sar~reg8~reg1": 176,
    "putchar": 177,
    "openlog": 178,
    "strncasecmp": 179,
    "cmp~ptr4": 180,
    "xor~reg8~ptr8": 181,
    "sar~ptr4~imm": 182,
    "cmovg~reg4~reg4": 183,
    "syslog": 184,
    "strcat": 185,
    "shr~reg2~imm": 186,
    "strncpy": 187,
    "imul~reg8": 188,
    "cmp~reg2~ptr2": 189,
    "idiv~reg4": 190,
    "sysconf": 191,
    "cmp~reg2~imm": 192,
    "kill": 193,
    "getpgid": 194,
    "getpgrp": 195,
    "read": 196,
    "sigemptyset": 197,
    "sigaction": 198,
    "neg~ptr4": 199,
    "neg~reg8": 200,
    "sscanf": 201,
    "strspn": 202,
    "shr~reg8~reg1": 203,
    "cmp~ptr2~imm": 204,
    "or~ptr8~imm": 205,
    "getrlimit": 206,
    "geteuid": 207,
    "rep stosq~ptr8~reg8": 208,
    "semctl": 209,
    "chown": 210
}