{"": 0, "push~reg8": 1, "mov~reg8~reg8": 2, "sub~reg8~imm": 3, "mov~ptr8~reg8": 4, "mov~reg8~ptr8": 5, "lea~reg8~ptr": 6, "mov~reg4~ptr4": 7, "call": 8, "add~reg8~imm": 9, "nop": 10, "leave": 11, "ret": 12, "stp~reg8~reg8~ptr": 13, "mov~reg8~sp": 14, "str~reg8~ptr": 15, "str~reg4~ptr": 16, "adrp~reg8~imm": 17, "ldr~reg8~ptr": 18, "ldr~reg4~ptr": 19, "bl": 20, "ldp~reg8~reg8~ptr": 21, "mov~ptr4~reg4": 22, "cmp~ptr8~imm": 23, "je": 24, "cmp~reg8~imm": 25, "b.eq": 26, "cmp~ptr4~imm": 27, "jne": 28, "cmp~reg4~imm": 29, "b.ne": 30, "jmp": 31, "b": 32, "xor~reg4~reg4": 33, "shr~reg8~imm": 34, "movz~reg8~imm": 35, "lsr~reg8~reg8~imm": 36, "cmp~reg8~ptr8": 37, "cmp~reg8~reg8": 38, "add~reg8~reg8~imm": 39, "mov~ptr8~imm": 40, "str~xzr~ptr": 41, "jbe": 42, "b.ls": 43, "xor~reg8~reg8": 44, "add~ptr8~imm": 45, "eor~reg8~reg8~reg8": 46, "sub~ptr8~imm": 47, "sub~reg8~reg8~imm": 48, "lsl~reg8~reg8~imm": 49, "add~ptr8~reg8": 50, "add~reg8~reg8~reg8": 51, "ja": 52, "b.hi": 53, "add~reg8~reg8": 54, "movzx~reg4~ptr1": 55, "mov~reg4~reg4": 56, "mov~ptr1~reg1": 57, "ldrb~reg4~ptr": 58, "eor~reg4~reg4~reg4": 59, "and~reg4~reg4~imm": 60, "strb~reg4~ptr": 61, "movzx~reg4~reg1": 62, "shl~reg4~imm": 63, "shr~reg4~imm": 64, "cdqe": 65, "and~reg4~imm": 66, "or~reg4~reg4": 67, "rol~reg4~imm": 68, "lsl~reg4~reg4~imm": 69, "lsr~reg4~reg4~imm": 70, "sxtw~reg8~reg4": 71, "orr~reg4~reg4~reg4": 72, "ror~reg4~reg4~imm": 73, "sub~ptr4~imm": 74, "sub~reg4~reg4~imm": 75, "pop~reg8": 76, "add~reg4~imm": 77, "lea~reg4~ptr": 78, "test~reg4~reg4": 79, "cmovs~reg4~reg4": 80, "sar~reg4~imm": 81, "add~reg4~reg4~imm": 82, "csel~reg4~reg4~reg4": 83, "asr~reg4~reg4~imm": 84, "mov~reg4~imm": 85, "movn~reg4~imm": 86, "shl~reg8~imm": 87, "jle": 88, "b.le": 89, "mov~ptr4~imm": 90, "str~wzr~ptr": 91, "add~reg4~reg4": 92, "jb": 93, "b.lo": 94, "ror~reg4~imm": 95, "movz~reg4~imm": 96, "test~reg8~reg8": 97, "and~reg8~reg8~imm": 98, "movsxd~reg8~reg4": 99, "test~reg1~reg1": 100, "ldrsw~reg8~ptr": 101, "shl~reg4~reg1": 102, "and~reg4~reg4": 103, "sxtb~reg4~reg4": 104, "lsl~reg4~reg4~reg4": 105, "and~reg4~reg4~reg4": 106, "jg": 107, "b.gt": 108, "orr~reg8~xzr~imm": 109, "adrp~reg8": 110, "and~reg8~imm": 111, "or~reg4~imm": 112, "or~reg8~reg8": 113, "orr~reg4~reg4~imm": 114, "orr~reg8~reg8~reg8": 115, "cmp~ptr8~reg8": 116, "not~reg4": 117, "mvn~reg4~reg4": 118, "cmp~reg4~reg4": 119, "jl": 120, "b.lt": 121, "sub~reg4~reg4": 122, "sub~reg4~reg4~reg4": 123, "sub~sp~sp~imm": 124, "and~reg4~ptr4": 125, "setne~reg1": 126, "cset~reg4~ne": 127, "add~sp~sp~imm": 128, "js": 129, "call~reg8": 130, "blr~reg8": 131, "xor~reg8~ptr8": 132, "sub~ptr8~reg8": 133, "sub~reg8~reg8~reg8": 134, "sub~reg8~ptr8": 135, "jns": 136, "b.ge": 137, "sub~reg8~reg8": 138, "cmn~reg4~imm": 139, "add~ptr4~imm": 140, "cmovbe~reg8~ptr8": 141, "csel~reg8~reg8~reg8": 142, "push~imm": 143, "cmp~reg1~imm": 144, "cmp~reg4~ptr4": 145, "add~ptr4~reg4": 146, "sub~ptr4~reg4": 147, "add~reg4~reg4~reg4": 148, "cmp~ptr4~reg4": 149, "neg~reg4": 150, "neg~reg4~reg4": 151, "xor~reg1~ptr1": 152, "shr~ptr4~imm": 153, "mov~ptr1~imm": 154, "strb~wzr~ptr": 155, "or~ptr4~reg4": 156, "shl~ptr8~imm": 157, "or~ptr8~reg8": 158, "shr~ptr8~imm": 159, "neg~reg8": 160, "neg~reg8~reg8": 161, "movabs~reg8~imm": 162, "movz~reg8~lsl #48~imm": 163, "or~reg1~imm": 164, "and~reg1~imm": 165, "mov~reg8~imm": 166, "movn~reg8~imm": 167, "movn~reg4~lsl #16~imm": 168, "cmp~ptr1~imm": 169, "movsx~reg4~reg1": 170, "sub~reg4~imm": 171, "imul~reg4": 172, "smull~reg8~reg4~reg4": 173, "cmn~reg8~imm": 174, "jge": 175, "or~reg8~imm": 176, "orr~reg8~reg8~imm": 177, "push~ptr8": 178, "add~reg8~sp~imm": 179, "mov~ptr2~reg2": 180, "strh~reg4~ptr": 181, "movzx~reg4~ptr2": 182, "ldrh~reg4~ptr": 183, "and~reg2~ptr2": 184, "mov~ptr2~imm": 185, "or~reg2~ptr2": 186, "movzx~reg4~reg2": 187, "shr~reg1~imm": 188, "and~reg2~imm": 189, "ldrsb~reg4~ptr": 190, "sub~reg4~ptr4": 191, "cmp~reg4~lsl #12~imm": 192, "or~reg8~ptr8": 193, "or~ptr4~imm": 194, "and~reg8~reg8~reg8": 195, "and~ptr8~reg8": 196, "imul~reg4~reg4~imm": 197, "mul~reg4~reg4~reg4": 198, "movsx~reg4~ptr1": 199, "cmp~ptr1~reg1": 200, "setg~reg1": 201, "cset~reg4~gt": 202, "rep stosq~ptr8~reg8": 203, "rep movsq~ptr8~ptr8": 204, "or~reg4~ptr4": 205, "sar~ptr4~imm": 206, "sub~sp~sp~reg8": 207, "setle~reg1": 208, "cset~reg4~le": 209, "sete~reg1": 210, "cset~reg4~eq": 211, "ubfiz~reg4~reg4~imm": 212, "mul~reg8": 213, "umulh~reg8~reg8~reg8": 214, "and~reg8~reg8": 215, "and~ptr1~imm": 216, "and~ptr4~imm": 217, "cmovle~reg4~reg4": 218, "mfence": 219, "stlr~reg4~ptr": 220, "movz~reg8~lsl #16~imm": 221, "not~reg8": 222, "mvn~reg8~reg8": 223, "shl~ptr4~imm": 224, "xor~reg4~ptr4": 225, "strh~wzr~ptr": 226, "cmp~reg2~imm": 227, "stp~xzr~xzr~ptr": 228, "cmovle~reg4~ptr4": 229, "cdq": 230, "idiv~ptr4": 231, "imul~reg4~ptr4": 232, "sdiv~reg4~reg4~reg4": 233, "jae": 234, "b.hs": 235, "ldar~reg4~ptr": 236, "imul~reg8~reg8~imm": 237, "movsd~reg16~ptr8": 238, "ldr~d0~ptr": 239, "setb~reg1": 240, "cset~reg4~lo": 241, "neg~ptr4": 242, "div~reg8": 243, "udiv~reg8~reg8~reg8": 244, "mul~reg8~reg8~reg8": 245, "cmovge~reg4~ptr4": 246, "movsd~ptr8~reg16": 247, "pxor~reg16~reg16": 248, "ucomisd~reg16~ptr8": 249, "str~d0~ptr": 250, "fcmpe~d0~imm": 251, "b.pl": 252, "movq~reg16~ptr8": 253, "xorpd~reg16~reg16": 254, "fneg~d0~d0": 255, "fmov~d0~imm": 256, "mulsd~reg16~reg16": 257, "ldr~d1~ptr": 258, "fmul~d0~d1~d0": 259, "cvttsd2si~reg8~reg16": 260, "cvtsi2sd~reg16~ptr8": 261, "subsd~reg16~reg16": 262, "movapd~reg16~reg16": 263, "fcvtzs~reg8~d0": 264, "scvtf~d0~reg8": 265, "fsub~d0~d1~d0": 266, "fcmpe~d1~d0": 267, "jp": 268, "fcmp~d0~imm": 269, "movq~reg8~reg16": 270, "fmov~d1~reg8": 271, "fcmpe~d0~d1": 272, "divsd~reg16~reg16": 273, "fdiv~d0~d1~d0": 274, "fmov~d2~d0": 275, "ucvtf~d0~reg8": 276, "fmul~d0~d2~d0": 277, "setbe~reg1": 278, "cset~reg4~ls": 279, "repne scasb~reg1~ptr1": 280, "movn~reg8~lsl #48~imm": 281, "jmp~reg8": 282, "adr~reg8~imm": 283, "add~reg8~reg8~reg4": 284, "br~reg8": 285, "sar~reg8~imm": 286, "and~reg8~ptr8": 287, "asr~reg8~reg8~imm": 288, "shr~reg8~reg1": 289, "lsr~reg8~reg8~reg8": 290, "negs~reg4~reg4": 291, "csneg~reg4~reg4~reg4": 292, "shl~reg8~reg1": 293, "lsl~reg8~reg8~reg8": 294, "ldur~reg8~ptr": 295, "neg~ptr8": 296, "shl~ptr4~reg1": 297, "shr~ptr8~reg1": 298, "sar~reg4~reg1": 299, "and~ptr4~reg4": 300, "asr~reg4~reg4~reg4": 301, "imul~reg8~reg8": 302, "imul~reg8~ptr8": 303, "div~ptr8": 304, "cmovge~reg4~reg4": 305, "xor~ptr8~reg8": 306, "imul~reg4~reg4": 307, "seta~reg1": 308, "cset~reg4~hi": 309, "sar~ptr8~imm": 310, "movz~reg8~lsl #32~imm": 311, "shl~ptr8~reg1": 312, "shr~reg4~reg1": 313, "xor~ptr4~reg4": 314, "lsr~reg4~reg4~reg4": 315, "cmp~reg8~lsl #12~imm": 316, "test~reg2~reg2": 317, "imul~reg8": 318, "smulh~reg8~reg8~reg8": 319, "movsxd~reg8~ptr4": 320, "shl~ptr1~imm": 321, "and~reg1~ptr1": 322, "shr~ptr1~imm": 323, "xor~ptr1~reg1": 324, "and~ptr1~reg1": 325, "movz~reg4~lsl #16~imm": 326, "mov~reg2~imm": 327, "madd~reg8~reg8~reg8": 328, "adc~ptr8~reg8": 329, "adds~reg8~reg8~reg8": 330, "adc~reg8~reg8~reg8": 331, "sbb~ptr8~reg8": 332, "shrd~reg8~reg8~imm": 333, "subs~reg8~reg8~reg8": 334, "sbc~reg8~reg8~reg8": 335, "adc~reg8~reg8": 336, "div~reg4": 337, "udiv~reg4~reg4~reg4": 338, "div~ptr4": 339, "tzcnt~reg4~reg4": 340, "rbit~reg4~reg4": 341, "clz~reg4~reg4": 342, "cmp~reg1~reg1": 343, "sbb~reg8~reg8": 344, "add~reg8~ptr8": 345, "adc~reg8~ptr8": 346, "sar~ptr1~imm": 347, "sar~reg1~imm": 348, "add~reg8~reg8~lsl #12": 349, "orr~reg4~wzr~imm": 350, "not~ptr8": 351, "ubfx~reg8~reg8~imm": 352, "bfxil~reg4~reg4~imm": 353, "bfi~reg4~reg4~imm": 354, "ldur~reg4~ptr": 355, "stur~reg4~ptr": 356, "add~ptr1~imm": 357, "cmp~ptr2~imm": 358, "sxth~reg4~reg4": 359, "sub~ptr2~imm": 360, "shr~reg2~imm": 361, "sub~ptr2~reg2": 362, "xor~reg4~imm": 363, "cmovns~reg4~ptr4": 364, "cmovns~reg8~ptr8": 365, "cqo": 366, "idiv~ptr8": 367, "sdiv~reg8~reg8~reg8": 368, "ldar~reg8~ptr": 369, "lock add~ptr8~imm": 370, "movsx~reg8~reg1": 371, "xor~ptr8~imm": 372, "eor~reg8~reg8~imm": 373, "cmovae~reg8~ptr8": 374, "cmovs~reg8~reg8": 375, "or~ptr8~imm": 376, "cvttsd2si~reg4~reg16": 377, "fcvtzs~reg4~d0": 378, "cvtsi2sd~reg16~reg4": 379, "scvtf~d0~reg4": 380, "ucomisd~reg16~reg16": 381, "fcvtzu~reg4~d0": 382, "b.mi": 383, "cneg~reg8~reg8~lt": 384, "cvtsi2sd~reg16~reg8": 385, "addsd~reg16~reg16": 386, "movi~d1~imm": 387, "fadd~d0~d0~d1": 388, "fcvtzu~reg8~d0": 389, "or~reg1~ptr1": 390, "eor~reg4~reg4~imm": 391, "lock xadd~ptr4~reg4": 392, "bswap~reg4": 393, "rev~reg4~reg4": 394, "bswap~reg8": 395, "rev~reg8~reg8": 396, "and~ptr8~imm": 397, "sub~reg8~reg8~lsl #12": 398, "xor~ptr4~imm": 399, "cvtsi2sd~reg16~ptr4": 400, "cmp~reg2~ptr2": 401, "setl~reg1": 402, "cset~reg4~lt": 403, "xor~reg1~imm": 404, "rol~ptr8~imm": 405, "ror~reg8~reg8~imm": 406, "rol~reg4~reg1": 407, "ror~reg4~reg4~reg4": 408, "cmp~reg1~ptr1": 409, "setge~reg1": 410, "cset~reg4~ge": 411, "cmovg~reg4~reg4": 412, "ror~reg8~reg1": 413, "ror~reg8~reg8~reg8": 414, "ror~reg4~reg1": 415, "add~ptr2~reg2": 416, "shr~ptr2~imm": 417, "setae~reg1": 418, "cset~reg4~hs": 419, "xor~reg8~imm": 420}