{"": 0, "sub~reg8~imm": 1, "mov~reg8~ptr8": 2, "test~reg8~reg8": 3, "je": 4, "call~reg8": 5, "__gmon_start__": 6, "call": 7, "add~reg8~imm": 8, "ret": 9, "push~ptr8": 10, "jmp~ptr8": 11, "chmod": 12, "tcsetattr": 13, "mprotect": 14, "fileno": 15, "pthread_getspecific": 16, "memset": 17, "ftell": 18, "shutdown": 19, "getauxval": 20, "close": 21, "syslog": 22, "ioctl": 23, "shmdt": 24, "abort": 25, "pthread_setspecific": 26, "memchr": 27, "clock_gettime": 28, "gethostbyname": 29, "uname": 30, "_setjmp": 31, "fseek": 32, "__isoc99_sscanf": 33, "select": 34, "openlog": 35, "__assert_fail": 36, "getaddrinfo": 37, "gettimeofday": 38, "makecontext": 39, "setcontext": 40, "__register_atfork": 41, "read": 42, "strncmp": 43, "malloc": 44, "fopen": 45, "_longjmp": 46, "pthread_rwlock_destroy": 47, "__cxa_atexit": 48, "setsockopt": 49, "sysconf": 50, "getpid": 51, "fgets": 52, "vfprintf": 53, "closelog": 54, "fputc": 55, "freeaddrinfo": 56, "free": 57, "secure_getenv": 58, "strlen": 59, "ferror": 60, "opendir": 61, "__xstat": 62, "listen": 63, "__ctype_b_loc": 64, "pthread_key_delete": 65, "readdir": 66, "dlerror": 67, "sprintf": 68, "ntohs": 69, "fdopen": 70, "strrchr": 71, "syscall": 72, "dlclose": 73, "pthread_self": 74, "gmtime_r": 75, "usleep": 76, "strstr": 77, "sigaction_0": 78, "mlock": 79, "strcat": 80, "getsockopt": 81, "fputs": 82, "lseek": 83, "strtol": 84, "getsockname": 85, "atoi": 86, "connect": 87, "tcgetattr": 88, "pthread_rwlock_init": 89, "signal": 90, "strspn": 91, "setbuf": 92, "memmove": 93, "strchr": 94, "socket": 95, "fread": 96, "__fxstat": 97, "getenv": 98, "__errno_location": 99, "pthread_equal": 100, "qsort": 101, "madvise": 102, "strdup": 103, "strncasecmp": 104, "__stack_chk_fail": 105, "getnameinfo": 106, "tolower": 107, "strcpy": 108, "pthread_rwlock_rdlock": 109, "dladdr": 110, "pthread_once": 111, "memcmp": 112, "munmap": 113, "getcontext": 114, "__xpg_strerror_r": 115, "shmget": 116, "feof": 117, "fclose": 118, "dlopen": 119, "pthread_rwlock_wrlock": 120, "recvfrom": 121, "strncpy": 122, "dlsym": 123, "closedir": 124, "strcspn": 125, "clearerr": 126, "fopen64": 127, "sendto": 128, "bind": 129, "fwrite": 130, "pthread_rwlock_unlock": 131, "htonl": 132, "realloc": 133, "perror": 134, "gai_strerror": 135, "pthread_key_create": 136, "fprintf": 137, "write": 138, "accept": 139, "strtoul": 140, "memcpy": 141, "open": 142, "mmap": 143, "time": 144, "shmat": 145, "fflush": 146, "__imp_strcasecmp": 147, "__imp_getentropy": 148, "__imp___cxa_finalize": 149, "__imp_strcmp": 150, "lea~reg8~ptr": 151, "push~reg8": 152, "cmp~reg8~reg8": 153, "mov~reg8~reg8": 154, "pop~reg8": 155, "jmp~reg8": 156, "cmp~ptr1~imm": 157, "jne": 158, "cmp~ptr8~imm": 159, "mov~ptr1~imm": 160, "jmp": 161, "xor~reg4~ptr4": 162, "mov~reg4~ptr4": 163, "sub~reg4~imm": 164, "movzx~reg4~reg1": 165, "shr~reg4~imm": 166, "xor~reg4~reg4": 167, "movzx~reg4~ptr1": 168, "and~reg4~imm": 169, "shl~reg4~imm": 170, "mov~reg4~reg4": 171, "cmp~reg8~ptr8": 172, "mov~reg4~imm": 173, "and~reg4~reg4": 174, "lea~reg4~ptr": 175, "sub~reg4~reg4": 176, "rol~reg4~imm": 177, "ror~reg4~imm": 178, "endbr64": 179, "and~reg8~imm": 180, "sub~reg8~reg8": 181, "neg~reg8": 182, "mov~ptr8~reg8": 183, "mov~ptr4~reg4": 184, "shl~reg8~imm": 185, "or~reg8~reg8": 186, "and~reg8~reg8": 187, "shr~reg8~imm": 188, "xor~reg8~reg8": 189, "add~reg8~reg8": 190, "test~reg8~imm": 191, "cmp~reg4~imm": 192, "mov~reg8~imm": 193, "add~reg4~imm": 194, "jl": 195, "mov~ptr4~imm": 196, "nop": 197, "pushfq": 198, "cld": 199, "cmp~reg8~imm": 200, "cmove~reg8~reg8": 201, "jb": 202, "bt~reg4~imm": 203, "xchg~reg8~reg8": 204, "nop~ptr4": 205, "rep movsq~ptr8~ptr8": 206, "cmp~ptr4~imm": 207, "rep stosq~ptr8~reg8": 208, "rep movsb~ptr1~ptr1": 209, "rep stosb~ptr1~reg1": 210, "popfq": 211, "leave": 212, "mov~ptr8~imm": 213, "add~ptr8~imm": 214, "jbe": 215, "sub~ptr8~imm": 216, "xor~reg8~ptr8": 217, "mov~ptr1~reg1": 218, "ja": 219, "add~ptr8~reg8": 220, "test~reg4~imm": 221, "movdqu~xmm12~ptr2": 222, "cmp~reg4~reg4": 223, "cmovg~reg4~reg4": 224, "test~reg4~reg4": 225, "movdqu~reg16~ptr2": 226, "cmovle~reg8~reg8": 227, "movups~reg16~ptr2": 228, "pxor~reg16~xmm12": 229, "pxor~reg16~reg16": 230, "movdqu~xmm8~ptr2": 231, "movdqu~xmm9~ptr2": 232, "pxor~reg16~xmm8": 233, "pxor~reg16~xmm9": 234, "movdqa~xmm10~ptr2": 235, "aesenc~reg16~reg16": 236, "prefetcht0~ptr1": 237, "cmp~reg4~ptr4": 238, "cmovge~reg8~reg8": 239, "cmovg~reg8~reg8": 240, "movdqa~xmm11~xmm10": 241, "pxor~xmm12~xmm12": 242, "pcmpgtd~xmm11~xmm12": 243, "paddd~xmm10~xmm11": 244, "movdqa~ptr2~xmm10": 245, "aesenclast~reg16~reg16": 246, "pxor~xmm8~xmm12": 247, "pxor~xmm9~xmm12": 248, "movups~ptr2~reg16": 249, "dec~reg4": 250, "vzeroupper": 251, "vmovdqu~xmm15~ptr2": 252, "vmovdqu~reg16~ptr2": 253, "vmovdqu~xmm8~ptr2": 254, "vmovdqu~xmm9~ptr2": 255, "aesdec~reg16~reg16": 256, "pxor~xmm8~reg16": 257, "pxor~xmm9~reg16": 258, "aesdeclast~reg16~reg16": 259, "aesdeclast~reg16~xmm8": 260, "aesdeclast~reg16~xmm9": 261, "vmovdqu~ptr2~reg16": 262, "vmovdqu~ptr2~xmm8": 263, "vmovdqu~ptr2~xmm9": 264, "vmovups~reg16~ptr2": 265, "vpxor~xmm10~xmm15~ptr2": 266, "vpxor~xmm11~xmm15~ptr2": 267, "vpxor~xmm12~xmm15~ptr2": 268, "vpxor~xmm13~xmm15~ptr2": 269, "vpxor~reg16~reg16~xmm10": 270, "vpxor~reg16~reg16~xmm11": 271, "vpxor~reg16~reg16~xmm12": 272, "vpxor~reg16~reg16~xmm13": 273, "vpxor~xmm8~xmm8~xmm12": 274, "vpxor~xmm9~xmm9~xmm13": 275, "vaesenc~reg16~reg16~reg16": 276, "vaesenc~xmm8~xmm8~reg16": 277, "vaesenc~xmm9~xmm9~reg16": 278, "vmovdqu~ptr2~xmm10": 279, "vmovdqu~ptr2~xmm11": 280, "vmovdqu~ptr2~xmm12": 281, "vmovdqu~ptr2~xmm13": 282, "vmovdqu~xmm14~ptr2": 283, "vpxor~xmm15~xmm15~xmm15": 284, "vpcmpgtd~xmm15~xmm14~xmm15": 285, "vpaddd~xmm15~xmm15~xmm14": 286, "vaesenclast~reg16~reg16~reg16": 287, "vmovdqa~ptr2~xmm15": 288, "vpaddd~xmm14~xmm14~xmm15": 289, "vaesenclast~xmm8~xmm8~reg16": 290, "vmovdqa~ptr2~xmm14": 291, "vaesenclast~xmm9~xmm9~reg16": 292, "vmovups~ptr2~reg16": 293, "vpxor~reg16~reg16~ptr2": 294, "sub~reg8~ptr8": 295, "vmovups~ptr2~xmm8": 296, "vmovups~ptr2~xmm9": 297, "vpxor~reg16~reg16~xmm15": 298, "vpxor~xmm8~xmm8~xmm15": 299, "vpxor~xmm9~xmm9~xmm15": 300, "xor~reg8~imm": 301, "vaesdec~reg16~reg16~reg16": 302, "vaesdec~xmm8~xmm8~reg16": 303, "vmovdqu~xmm10~ptr2": 304, "vaesdec~xmm9~xmm9~reg16": 305, "vmovdqu~xmm11~ptr2": 306, "vmovdqu~xmm12~ptr2": 307, "vmovdqu~xmm13~ptr2": 308, "vaesdeclast~reg16~reg16~reg16": 309, "vaesdeclast~xmm8~xmm8~reg16": 310, "vaesdeclast~xmm9~xmm9~reg16": 311, "vpxor~xmm8~xmm8~ptr2": 312, "vpxor~xmm9~xmm9~ptr2": 313, "vpxor~reg16~xmm15~xmm10": 314, "vpxor~reg16~xmm15~xmm11": 315, "vpxor~xmm8~xmm15~xmm12": 316, "vpxor~xmm9~xmm15~xmm13": 317, "bt~reg8~imm": 318, "or~reg4~reg4": 319, "movd~xmm9~ptr4": 320, "movdqa~reg16~ptr2": 321, "movups~xmm15~ptr2": 322, "pshufd~xmm8~xmm8~imm": 323, "pshufd~xmm9~xmm9~imm": 324, "vzeroall": 325, "vmovdqa~reg16~ptr2": 326, "vmovdqa~xmm10~ptr2": 327, "vpshufb~reg16~reg16~reg16": 328, "vpaddd~reg16~reg16~xmm10": 329, "vmovdqa~ptr2~reg16": 330, "vmovups~xmm15~ptr2": 331, "vmovups~xmm14~ptr2": 332, "movdqa~xmm13~ptr2": 333, "pshufb~reg16~reg16": 334, "paddd~reg16~xmm13": 335, "movdqa~ptr2~reg16": 336, "psubd~reg16~xmm13": 337, "movups~xmm14~ptr2": 338, "xorps~xmm14~xmm15": 339, "xorps~reg16~xmm14": 340, "pshufd~xmm8~reg16~imm": 341, "movdqa~xmm12~reg16": 342, "paddd~xmm13~reg16": 343, "add~reg4~ptr4": 344, "punpcklqdq~xmm8~reg16": 345, "add~reg4~reg4": 346, "psrldq~xmm12~imm": 347, "pxor~xmm12~reg16": 348, "movdqa~ptr2~xmm13": 349, "movdqa~reg16~xmm8": 350, "movdqa~xmm12~xmm8": 351, "pslldq~reg16~imm": 352, "paddd~xmm8~xmm8": 353, "psrld~xmm12~imm": 354, "movdqa~xmm13~reg16": 355, "psrld~reg16~imm": 356, "por~xmm8~xmm12": 357, "pslld~xmm13~imm": 358, "pxor~xmm8~xmm13": 359, "pshufd~xmm9~reg16~imm": 360, "movdqa~xmm13~xmm8": 361, "paddd~reg16~xmm8": 362, "punpcklqdq~xmm9~reg16": 363, "psrldq~xmm13~imm": 364, "pxor~xmm13~reg16": 365, "pxor~xmm9~xmm13": 366, "movdqa~xmm12~xmm9": 367, "movdqa~xmm13~xmm9": 368, "pslldq~xmm12~imm": 369, "paddd~xmm9~xmm9": 370, "psrld~xmm13~imm": 371, "movdqa~reg16~xmm12": 372, "por~xmm9~xmm13": 373, "pslld~reg16~imm": 374, "movdqa~xmm12~ptr2": 375, "pshufd~xmm10~reg16~imm": 376, "movdqa~reg16~xmm9": 377, "paddd~xmm12~xmm9": 378, "punpcklqdq~xmm10~reg16": 379, "psrldq~reg16~imm": 380, "pxor~xmm10~reg16": 381, "movdqa~ptr2~xmm12": 382, "movdqa~xmm13~xmm10": 383, "movdqa~reg16~xmm10": 384, "pslldq~xmm13~imm": 385, "paddd~xmm10~xmm10": 386, "movdqa~xmm12~xmm13": 387, "por~xmm10~reg16": 388, "pslld~xmm12~imm": 389, "pxor~xmm10~xmm13": 390, "pxor~xmm10~xmm12": 391, "pshufd~xmm11~reg16~imm": 392, "movdqa~xmm12~xmm10": 393, "paddd~xmm13~xmm10": 394, "punpcklqdq~xmm11~xmm8": 395, "pxor~xmm11~reg16": 396, "pxor~xmm12~xmm9": 397, "pxor~xmm11~xmm12": 398, "movdqa~reg16~xmm11": 399, "movdqa~xmm12~xmm11": 400, "paddd~xmm11~xmm11": 401, "por~xmm11~xmm12": 402, "pxor~xmm11~xmm13": 403, "pshufd~xmm13~xmm10~imm": 404, "punpcklqdq~xmm13~xmm11": 405, "paddd~reg16~xmm11": 406, "pxor~reg16~xmm13": 407, "por~reg16~xmm13": 408, "pshufd~reg16~xmm11~imm": 409, "punpcklqdq~reg16~reg16": 410, "movdqa~xmm13~xmm12": 411, "paddd~xmm12~reg16": 412, "movdqa~reg16~reg16": 413, "por~reg16~reg16": 414, "pshufd~xmm12~reg16~imm": 415, "pxor~reg16~xmm10": 416, "punpcklqdq~xmm12~reg16": 417, "por~reg16~xmm12": 418, "pshufd~xmm13~reg16~imm": 419, "pxor~reg16~xmm11": 420, "punpcklqdq~xmm13~reg16": 421, "paddd~reg16~reg16": 422, "pshufd~reg16~reg16~imm": 423, "pxor~xmm8~xmm9": 424, "pslld~xmm8~imm": 425, "por~xmm8~reg16": 426, "punpcklqdq~xmm12~xmm8": 427, "pxor~xmm9~xmm10": 428, "movdqa~reg16~xmm13": 429, "paddd~xmm13~xmm8": 430, "pslld~xmm9~imm": 431, "por~xmm9~xmm12": 432, "pshufd~xmm13~xmm8~imm": 433, "punpcklqdq~xmm13~xmm9": 434, "pxor~xmm10~xmm11": 435, "paddd~reg16~xmm9": 436, "pslld~xmm10~imm": 437, "por~xmm10~xmm13": 438, "pshufd~reg16~xmm9~imm": 439, "punpcklqdq~reg16~xmm10": 440, "paddd~xmm12~xmm10": 441, "pslld~xmm11~imm": 442, "por~xmm11~reg16": 443, "pshufd~xmm12~xmm10~imm": 444, "punpcklqdq~xmm12~xmm11": 445, "paddd~xmm13~xmm11": 446, "pshufd~xmm13~xmm11~imm": 447, "shrd~reg4~reg4~imm": 448, "vpxor~xmm13~xmm13~xmm15": 449, "vpxor~xmm12~xmm12~xmm13": 450, "vaesenc~xmm12~xmm12~xmm14": 451, "vpalignr~reg16~reg16~reg16": 452, "vpaddd~xmm9~xmm10~reg16": 453, "shld~reg4~reg4~imm": 454, "vpsrldq~xmm8~reg16~imm": 455, "vpxor~reg16~reg16~reg16": 456, "vpxor~xmm8~xmm8~reg16": 457, "vpxor~reg16~reg16~xmm8": 458, "vmovdqa~ptr2~xmm9": 459, "vaesenc~xmm12~xmm12~xmm15": 460, "vpsrld~xmm8~reg16~imm": 461, "vpslldq~xmm9~reg16~imm": 462, "vpaddd~reg16~reg16~reg16": 463, "vpor~reg16~reg16~xmm8": 464, "vpsrld~xmm8~xmm9~imm": 465, "vpslld~xmm9~xmm9~imm": 466, "vpxor~reg16~reg16~xmm9": 467, "vaesenclast~xmm12~xmm12~xmm15": 468, "vpalignr~xmm8~reg16~reg16": 469, "vmovups~ptr2~xmm12": 470, "vpslld~reg16~reg16~imm": 471, "vmovdqa~xmm9~ptr2": 472, "vpshufb~reg16~reg16~xmm9": 473, "vpaddd~xmm8~reg16~xmm10": 474, "vmovdqa~ptr2~xmm8": 475, "movdqa~xmm11~xmm8": 476, "paddd~xmm9~reg16": 477, "movdqa~xmm10~xmm8": 478, "sha1rnds4~xmm8~xmm9~imm": 479, "sha1nexte~xmm10~reg16": 480, "sha1msg1~reg16~reg16": 481, "movdqa~xmm9~xmm8": 482, "sha1rnds4~xmm8~xmm10~imm": 483, "sha1nexte~xmm9~reg16": 484, "sha1msg2~reg16~reg16": 485, "dec~reg8": 486, "paddd~xmm8~xmm11": 487, "movdqu~ptr2~xmm8": 488, "movd~ptr4~xmm9": 489, "ud2": 490, "palignr~reg16~reg16~imm": 491, "vmovdqa~xmm14~ptr2": 492, "vmovdqa~xmm13~ptr2": 493, "vmovdqa~xmm12~ptr2": 494, "vpinsrq~xmm15~xmm15~reg8": 495, "vpaddd~reg16~reg16~ptr2": 496, "vprotd~reg16~reg16~imm": 497, "vpsrld~reg16~reg16~imm": 498, "vpxor~xmm9~xmm9~xmm10": 499, "vpxor~xmm9~xmm9~xmm8": 500, "vpsrldq~reg16~reg16~imm": 501, "vpslldq~reg16~reg16~imm": 502, "vaesenc~xmm9~xmm9~xmm10": 503, "vaesenclast~xmm11~xmm9~xmm10": 504, "vpand~xmm8~xmm11~xmm12": 505, "vpand~xmm11~xmm11~xmm13": 506, "vpor~xmm8~xmm8~xmm11": 507, "vpand~xmm11~xmm11~xmm14": 508, "vpshufd~reg16~reg16~imm": 509, "vpsrlq~reg16~reg16~imm": 510, "vmovdqa~ymm7~ptr2": 511, "vinserti128~ymm0~ymm0~ptr2": 512, "vinserti128~ymm1~ymm1~ptr2": 513, "vpshufb~ymm0~ymm0~ymm7": 514, "vinserti128~ymm2~ymm2~ptr2": 515, "vpshufb~ymm1~ymm1~ymm7": 516, "vinserti128~ymm3~ymm3~ptr2": 517, "vpshufb~ymm2~ymm2~ymm7": 518, "vpaddd~ymm4~ymm0~ptr2": 519, "vpshufb~ymm3~ymm3~ymm7": 520, "vpaddd~ymm5~ymm1~ptr2": 521, "vpaddd~ymm6~ymm2~ptr2": 522, "vpaddd~ymm7~ymm3~ptr2": 523, "vmovdqa~ptr2~ymm4": 524, "vmovdqa~ptr2~ymm5": 525, "vmovdqa~ptr2~ymm6": 526, "vmovdqa~ptr2~ymm7": 527, "vpalignr~ymm4~ymm1~ymm0": 528, "rorx~reg4~reg4~imm": 529, "vpalignr~ymm7~ymm3~ymm2": 530, "vpsrld~ymm6~ymm4~imm": 531, "andn~reg4~reg4~reg4": 532, "vpaddd~ymm0~ymm0~ymm7": 533, "vpsrld~ymm7~ymm4~imm": 534, "vpslld~ymm5~ymm4~imm": 535, "vpxor~ymm4~ymm7~ymm6": 536, "vpshufd~ymm7~ymm3~imm": 537, "vpsrld~ymm6~ymm6~imm": 538, "vpxor~ymm4~ymm4~ymm5": 539, "vpslld~ymm5~ymm5~imm": 540, "vpxor~ymm4~ymm4~ymm6": 541, "vpsrld~ymm6~ymm7~imm": 542, "vpsrlq~ymm7~ymm7~imm": 543, "vpaddd~ymm0~ymm0~ymm4": 544, "vpxor~ymm6~ymm6~ymm7": 545, "vpshufd~ymm6~ymm6~imm": 546, "vpsrldq~ymm6~ymm6~imm": 547, "vpaddd~ymm0~ymm0~ymm6": 548, "vpshufd~ymm7~ymm0~imm": 549, "vpslldq~ymm6~ymm6~imm": 550, "vpaddd~ymm6~ymm0~ptr2": 551, "vpalignr~ymm4~ymm2~ymm1": 552, "vpalignr~ymm7~ymm0~ymm3": 553, "vpaddd~ymm1~ymm1~ymm7": 554, "vpaddd~ymm1~ymm1~ymm4": 555, "vpaddd~ymm1~ymm1~ymm6": 556, "vpshufd~ymm7~ymm1~imm": 557, "vpaddd~ymm6~ymm1~ptr2": 558, "vpalignr~ymm4~ymm3~ymm2": 559, "vpalignr~ymm7~ymm1~ymm0": 560, "vpaddd~ymm2~ymm2~ymm7": 561, "vpaddd~ymm2~ymm2~ymm4": 562, "vpaddd~ymm2~ymm2~ymm6": 563, "vpshufd~ymm7~ymm2~imm": 564, "vpalignr~ymm4~ymm0~ymm3": 565, "vpalignr~ymm7~ymm2~ymm1": 566, "vpaddd~ymm3~ymm3~ymm7": 567, "vpaddd~ymm3~ymm3~ymm4": 568, "vpaddd~ymm3~ymm3~ymm6": 569, "vpaddd~ymm6~ymm3~ptr2": 570, "vmovq~reg8~xmm15": 571, "vpextrq~reg8~xmm15~imm": 572, "jae": 573, "movdqu~xmm10~ptr2": 574, "movdqu~xmm11~ptr2": 575, "pshufb~xmm10~reg16": 576, "movdqu~xmm13~ptr2": 577, "paddd~reg16~xmm10": 578, "pshufb~xmm11~reg16": 579, "movdqa~xmm9~reg16": 580, "movdqa~xmm8~reg16": 581, "sha256rnds2~reg16~reg16": 582, "pshufb~xmm12~reg16": 583, "paddd~reg16~xmm12": 584, "pshufb~xmm13~reg16": 585, "sha256msg1~xmm10~xmm11": 586, "palignr~reg16~xmm12~imm": 587, "paddd~xmm10~reg16": 588, "sha256msg2~xmm10~xmm13": 589, "sha256msg1~xmm11~xmm12": 590, "palignr~reg16~xmm13~imm": 591, "paddd~xmm11~reg16": 592, "sha256msg2~xmm11~xmm10": 593, "sha256msg1~xmm12~xmm13": 594, "palignr~reg16~xmm10~imm": 595, "sha256msg2~xmm12~xmm11": 596, "sha256msg1~xmm13~xmm10": 597, "palignr~reg16~xmm11~imm": 598, "sha256msg2~xmm13~xmm12": 599, "punpckhqdq~reg16~reg16": 600, "movdqu~ptr2~reg16": 601, "xorps~reg16~reg16": 602, "aesenc~xmm8~reg16": 603, "aesenc~xmm9~reg16": 604, "aesenclast~xmm8~reg16": 605, "aesenclast~xmm9~reg16": 606, "aesdec~xmm8~reg16": 607, "aesdec~xmm9~reg16": 608, "aesdeclast~xmm8~reg16": 609, "aesdeclast~xmm9~reg16": 610, "movups~ptr2~xmm8": 611, "movups~ptr2~xmm9": 612, "xorps~xmm9~xmm9": 613, "pxor~xmm8~xmm8": 614, "pxor~xmm9~xmm9": 615, "movups~xmm8~ptr2": 616, "movdqa~xmm9~ptr2": 617, "xorps~reg16~xmm8": 618, "paddq~reg16~xmm9": 619, "xorps~xmm8~reg16": 620, "movaps~reg16~reg16": 621, "bswap~reg4": 622, "pinsrd~reg16~reg4~imm": 623, "cmp~reg4": 624, "movbe~ptr4~reg4": 625, "movaps~reg16~ptr2": 626, "movdqu~ptr2~xmm9": 627, "movdqu~ptr2~xmm10": 628, "movdqu~ptr2~xmm11": 629, "movdqu~ptr2~xmm12": 630, "movdqu~ptr2~xmm13": 631, "neg~reg4": 632, "movdqa~xmm8~ptr2": 633, "movdqu~xmm14~ptr2": 634, "movdqu~xmm15~ptr2": 635, "pxor~xmm14~reg16": 636, "pxor~xmm15~reg16": 637, "aesenclast~reg16~xmm10": 638, "aesenclast~reg16~xmm11": 639, "movdqa~xmm11~ptr2": 640, "aesenclast~reg16~xmm12": 641, "aesenclast~reg16~xmm13": 642, "aesenclast~reg16~xmm14": 643, "aesenclast~reg16~xmm15": 644, "movdqa~xmm14~ptr2": 645, "movdqa~xmm15~ptr2": 646, "aesenclast~xmm9~xmm10": 647, "movdqa~reg16~xmm14": 648, "movdqa~reg16~xmm15": 649, "movups~xmm10~ptr2": 650, "movups~xmm11~ptr2": 651, "movups~xmm12~ptr2": 652, "xorps~reg16~xmm11": 653, "xorps~xmm8~xmm12": 654, "movups~xmm13~ptr2": 655, "xorps~reg16~xmm10": 656, "xorps~reg16~xmm12": 657, "movaps~ptr2~reg16": 658, "pxor~xmm10~xmm10": 659, "pxor~xmm11~xmm11": 660, "pxor~xmm13~xmm13": 661, "pxor~xmm14~xmm14": 662, "pxor~xmm15~xmm15": 663, "movdqa~xmm15~reg16": 664, "movdqa~xmm14~xmm9": 665, "movdqa~xmm10~xmm15": 666, "psrad~xmm14~imm": 667, "paddq~xmm15~xmm15": 668, "pand~xmm14~xmm8": 669, "pxor~xmm15~xmm14": 670, "movdqa~xmm11~xmm15": 671, "movdqa~xmm12~xmm15": 672, "movdqa~xmm13~xmm15": 673, "movdqa~xmm14~xmm15": 674, "psrad~xmm9~imm": 675, "pand~xmm9~xmm8": 676, "pxor~xmm15~xmm9": 677, "pxor~xmm8~xmm15": 678, "pxor~reg16~xmm14": 679, "pxor~xmm10~xmm9": 680, "pxor~xmm11~xmm9": 681, "pxor~xmm13~xmm9": 682, "movdqa~ptr2~xmm11": 683, "pxor~xmm14~xmm9": 684, "movdqa~ptr2~xmm14": 685, "movdqa~ptr2~xmm8": 686, "pshufd~xmm9~xmm15~imm": 687, "movaps~xmm11~xmm10": 688, "pxor~xmm10~xmm15": 689, "movaps~xmm12~xmm11": 690, "pxor~xmm11~xmm15": 691, "movaps~xmm13~xmm12": 692, "pxor~xmm12~xmm15": 693, "movaps~xmm14~xmm13": 694, "pxor~xmm13~xmm15": 695, "psrad~reg16~imm": 696, "pand~reg16~xmm8": 697, "pxor~xmm14~xmm15": 698, "aesenclast~reg16~ptr2": 699, "xorps~reg16~xmm13": 700, "movdqa~xmm10~xmm11": 701, "movdqa~xmm10~xmm12": 702, "movdqa~xmm10~xmm13": 703, "movdqa~xmm10~xmm14": 704, "setne~reg1": 705, "aesdeclast~reg16~ptr2": 706, "pcmpgtd~xmm14~xmm15": 707, "pshufd~xmm11~xmm14~imm": 708, "pand~xmm11~xmm8": 709, "movdqa~xmm11~xmm12": 710, "movdqa~xmm11~xmm13": 711, "movdqa~xmm11~xmm14": 712, "movups~xmm9~ptr2": 713, "bsf~reg8~reg8": 714, "movdqa~xmm15~xmm14": 715, "movdqa~xmm15~xmm11": 716, "movdqa~xmm15~xmm12": 717, "movdqa~xmm15~xmm13": 718, "movdqu~ptr2~xmm15": 719, "movdqa~xmm14~xmm10": 720, "pxor~xmm11~xmm10": 721, "pxor~xmm12~xmm11": 722, "pxor~xmm13~xmm12": 723, "pxor~xmm14~xmm13": 724, "pxor~reg16~xmm15": 725, "aesdeclast~reg16~xmm10": 726, "aesdeclast~reg16~xmm11": 727, "aesdeclast~reg16~xmm12": 728, "aesdeclast~reg16~xmm13": 729, "aesdeclast~reg16~xmm14": 730, "aesdeclast~reg16~xmm15": 731, "movdqa~xmm11~reg16": 732, "movdqa~xmm14~reg16": 733, "adc~reg8~imm": 734, "aesdeclast~xmm9~xmm10": 735, "movdqa~xmm10~reg16": 736, "movaps~reg16~xmm9": 737, "jle": 738, "movaps~reg16~xmm11": 739, "movaps~xmm8~reg16": 740, "movaps~xmm10~xmm8": 741, "movaps~xmm11~reg16": 742, "movaps~xmm12~reg16": 743, "movaps~xmm13~reg16": 744, "movaps~xmm14~reg16": 745, "movaps~xmm15~reg16": 746, "movaps~xmm10~xmm15": 747, "movaps~xmm10~xmm11": 748, "movaps~xmm10~xmm12": 749, "movaps~xmm10~xmm13": 750, "movaps~xmm10~xmm14": 751, "movups~ptr2~xmm10": 752, "aesimc~reg16~reg16": 753, "and~reg4~ptr4": 754, "aeskeygenassist~reg16~reg16~imm": 755, "movq~reg16~ptr8": 756, "movq~ptr8~reg16": 757, "shufps~reg16~reg16~imm": 758, "pxor~xmm15~xmm8": 759, "pshufb~xmm15~reg16": 760, "psrlq~reg16~imm": 761, "pand~reg16~reg16": 762, "psllq~reg16~imm": 763, "psrlq~xmm15~imm": 764, "pand~xmm15~reg16": 765, "psllq~xmm15~imm": 766, "pxor~xmm15~xmm10": 767, "pand~xmm15~xmm8": 768, "pxor~xmm15~ptr2": 769, "pxor~reg16~ptr2": 770, "por~xmm9~xmm8": 771, "por~xmm10~xmm11": 772, "pand~xmm13~xmm11": 773, "pxor~xmm11~xmm8": 774, "pand~xmm14~xmm11": 775, "pand~xmm12~xmm11": 776, "movdqa~xmm8~xmm12": 777, "por~xmm8~xmm11": 778, "pxor~xmm10~xmm14": 779, "pxor~xmm8~xmm14": 780, "pand~xmm11~reg16": 781, "pand~xmm12~xmm15": 782, "pand~xmm13~reg16": 783, "por~xmm14~reg16": 784, "pand~xmm10~xmm8": 785, "movdqa~xmm14~xmm11": 786, "pxor~xmm13~xmm10": 787, "pand~xmm14~xmm13": 788, "pand~xmm12~xmm10": 789, "movdqa~xmm9~xmm13": 790, "pand~xmm9~reg16": 791, "pand~xmm13~xmm14": 792, "pxor~xmm13~xmm11": 793, "movdqa~xmm9~xmm14": 794, "pand~reg16~xmm14": 795, "pand~reg16~xmm13": 796, "pxor~xmm14~xmm12": 797, "pxor~xmm13~xmm8": 798, "movdqa~xmm9~xmm12": 799, "pxor~xmm9~xmm8": 800, "pand~xmm10~xmm11": 801, "pand~xmm9~xmm15": 802, "pand~reg16~xmm12": 803, "pand~xmm11~xmm13": 804, "pxor~xmm15~xmm11": 805, "pand~xmm10~reg16": 806, "pshufd~reg16~xmm15~imm": 807, "pshufd~xmm14~reg16~imm": 808, "pshufd~xmm15~xmm15~imm": 809, "pand~xmm12~reg16": 810, "pxor~xmm15~xmm13": 811, "pcmpeqd~reg16~reg16": 812, "pand~xmm8~reg16": 813, "pcmpeqb~xmm8~reg16": 814, "pcmpeqb~xmm9~reg16": 815, "pcmpeqb~xmm10~reg16": 816, "pcmpeqb~xmm11~reg16": 817, "pcmpeqb~xmm12~reg16": 818, "movdqa~ptr2~xmm9": 819, "pcmpeqb~xmm13~reg16": 820, "pand~xmm14~reg16": 821, "pcmpeqb~xmm14~reg16": 822, "pcmpeqb~xmm15~reg16": 823, "movdqa~ptr2~xmm15": 824, "pxor~xmm14~ptr2": 825, "movdqu~ptr2~xmm14": 826, "pshufb~xmm8~reg16": 827, "paddd~reg16~ptr2": 828, "paddd~xmm15~ptr2": 829, "inc~reg4": 830, "pcmpgtd~xmm14~reg16": 831, "pshufd~xmm13~xmm14~imm": 832, "paddq~reg16~reg16": 833, "pand~xmm13~xmm12": 834, "add~ptr4~reg4": 835, "add~reg1~ptr1": 836, "add~reg1~imm": 837, "or~ptr1~reg1": 838, "pandn~reg16~reg16": 839, "pand~reg16~xmm9": 840, "movhlps~reg16~reg16": 841, "palignr~reg16~xmm8~imm": 842, "palignr~xmm8~xmm8~imm": 843, "xor~reg4~imm": 844, "cdqe": 845, "sub~ptr4~imm": 846, "cmovs~reg4~reg4": 847, "sar~reg4~imm": 848, "movsxd~reg8~reg4": 849, "test~reg1~reg1": 850, "jg": 851, "shl~reg4~reg1": 852, "or~reg4~imm": 853, "cmp~ptr8~reg8": 854, "not~reg4": 855, "jge": 856, "and~reg1~ptr1": 857, "sete~reg1": 858, "add~ptr4~imm": 859, "cmp~ptr4~reg4": 860, "js": 861, "sub~ptr8~reg8": 862, "jns": 863, "cmovbe~reg8~ptr8": 864, "shl~ptr8~imm": 865, "push~imm": 866, "cmp~reg1~imm": 867, "sub~ptr4~reg4": 868, "xor~reg1~ptr1": 869, "shr~ptr4~imm": 870, "or~ptr4~reg4": 871, "or~ptr8~reg8": 872, "shr~ptr8~imm": 873, "movabs~reg8~imm": 874, "or~reg1~imm": 875, "and~reg1~imm": 876, "and~ptr8~imm": 877, "movsx~reg4~reg1": 878, "imul~reg4": 879, "or~reg8~imm": 880, "mov~ptr2~reg2": 881, "movzx~reg4~ptr2": 882, "and~reg2~ptr2": 883, "mov~ptr2~imm": 884, "or~reg2~ptr2": 885, "movzx~reg4~reg2": 886, "shr~reg1~imm": 887, "and~reg2~imm": 888, "or~ptr4~imm": 889, "sub~reg4~ptr4": 890, "cmp~ptr4": 891, "or~reg8~ptr8": 892, "and~ptr8~reg8": 893, "imul~reg4~reg4~imm": 894, "cmp~ptr1~reg1": 895, "movsx~reg4~ptr1": 896, "imul~reg4~ptr4": 897, "setg~reg1": 898, "or~reg4~ptr4": 899, "sar~ptr4~imm": 900, "and~ptr4~imm": 901, "setle~reg1": 902, "mul~reg8": 903, "and~ptr1~imm": 904, "cmovle~reg4~reg4": 905, "lock xadd~ptr4~reg4": 906, "mfence": 907, "not~reg8": 908, "shl~ptr4~imm": 909, "cmp~reg2~imm": 910, "cmovle~reg4~ptr4": 911, "cdq": 912, "idiv~ptr4": 913, "imul~reg8~reg8~imm": 914, "movsx~reg8~reg2": 915, "movsd~reg16~ptr8": 916, "movsd~ptr8~reg16": 917, "setb~reg1": 918, "neg~ptr4": 919, "div~reg8": 920, "cmovge~reg4~ptr4": 921, "ucomisd~reg16~ptr8": 922, "xorpd~reg16~reg16": 923, "mulsd~reg16~reg16": 924, "cvttsd2si~reg8~reg16": 925, "cvtsi2sd~reg16~ptr8": 926, "subsd~reg16~reg16": 927, "movapd~reg16~reg16": 928, "jp": 929, "ucomisd~reg16~reg16": 930, "divsd~reg16~reg16": 931, "movq~reg8~reg16": 932, "xor~ptr8~reg8": 933, "cvtsi2sd~reg16~reg8": 934, "addsd~reg16~reg16": 935, "setbe~reg1": 936, "repne scasb~reg1~ptr1": 937, "shl~reg8~reg1": 938, "mul~ptr8": 939, "adc~reg8~ptr8": 940, "sbb~reg8~reg8": 941, "sbb~reg8~ptr8": 942, "adc~reg8~reg8": 943, "sar~reg8~imm": 944, "and~reg8~ptr8": 945, "shr~reg8~reg1": 946, "imul~reg8~reg8": 947, "neg~ptr8": 948, "shl~ptr4~reg1": 949, "shr~ptr8~reg1": 950, "sar~reg4~reg1": 951, "and~ptr4~reg4": 952, "imul~reg8~ptr8": 953, "div~ptr8": 954, "cmovge~reg4~reg4": 955, "imul~reg4~reg4": 956, "seta~reg1": 957, "sar~ptr8~imm": 958, "shl~ptr8~reg1": 959, "cmove~reg4~reg4": 960, "vpxord~ymm0~ymm0~ymm0": 961, "vmovdqa64~ymm3~ymm0": 962, "vmovdqa64~ymm16~ymm0": 963, "vmovdqa64~ymm17~ymm0": 964, "vmovdqa64~ymm18~ymm0": 965, "vmovdqa64~ymm19~ymm0": 966, "nop~ptr2": 967, "vpbroadcastq~ymm1~reg8": 968, "mulx~reg8~reg8~reg8": 969, "vpbroadcastq~ymm2~reg8": 970, "vpmadd52luq~ymm3~ymm1~ptr2": 971, "vpmadd52luq~ymm16~ymm1~ptr2": 972, "vpmadd52luq~ymm17~ymm1~ptr2": 973, "vpmadd52luq~ymm18~ymm1~ptr2": 974, "vpmadd52luq~ymm19~ymm1~ptr2": 975, "vpmadd52luq~ymm3~ymm2~ptr2": 976, "vpmadd52luq~ymm16~ymm2~ptr2": 977, "vpmadd52luq~ymm17~ymm2~ptr2": 978, "vpmadd52luq~ymm18~ymm2~ptr2": 979, "vpmadd52luq~ymm19~ymm2~ptr2": 980, "valignq~ymm3~ymm16~ymm3": 981, "valignq~ymm16~ymm17~ymm16": 982, "valignq~ymm17~ymm18~ymm17": 983, "valignq~ymm18~ymm19~ymm18": 984, "valignq~ymm19~ymm0~ymm19": 985, "vmovq~reg8~reg16": 986, "vpmadd52huq~ymm3~ymm1~ptr2": 987, "vpmadd52huq~ymm16~ymm1~ptr2": 988, "vpmadd52huq~ymm17~ymm1~ptr2": 989, "vpmadd52huq~ymm18~ymm1~ptr2": 990, "vpmadd52huq~ymm19~ymm1~ptr2": 991, "vpmadd52huq~ymm3~ymm2~ptr2": 992, "vpmadd52huq~ymm16~ymm2~ptr2": 993, "vpmadd52huq~ymm17~ymm2~ptr2": 994, "vpmadd52huq~ymm18~ymm2~ptr2": 995, "vpmadd52huq~ymm19~ymm2~ptr2": 996, "vpbroadcastq~ymm0~reg8": 997, "vpblendd~ymm3~ymm3~ymm0": 998, "vpsrlq~ymm0~ymm3~imm": 999, "vpsrlq~ymm1~ymm16~34h": 1000, "vpsrlq~ymm2~ymm17~34h": 1001, "vpsrlq~ymm25~ymm18~34h": 1002, "vpsrlq~ymm26~ymm19~34h": 1003, "valignq~ymm26~ymm26~ymm25": 1004, "valignq~ymm25~ymm25~ymm2": 1005, "valignq~ymm2~ymm2~ymm1": 1006, "valignq~ymm1~ymm1~ymm0": 1007, "valignq~ymm0~ymm0~cs:ymmword_6F7BA0": 1008, "vpandq~ymm3~ymm3~ptr2": 1009, "vpandq~ymm16~ymm16~ptr2": 1010, "vpandq~ymm17~ymm17~ptr2": 1011, "vpandq~ymm18~ymm18~ptr2": 1012, "vpandq~ymm19~ymm19~ptr2": 1013, "vpaddq~ymm3~ymm3~ymm0": 1014, "vpaddq~ymm16~ymm16~ymm1": 1015, "vpaddq~ymm17~ymm17~ymm2": 1016, "vpaddq~ymm18~ymm18~ymm25": 1017, "vpaddq~ymm19~ymm19~ymm26": 1018, "vpcmpnleuq~k1~ymm3~cs:ymmword_6F7B60": 1019, "vpcmpnleuq~k2~ymm16~cs:ymmword_6F7B60": 1020, "vpcmpnleuq~k3~ymm17~cs:ymmword_6F7B60": 1021, "vpcmpnleuq~k4~ymm18~cs:ymmword_6F7B60": 1022, "vpcmpnleuq~k5~ymm19~cs:ymmword_6F7B60": 1023, "kmovb~reg4~k1": 1024, "kmovb~reg4~k2": 1025, "kmovb~reg4~k3": 1026, "kmovb~reg4~k4": 1027, "kmovb~reg4~k5": 1028, "vpcmpequq~k1~ymm3~cs:ymmword_6F7B60": 1029, "vpcmpequq~k2~ymm16~cs:ymmword_6F7B60": 1030, "vpcmpequq~k3~ymm17~cs:ymmword_6F7B60": 1031, "vpcmpequq~k4~ymm18~cs:ymmword_6F7B60": 1032, "vpcmpequq~k5~ymm19~cs:ymmword_6F7B60": 1033, "shl~reg1~imm": 1034, "or~reg1~reg1": 1035, "add~reg1~reg1": 1036, "adc~reg1~reg1": 1037, "xor~reg1~reg1": 1038, "kmovb~k1~reg4": 1039, "kmovb~k2~reg4": 1040, "kmovb~k3~reg4": 1041, "kmovb~k4~reg4": 1042, "kmovb~k5~reg4": 1043, "vpsubq~ymm3 {k1}~ymm3~ptr2": 1044, "vpsubq~ymm16 {k2}~ymm16~ptr2": 1045, "vpsubq~ymm17 {k3}~ymm17~ptr2": 1046, "vpsubq~ymm18 {k4}~ymm18~ptr2": 1047, "vpsubq~ymm19 {k5}~ymm19~ptr2": 1048, "vmovdqu64~ptr2~ymm3": 1049, "vmovdqu64~ptr2~ymm16": 1050, "vmovdqu64~ptr2~ymm17": 1051, "vmovdqu64~ptr2~ymm18": 1052, "vmovdqu64~ptr2~ymm19": 1053, "vmovdqa64~ymm4~ymm0": 1054, "vmovdqa64~ymm20~ymm0": 1055, "vmovdqa64~ymm21~ymm0": 1056, "vmovdqa64~ymm22~ymm0": 1057, "vmovdqa64~ymm23~ymm0": 1058, "vpmadd52luq~ymm4~ymm1~ptr2": 1059, "vpmadd52luq~ymm20~ymm1~ptr2": 1060, "vpmadd52luq~ymm21~ymm1~ptr2": 1061, "vpmadd52luq~ymm22~ymm1~ptr2": 1062, "vpmadd52luq~ymm23~ymm1~ptr2": 1063, "vpmadd52luq~ymm4~ymm2~ptr2": 1064, "vpmadd52luq~ymm20~ymm2~ptr2": 1065, "vpmadd52luq~ymm21~ymm2~ptr2": 1066, "vpmadd52luq~ymm22~ymm2~ptr2": 1067, "vpmadd52luq~ymm23~ymm2~ptr2": 1068, "valignq~ymm4~ymm20~ymm4": 1069, "valignq~ymm20~ymm21~ymm20": 1070, "valignq~ymm21~ymm22~ymm21": 1071, "valignq~ymm22~ymm23~ymm22": 1072, "valignq~ymm23~ymm0~ymm23": 1073, "vpmadd52huq~ymm4~ymm1~ptr2": 1074, "vpmadd52huq~ymm20~ymm1~ptr2": 1075, "vpmadd52huq~ymm21~ymm1~ptr2": 1076, "vpmadd52huq~ymm22~ymm1~ptr2": 1077, "vpmadd52huq~ymm23~ymm1~ptr2": 1078, "vpmadd52huq~ymm4~ymm2~ptr2": 1079, "vpmadd52huq~ymm20~ymm2~ptr2": 1080, "vpmadd52huq~ymm21~ymm2~ptr2": 1081, "vpmadd52huq~ymm22~ymm2~ptr2": 1082, "vpmadd52huq~ymm23~ymm2~ptr2": 1083, "vpblendd~ymm4~ymm4~ymm0": 1084, "vpsrlq~ymm0~ymm4~imm": 1085, "vpsrlq~ymm1~ymm20~34h": 1086, "vpsrlq~ymm2~ymm21~34h": 1087, "vpsrlq~ymm25~ymm22~34h": 1088, "vpsrlq~ymm26~ymm23~34h": 1089, "vpandq~ymm4~ymm4~ptr2": 1090, "vpandq~ymm20~ymm20~ptr2": 1091, "vpandq~ymm21~ymm21~ptr2": 1092, "vpandq~ymm22~ymm22~ptr2": 1093, "vpandq~ymm23~ymm23~ptr2": 1094, "vpaddq~ymm4~ymm4~ymm0": 1095, "vpaddq~ymm20~ymm20~ymm1": 1096, "vpaddq~ymm21~ymm21~ymm2": 1097, "vpaddq~ymm22~ymm22~ymm25": 1098, "vpaddq~ymm23~ymm23~ymm26": 1099, "vpcmpnleuq~k1~ymm4~cs:ymmword_6F7B60": 1100, "vpcmpnleuq~k2~ymm20~cs:ymmword_6F7B60": 1101, "vpcmpnleuq~k3~ymm21~cs:ymmword_6F7B60": 1102, "vpcmpnleuq~k4~ymm22~cs:ymmword_6F7B60": 1103, "vpcmpnleuq~k5~ymm23~cs:ymmword_6F7B60": 1104, "vpcmpequq~k1~ymm4~cs:ymmword_6F7B60": 1105, "vpcmpequq~k2~ymm20~cs:ymmword_6F7B60": 1106, "vpcmpequq~k3~ymm21~cs:ymmword_6F7B60": 1107, "vpcmpequq~k4~ymm22~cs:ymmword_6F7B60": 1108, "vpcmpequq~k5~ymm23~cs:ymmword_6F7B60": 1109, "vpsubq~ymm4 {k1}~ymm4~ptr2": 1110, "vpsubq~ymm20 {k2}~ymm20~ptr2": 1111, "vpsubq~ymm21 {k3}~ymm21~ptr2": 1112, "vpsubq~ymm22 {k4}~ymm22~ptr2": 1113, "vpsubq~ymm23 {k5}~ymm23~ptr2": 1114, "vmovdqu64~ptr2~ymm4": 1115, "vmovdqu64~ptr2~ymm20": 1116, "vmovdqu64~ptr2~ymm21": 1117, "vmovdqu64~ptr2~ymm22": 1118, "vmovdqu64~ptr2~ymm23": 1119, "vmovdqa64~ymm24~ptr2": 1120, "vpbroadcastq~ymm22~reg8": 1121, "vpbroadcastq~ymm23~reg8": 1122, "vmovdqa64~ymm1~ymm0": 1123, "vmovdqa64~ymm2~ymm0": 1124, "vmovdqa64~ymm5~ymm0": 1125, "vpcmpeqq~k1~ymm22~ymm21": 1126, "vpcmpeqq~k2~ymm23~ymm21": 1127, "vmovdqu64~ymm20~ptr2": 1128, "vpblendmq~ymm0 {k1}~ymm0~ymm20": 1129, "vpblendmq~ymm1 {k1}~ymm1~ymm20": 1130, "vpblendmq~ymm2 {k1}~ymm2~ymm20": 1131, "vpblendmq~ymm3 {k1}~ymm3~ymm20": 1132, "vpblendmq~ymm4 {k1}~ymm4~ymm20": 1133, "vpblendmq~ymm5 {k2}~ymm5~ymm20": 1134, "vpblendmq~ymm16 {k2}~ymm16~ymm20": 1135, "vpblendmq~ymm17 {k2}~ymm17~ymm20": 1136, "vpblendmq~ymm18 {k2}~ymm18~ymm20": 1137, "vpblendmq~ymm19 {k2}~ymm19~ymm20": 1138, "vpaddq~ymm21~ymm21~ymm24": 1139, "vmovdqu64~ptr2~ymm0": 1140, "vmovdqu64~ptr2~ymm1": 1141, "vmovdqu64~ptr2~ymm2": 1142, "vmovdqu64~ptr2~ymm5": 1143, "vmovdqa64~ymm6~ymm0": 1144, "vmovdqa64~ymm7~ymm0": 1145, "vmovdqa64~ymm8~ymm0": 1146, "vmovdqa64~ymm9~ymm0": 1147, "vmovdqa64~ymm10~ymm0": 1148, "vpmadd52luq~ymm5~ymm1~ptr2": 1149, "vpmadd52luq~ymm6~ymm1~ptr2": 1150, "vpmadd52luq~ymm7~ymm1~ptr2": 1151, "vpmadd52luq~ymm8~ymm1~ptr2": 1152, "vpmadd52luq~ymm9~ymm1~ptr2": 1153, "vpmadd52luq~ymm10~ymm1~ptr2": 1154, "vpmadd52luq~ymm5~ymm2~ptr2": 1155, "vpmadd52luq~ymm6~ymm2~ptr2": 1156, "vpmadd52luq~ymm7~ymm2~ptr2": 1157, "vpmadd52luq~ymm8~ymm2~ptr2": 1158, "vpmadd52luq~ymm9~ymm2~ptr2": 1159, "vpmadd52luq~ymm10~ymm2~ptr2": 1160, "valignq~ymm3~ymm4~ymm3": 1161, "valignq~ymm4~ymm5~ymm4": 1162, "valignq~ymm5~ymm6~ymm5": 1163, "valignq~ymm6~ymm7~ymm6": 1164, "valignq~ymm7~ymm8~ymm7": 1165, "valignq~ymm8~ymm9~ymm8": 1166, "valignq~ymm9~ymm10~ymm9": 1167, "valignq~ymm10~ymm0~ymm10": 1168, "vpmadd52huq~ymm5~ymm1~ptr2": 1169, "vpmadd52huq~ymm6~ymm1~ptr2": 1170, "vpmadd52huq~ymm7~ymm1~ptr2": 1171, "vpmadd52huq~ymm8~ymm1~ptr2": 1172, "vpmadd52huq~ymm9~ymm1~ptr2": 1173, "vpmadd52huq~ymm10~ymm1~ptr2": 1174, "vpmadd52huq~ymm5~ymm2~ptr2": 1175, "vpmadd52huq~ymm6~ymm2~ptr2": 1176, "vpmadd52huq~ymm7~ymm2~ptr2": 1177, "vpmadd52huq~ymm8~ymm2~ptr2": 1178, "vpmadd52huq~ymm9~ymm2~ptr2": 1179, "vpmadd52huq~ymm10~ymm2~ptr2": 1180, "vpsrlq~ymm1~ymm4~imm": 1181, "vpsrlq~ymm2~ymm5~imm": 1182, "vpsrlq~ymm19~ymm6~34h": 1183, "vpsrlq~ymm20~ymm7~34h": 1184, "vpsrlq~ymm21~ymm8~34h": 1185, "vpsrlq~ymm22~ymm9~34h": 1186, "vpsrlq~ymm23~ymm10~34h": 1187, "valignq~ymm23~ymm23~ymm22": 1188, "valignq~ymm22~ymm22~ymm21": 1189, "valignq~ymm21~ymm21~ymm20": 1190, "valignq~ymm20~ymm20~ymm19": 1191, "valignq~ymm19~ymm19~ymm2": 1192, "valignq~ymm0~ymm0~cs:ymmword_6F7C00": 1193, "vpandq~ymm5~ymm5~ptr2": 1194, "vpandq~ymm6~ymm6~ptr2": 1195, "vpandq~ymm7~ymm7~ptr2": 1196, "vpandq~ymm8~ymm8~ptr2": 1197, "vpandq~ymm9~ymm9~ptr2": 1198, "vpandq~ymm10~ymm10~ptr2": 1199, "vpaddq~ymm4~ymm4~ymm1": 1200, "vpaddq~ymm5~ymm5~ymm2": 1201, "vpaddq~ymm6~ymm6~ymm19": 1202, "vpaddq~ymm7~ymm7~ymm20": 1203, "vpaddq~ymm8~ymm8~ymm21": 1204, "vpaddq~ymm9~ymm9~ymm22": 1205, "vpaddq~ymm10~ymm10~ymm23": 1206, "vpcmpnleuq~k1~ymm3~cs:ymmword_6F7BC0": 1207, "vpcmpnleuq~k2~ymm4~cs:ymmword_6F7BC0": 1208, "vpcmpnleuq~k1~ymm5~cs:ymmword_6F7BC0": 1209, "vpcmpnleuq~k2~ymm6~cs:ymmword_6F7BC0": 1210, "vpcmpnleuq~k1~ymm7~cs:ymmword_6F7BC0": 1211, "vpcmpnleuq~k2~ymm8~cs:ymmword_6F7BC0": 1212, "vpcmpnleuq~k1~ymm9~cs:ymmword_6F7BC0": 1213, "vpcmpnleuq~k2~ymm10~cs:ymmword_6F7BC0": 1214, "vpcmpequq~k1~ymm3~cs:ymmword_6F7BC0": 1215, "vpcmpequq~k2~ymm4~cs:ymmword_6F7BC0": 1216, "vpcmpequq~k1~ymm5~cs:ymmword_6F7BC0": 1217, "vpcmpequq~k2~ymm6~cs:ymmword_6F7BC0": 1218, "vpcmpequq~k1~ymm7~cs:ymmword_6F7BC0": 1219, "vpcmpequq~k2~ymm8~cs:ymmword_6F7BC0": 1220, "vpcmpequq~k1~ymm9~cs:ymmword_6F7BC0": 1221, "vpcmpequq~k2~ymm10~cs:ymmword_6F7BC0": 1222, "kmovb~k6~reg4": 1223, "kmovb~k7~reg4": 1224, "vpsubq~ymm4 {k2}~ymm4~ptr2": 1225, "vpsubq~ymm5 {k3}~ymm5~ptr2": 1226, "vpsubq~ymm6 {k4}~ymm6~ptr2": 1227, "vpsubq~ymm7 {k5}~ymm7~ptr2": 1228, "vpsubq~ymm8 {k6}~ymm8~ptr2": 1229, "vpsubq~ymm9 {k7}~ymm9~ptr2": 1230, "vpsubq~ymm10 {k1}~ymm10~ptr2": 1231, "vmovdqu64~ptr2~ymm6": 1232, "vmovdqu64~ptr2~ymm7": 1233, "vmovdqu64~ptr2~ymm8": 1234, "vmovdqu64~ptr2~ymm9": 1235, "vmovdqu64~ptr2~ymm10": 1236, "vmovdqa64~ymm11~ymm0": 1237, "vmovdqa64~ymm12~ymm0": 1238, "vmovdqa64~ymm13~ymm0": 1239, "vmovdqa64~ymm14~ymm0": 1240, "vmovdqa64~ymm15~ymm0": 1241, "vpmadd52luq~ymm11~ymm1~ptr2": 1242, "vpmadd52luq~ymm12~ymm1~ptr2": 1243, "vpmadd52luq~ymm13~ymm1~ptr2": 1244, "vpmadd52luq~ymm14~ymm1~ptr2": 1245, "vpmadd52luq~ymm15~ymm1~ptr2": 1246, "vpmadd52luq~ymm11~ymm2~ptr2": 1247, "vpmadd52luq~ymm12~ymm2~ptr2": 1248, "vpmadd52luq~ymm13~ymm2~ptr2": 1249, "vpmadd52luq~ymm14~ymm2~ptr2": 1250, "vpmadd52luq~ymm15~ymm2~ptr2": 1251, "valignq~ymm11~ymm12~ymm11": 1252, "valignq~ymm12~ymm13~ymm12": 1253, "valignq~ymm13~ymm14~ymm13": 1254, "valignq~ymm14~ymm15~ymm14": 1255, "valignq~ymm15~ymm16~ymm15": 1256, "valignq~ymm18~ymm0~ymm18": 1257, "vmovq~reg8~xmm11": 1258, "vpmadd52huq~ymm11~ymm1~ptr2": 1259, "vpmadd52huq~ymm12~ymm1~ptr2": 1260, "vpmadd52huq~ymm13~ymm1~ptr2": 1261, "vpmadd52huq~ymm14~ymm1~ptr2": 1262, "vpmadd52huq~ymm15~ymm1~ptr2": 1263, "vpmadd52huq~ymm11~ymm2~ptr2": 1264, "vpmadd52huq~ymm12~ymm2~ptr2": 1265, "vpmadd52huq~ymm13~ymm2~ptr2": 1266, "vpmadd52huq~ymm14~ymm2~ptr2": 1267, "vpmadd52huq~ymm15~ymm2~ptr2": 1268, "vpblendd~ymm11~ymm11~ymm0": 1269, "vpsrlq~ymm0~ymm11~imm": 1270, "vpsrlq~ymm1~ymm12~imm": 1271, "vpsrlq~ymm2~ymm13~imm": 1272, "vpsrlq~ymm19~ymm14~34h": 1273, "vpsrlq~ymm20~ymm15~34h": 1274, "vpsrlq~ymm21~ymm16~34h": 1275, "vpsrlq~ymm22~ymm17~34h": 1276, "vpsrlq~ymm23~ymm18~34h": 1277, "vpandq~ymm11~ymm11~ptr2": 1278, "vpandq~ymm12~ymm12~ptr2": 1279, "vpandq~ymm13~ymm13~ptr2": 1280, "vpandq~ymm14~ymm14~ptr2": 1281, "vpandq~ymm15~ymm15~ptr2": 1282, "vpaddq~ymm11~ymm11~ymm0": 1283, "vpaddq~ymm12~ymm12~ymm1": 1284, "vpaddq~ymm13~ymm13~ymm2": 1285, "vpaddq~ymm14~ymm14~ymm19": 1286, "vpaddq~ymm15~ymm15~ymm20": 1287, "vpaddq~ymm16~ymm16~ymm21": 1288, "vpaddq~ymm17~ymm17~ymm22": 1289, "vpaddq~ymm18~ymm18~ymm23": 1290, "vpcmpnleuq~k1~ymm11~cs:ymmword_6F7BC0": 1291, "vpcmpnleuq~k2~ymm12~cs:ymmword_6F7BC0": 1292, "vpcmpnleuq~k1~ymm13~cs:ymmword_6F7BC0": 1293, "vpcmpnleuq~k2~ymm14~cs:ymmword_6F7BC0": 1294, "vpcmpnleuq~k1~ymm15~cs:ymmword_6F7BC0": 1295, "vpcmpnleuq~k2~ymm16~cs:ymmword_6F7BC0": 1296, "vpcmpnleuq~k1~ymm17~cs:ymmword_6F7BC0": 1297, "vpcmpnleuq~k2~ymm18~cs:ymmword_6F7BC0": 1298, "vpcmpequq~k1~ymm11~cs:ymmword_6F7BC0": 1299, "vpcmpequq~k2~ymm12~cs:ymmword_6F7BC0": 1300, "vpcmpequq~k1~ymm13~cs:ymmword_6F7BC0": 1301, "vpcmpequq~k2~ymm14~cs:ymmword_6F7BC0": 1302, "vpcmpequq~k1~ymm15~cs:ymmword_6F7BC0": 1303, "vpcmpequq~k2~ymm16~cs:ymmword_6F7BC0": 1304, "vpcmpequq~k1~ymm17~cs:ymmword_6F7BC0": 1305, "vpcmpequq~k2~ymm18~cs:ymmword_6F7BC0": 1306, "vpsubq~ymm11 {k1}~ymm11~ptr2": 1307, "vpsubq~ymm12 {k2}~ymm12~ptr2": 1308, "vpsubq~ymm13 {k3}~ymm13~ptr2": 1309, "vpsubq~ymm14 {k4}~ymm14~ptr2": 1310, "vpsubq~ymm15 {k5}~ymm15~ptr2": 1311, "vpsubq~ymm16 {k6}~ymm16~ptr2": 1312, "vpsubq~ymm17 {k7}~ymm17~ptr2": 1313, "vpsubq~ymm18 {k1}~ymm18~ptr2": 1314, "vmovdqu64~ptr2~ymm11": 1315, "vmovdqu64~ptr2~ymm12": 1316, "vmovdqu64~ptr2~ymm13": 1317, "vmovdqu64~ptr2~ymm14": 1318, "vmovdqu64~ptr2~ymm15": 1319, "vmovdqa64~ymm30~ptr2": 1320, "vpbroadcastq~ymm28~reg8": 1321, "vpbroadcastq~ymm29~reg8": 1322, "vmovdqa64~ymm27~ymm0": 1323, "vmovdqa64~ymm24~ymm0": 1324, "vmovdqa64~ymm25~ymm0": 1325, "vpcmpeqq~k1~ymm28~ymm27": 1326, "vpcmpeqq~k2~ymm29~ymm27": 1327, "vmovdqu64~ymm26~ptr2": 1328, "vpblendmq~ymm0 {k1}~ymm0~ymm26": 1329, "vpblendmq~ymm1 {k1}~ymm1~ymm26": 1330, "vpblendmq~ymm2 {k1}~ymm2~ymm26": 1331, "vpblendmq~ymm3 {k1}~ymm3~ymm26": 1332, "vpblendmq~ymm4 {k1}~ymm4~ymm26": 1333, "vpblendmq~ymm5 {k1}~ymm5~ymm26": 1334, "vpblendmq~ymm16 {k1}~ymm16~ymm26": 1335, "vpblendmq~ymm17 {k1}~ymm17~ymm26": 1336, "vpblendmq~ymm18 {k2}~ymm18~ymm26": 1337, "vpblendmq~ymm19 {k2}~ymm19~ymm26": 1338, "vpblendmq~ymm20 {k2}~ymm20~ymm26": 1339, "vpblendmq~ymm21 {k2}~ymm21~ymm26": 1340, "vpblendmq~ymm22 {k2}~ymm22~ymm26": 1341, "vpblendmq~ymm23 {k2}~ymm23~ymm26": 1342, "vpblendmq~ymm24 {k2}~ymm24~ymm26": 1343, "vpblendmq~ymm25 {k2}~ymm25~ymm26": 1344, "vpaddq~ymm27~ymm27~ymm30": 1345, "vmovdqu64~ptr2~ymm24": 1346, "vmovdqu64~ptr2~ymm25": 1347, "valignq~ymm10~ymm11~ymm10": 1348, "valignq~ymm12~ymm0~ymm12": 1349, "vpsrlq~ymm23~ymm6~34h": 1350, "vpsrlq~ymm24~ymm7~34h": 1351, "vpsrlq~ymm25~ymm8~34h": 1352, "vpsrlq~ymm26~ymm9~34h": 1353, "vpsrlq~ymm27~ymm10~34h": 1354, "vpsrlq~ymm28~ymm11~34h": 1355, "vpsrlq~ymm29~ymm12~34h": 1356, "valignq~ymm29~ymm29~ymm28": 1357, "valignq~ymm28~ymm28~ymm27": 1358, "valignq~ymm27~ymm27~ymm26": 1359, "valignq~ymm25~ymm25~ymm24": 1360, "valignq~ymm24~ymm24~ymm23": 1361, "valignq~ymm23~ymm23~ymm2": 1362, "valignq~ymm0~ymm0~cs:ymmword_6F7C60": 1363, "vpaddq~ymm6~ymm6~ymm23": 1364, "vpaddq~ymm7~ymm7~ymm24": 1365, "vpaddq~ymm8~ymm8~ymm25": 1366, "vpaddq~ymm9~ymm9~ymm26": 1367, "vpaddq~ymm10~ymm10~ymm27": 1368, "vpaddq~ymm11~ymm11~ymm28": 1369, "vpaddq~ymm12~ymm12~ymm29": 1370, "vpcmpnleuq~k1~ymm3~cs:ymmword_6F7C20": 1371, "vpcmpnleuq~k2~ymm4~cs:ymmword_6F7C20": 1372, "vpcmpnleuq~k1~ymm5~cs:ymmword_6F7C20": 1373, "vpcmpnleuq~k2~ymm6~cs:ymmword_6F7C20": 1374, "vpcmpnleuq~k1~ymm7~cs:ymmword_6F7C20": 1375, "vpcmpnleuq~k2~ymm8~cs:ymmword_6F7C20": 1376, "vpcmpnleuq~k1~ymm9~cs:ymmword_6F7C20": 1377, "vpcmpnleuq~k2~ymm10~cs:ymmword_6F7C20": 1378, "vpcmpnleuq~k1~ymm11~cs:ymmword_6F7C20": 1379, "vpcmpnleuq~k2~ymm12~cs:ymmword_6F7C20": 1380, "vpcmpequq~k1~ymm3~cs:ymmword_6F7C20": 1381, "vpcmpequq~k2~ymm4~cs:ymmword_6F7C20": 1382, "vpcmpequq~k1~ymm5~cs:ymmword_6F7C20": 1383, "vpcmpequq~k2~ymm6~cs:ymmword_6F7C20": 1384, "vpcmpequq~k1~ymm7~cs:ymmword_6F7C20": 1385, "vpcmpequq~k2~ymm8~cs:ymmword_6F7C20": 1386, "vpcmpequq~k1~ymm9~cs:ymmword_6F7C20": 1387, "vpcmpequq~k2~ymm10~cs:ymmword_6F7C20": 1388, "vpcmpequq~k1~ymm11~cs:ymmword_6F7C20": 1389, "vpcmpequq~k2~ymm12~cs:ymmword_6F7C20": 1390, "vpsubq~ymm11 {k2}~ymm11~ptr2": 1391, "vpsubq~ymm12 {k3}~ymm12~ptr2": 1392, "valignq~ymm19~ymm20~ymm19": 1393, "valignq~ymm22~ymm0~ymm22": 1394, "vmovq~reg8~xmm13": 1395, "vpblendd~ymm13~ymm13~ymm0": 1396, "vpsrlq~ymm0~ymm13~imm": 1397, "vpsrlq~ymm1~ymm14~imm": 1398, "vpsrlq~ymm2~ymm15~imm": 1399, "vpsrlq~ymm23~ymm16~34h": 1400, "vpsrlq~ymm24~ymm17~34h": 1401, "vpsrlq~ymm27~ymm20~34h": 1402, "vpsrlq~ymm28~ymm21~34h": 1403, "vpsrlq~ymm29~ymm22~34h": 1404, "vpaddq~ymm13~ymm13~ymm0": 1405, "vpaddq~ymm14~ymm14~ymm1": 1406, "vpaddq~ymm15~ymm15~ymm2": 1407, "vpaddq~ymm16~ymm16~ymm23": 1408, "vpaddq~ymm17~ymm17~ymm24": 1409, "vpaddq~ymm20~ymm20~ymm27": 1410, "vpaddq~ymm21~ymm21~ymm28": 1411, "vpaddq~ymm22~ymm22~ymm29": 1412, "vpcmpnleuq~k1~ymm13~cs:ymmword_6F7C20": 1413, "vpcmpnleuq~k2~ymm14~cs:ymmword_6F7C20": 1414, "vpcmpnleuq~k1~ymm15~cs:ymmword_6F7C20": 1415, "vpcmpnleuq~k2~ymm16~cs:ymmword_6F7C20": 1416, "vpcmpnleuq~k1~ymm17~cs:ymmword_6F7C20": 1417, "vpcmpnleuq~k2~ymm18~cs:ymmword_6F7C20": 1418, "vpcmpnleuq~k1~ymm19~cs:ymmword_6F7C20": 1419, "vpcmpnleuq~k2~ymm20~cs:ymmword_6F7C20": 1420, "vpcmpnleuq~k1~ymm21~cs:ymmword_6F7C20": 1421, "vpcmpnleuq~k2~ymm22~cs:ymmword_6F7C20": 1422, "vpcmpequq~k1~ymm13~cs:ymmword_6F7C20": 1423, "vpcmpequq~k2~ymm14~cs:ymmword_6F7C20": 1424, "vpcmpequq~k1~ymm15~cs:ymmword_6F7C20": 1425, "vpcmpequq~k2~ymm16~cs:ymmword_6F7C20": 1426, "vpcmpequq~k1~ymm17~cs:ymmword_6F7C20": 1427, "vpcmpequq~k2~ymm18~cs:ymmword_6F7C20": 1428, "vpcmpequq~k1~ymm19~cs:ymmword_6F7C20": 1429, "vpcmpequq~k2~ymm20~cs:ymmword_6F7C20": 1430, "vpcmpequq~k1~ymm21~cs:ymmword_6F7C20": 1431, "vpcmpequq~k2~ymm22~cs:ymmword_6F7C20": 1432, "vpsubq~ymm13 {k1}~ymm13~ptr2": 1433, "vpsubq~ymm14 {k2}~ymm14~ptr2": 1434, "vpsubq~ymm15 {k3}~ymm15~ptr2": 1435, "vpsubq~ymm16 {k4}~ymm16~ptr2": 1436, "vpsubq~ymm17 {k5}~ymm17~ptr2": 1437, "vpsubq~ymm18 {k6}~ymm18~ptr2": 1438, "vpsubq~ymm19 {k7}~ymm19~ptr2": 1439, "vpsubq~ymm20 {k1}~ymm20~ptr2": 1440, "vpsubq~ymm21 {k2}~ymm21~ptr2": 1441, "vpsubq~ymm22 {k3}~ymm22~ptr2": 1442, "vpxorq~ymm21~ymm21~ymm21": 1443, "vpblendmq~ymm5 {k1}~ymm5~ymm20": 1444, "vpblendmq~ymm16 {k1}~ymm16~ymm20": 1445, "vpblendmq~ymm17 {k1}~ymm17~ymm20": 1446, "vpblendmq~ymm18 {k1}~ymm18~ymm20": 1447, "vpblendmq~ymm19 {k1}~ymm19~ymm20": 1448, "vpcmpeqq~k1~ymm23~ymm21": 1449, "vpxor~ymm9~ymm9~ymm9": 1450, "vmovdqu~ymm0~ptr2": 1451, "vmovdqu~ymm1~ptr2": 1452, "vmovdqu~ymm2~ptr2": 1453, "vmovdqu~ymm3~ptr2": 1454, "vmovdqu~ymm4~ptr2": 1455, "vmovdqu~ymm5~ptr2": 1456, "vmovdqu~ymm6~ptr2": 1457, "vmovdqu~ymm7~ptr2": 1458, "vmovdqu~ymm8~ptr2": 1459, "vmovdqu~ptr2~ymm0": 1460, "vmovdqu~ptr2~ymm1": 1461, "vmovdqu~ptr2~ymm2": 1462, "vmovdqu~ptr2~ymm3": 1463, "vmovdqu~ptr2~ymm4": 1464, "vmovdqu~ptr2~ymm5": 1465, "vmovdqu~ptr2~ymm6": 1466, "vmovdqu~ptr2~ymm7": 1467, "vmovdqu~ptr2~ymm8": 1468, "vmovdqu~ptr2~ymm9": 1469, "vmovdqu~ymm15~ptr2": 1470, "vpaddq~ymm1~ymm1~ymm1": 1471, "vpbroadcastq~ymm10~ptr8": 1472, "vpaddq~ymm2~ymm2~ymm2": 1473, "vmovdqa~ptr2~ymm1": 1474, "vpaddq~ymm3~ymm3~ymm3": 1475, "vmovdqa~ptr2~ymm2": 1476, "vpaddq~ymm4~ymm4~ymm4": 1477, "vmovdqa~ptr2~ymm3": 1478, "vpaddq~ymm5~ymm5~ymm5": 1479, "vpaddq~ymm6~ymm6~ymm6": 1480, "vpaddq~ymm7~ymm7~ymm7": 1481, "vpaddq~ymm8~ymm8~ymm8": 1482, "vmovdqa~ptr2~ymm8": 1483, "vpmuludq~ymm0~ymm10~ptr2": 1484, "vpbroadcastq~ymm11~ptr8": 1485, "vpmuludq~ymm1~ymm1~ymm10": 1486, "vpmuludq~ymm2~ymm2~ymm10": 1487, "vpmuludq~ymm3~ymm3~ymm10": 1488, "vpmuludq~ymm4~ymm4~ymm10": 1489, "vpmuludq~ymm5~ymm5~ymm10": 1490, "vpmuludq~ymm6~ymm6~ymm10": 1491, "vpmuludq~ymm7~ymm7~ymm10": 1492, "vpmuludq~ymm8~ymm8~ymm10": 1493, "vpaddq~ymm0~ymm0~ptr2": 1494, "vpmuludq~ymm1~ymm10~ptr2": 1495, "vpaddq~ymm1~ymm1~ptr2": 1496, "vpmuludq~ymm2~ymm10~ptr2": 1497, "vpaddq~ymm2~ymm2~ptr2": 1498, "vpmuludq~ymm3~ymm10~ptr2": 1499, "vpaddq~ymm3~ymm3~ptr2": 1500, "vpmuludq~ymm4~ymm10~ptr2": 1501, "vpaddq~ymm4~ymm4~ptr2": 1502, "vpmuludq~ymm5~ymm10~ptr2": 1503, "vpaddq~ymm5~ymm5~ptr2": 1504, "vpmuludq~ymm6~ymm10~ptr2": 1505, "vpaddq~ymm6~ymm6~ptr2": 1506, "vpmuludq~ymm7~ymm10~ptr2": 1507, "vpaddq~ymm7~ymm7~ptr2": 1508, "vpmuludq~ymm8~ymm10~ptr2": 1509, "vpaddq~ymm8~ymm8~ptr2": 1510, "vpmuludq~ymm12~ymm11~ptr2": 1511, "vpaddq~ymm2~ymm2~ymm12": 1512, "vpmuludq~ymm14~ymm11~ptr2": 1513, "vpaddq~ymm3~ymm3~ymm14": 1514, "vpmuludq~ymm13~ymm11~ptr2": 1515, "vpaddq~ymm4~ymm4~ymm13": 1516, "vpaddq~ymm5~ymm5~ymm12": 1517, "vpaddq~ymm6~ymm6~ymm14": 1518, "vpaddq~ymm7~ymm7~ymm13": 1519, "vpaddq~ymm8~ymm8~ymm12": 1520, "vpmuludq~ymm0~ymm11~ptr2": 1521, "vpmuludq~ymm13~ymm10~ptr2": 1522, "vpmuludq~ymm12~ymm10~ptr2": 1523, "vpmuludq~ymm14~ymm10~ptr2": 1524, "vpaddq~ymm0~ymm0~ymm14": 1525, "vpaddq~ymm6~ymm6~ymm12": 1526, "vpaddq~ymm7~ymm7~ymm14": 1527, "vpaddq~ymm8~ymm8~ymm13": 1528, "vpaddq~ymm0~ymm0~ymm12": 1529, "vpaddq~ymm1~ymm1~ymm14": 1530, "vpmuludq~ymm2~ymm11~ptr2": 1531, "vpaddq~ymm1~ymm1~ymm13": 1532, "vpmuludq~ymm4~ymm11~ptr2": 1533, "vpaddq~ymm3~ymm3~ymm12": 1534, "vpbroadcastq~ymm0~ptr8": 1535, "vpaddq~ymm4~ymm4~ymm14": 1536, "vpmuludq~ymm6~ymm11~ptr2": 1537, "vpmuludq~ymm7~ymm0~ptr2": 1538, "vpsrlq~ymm14~ymm8~imm": 1539, "vpand~ymm8~ymm8~ymm15": 1540, "vpsrlq~ymm11~ymm1~imm": 1541, "vpand~ymm1~ymm1~ymm15": 1542, "vpermq~ymm14~ymm14~imm": 1543, "vpermq~ymm11~ymm11~imm": 1544, "vpblendd~ymm10~ymm14~ymm9": 1545, "vpblendd~ymm14~ymm11~ymm14": 1546, "vpaddq~ymm8~ymm8~ymm10": 1547, "vpblendd~ymm11~ymm9~ymm11": 1548, "vpaddq~ymm2~ymm2~ymm11": 1549, "vmovd~xmm12~reg4": 1550, "vpbroadcastq~ymm12~xmm12": 1551, "vmovd~xmm13~reg4": 1552, "vpbroadcastq~ymm13~xmm13": 1553, "vpmuludq~ymm10~ymm12~ptr2": 1554, "vpaddq~ymm1~ymm1~ymm10": 1555, "vpmuludq~ymm14~ymm12~ptr2": 1556, "vpaddq~ymm2~ymm2~ymm14": 1557, "vpmuludq~ymm11~ymm12~ptr2": 1558, "vpaddq~ymm3~ymm3~ymm11": 1559, "vpaddq~ymm4~ymm4~ymm10": 1560, "vpaddq~ymm5~ymm5~ymm14": 1561, "vpaddq~ymm6~ymm6~ymm11": 1562, "vpaddq~ymm7~ymm7~ymm10": 1563, "vpaddq~ymm8~ymm8~ymm14": 1564, "vpmuludq~ymm11~ymm13~ptr2": 1565, "vmovdqu~ymm14~ptr2": 1566, "vpaddq~ymm1~ymm1~ymm11": 1567, "vpmuludq~ymm10~ymm13~ptr2": 1568, "vmovdqu~ymm11~ptr2": 1569, "vpaddq~ymm2~ymm2~ymm10": 1570, "vpmuludq~ymm14~ymm14~ymm13": 1571, "vmovdqu~ymm10~ptr2": 1572, "vpmuludq~ymm11~ymm11~ymm13": 1573, "vpaddq~ymm4~ymm4~ymm11": 1574, "vpmuludq~ymm10~ymm10~ymm13": 1575, "vpaddq~ymm5~ymm5~ymm10": 1576, "vmovdqu~ymm9~ptr2": 1577, "vmovd~reg16~reg4": 1578, "vpaddq~ymm7~ymm7~ymm11": 1579, "vpbroadcastq~ymm0~reg16": 1580, "vpmuludq~ymm9~ymm9~ymm13": 1581, "vmovdqu~ymm13~ptr2": 1582, "vpmuludq~ymm14~ymm14~ymm12": 1583, "vpmuludq~ymm13~ymm13~ymm0": 1584, "vpmuludq~ymm11~ymm11~ymm12": 1585, "vpaddq~ymm13~ymm13~ymm1": 1586, "vpmuludq~ymm10~ymm10~ymm12": 1587, "vmovdqu~ptr2~ymm13": 1588, "vpaddq~ymm3~ymm3~ymm10": 1589, "vpaddq~ymm5~ymm5~ymm11": 1590, "vpaddq~ymm6~ymm6~ymm10": 1591, "vpaddq~ymm8~ymm8~ymm11": 1592, "vpaddq~ymm9~ymm9~ymm10": 1593, "vpmuludq~ymm14~ymm0~ptr2": 1594, "vpaddq~ymm1~ymm2~ymm14": 1595, "vpmuludq~ymm11~ymm11~ymm0": 1596, "vpaddq~ymm2~ymm3~ymm11": 1597, "vpmuludq~ymm10~ymm10~ymm0": 1598, "vpaddq~ymm3~ymm4~ymm10": 1599, "vpmuludq~ymm14~ymm14~ymm0": 1600, "vpaddq~ymm4~ymm5~ymm14": 1601, "vpaddq~ymm5~ymm6~ymm11": 1602, "vpaddq~ymm6~ymm7~ymm10": 1603, "add~reg8~ptr8": 1604, "vpaddq~ymm7~ymm8~ymm14": 1605, "vpaddq~ymm8~ymm9~ymm11": 1606, "vmovq~xmm9~reg8": 1607, "vpaddq~ymm0~ymm13~ymm9": 1608, "vpsrlq~ymm14~ymm0~imm": 1609, "vpand~ymm0~ymm0~ymm15": 1610, "vpsrlq~ymm12~ymm2~imm": 1611, "vpand~ymm2~ymm2~ymm15": 1612, "vpsrlq~ymm13~ymm3~imm": 1613, "vpand~ymm3~ymm3~ymm15": 1614, "vpermq~ymm12~ymm12~imm": 1615, "vpermq~ymm13~ymm13~imm": 1616, "vpaddq~ymm0~ymm0~ymm10": 1617, "vpblendd~ymm11~ymm12~ymm11": 1618, "vpblendd~ymm12~ymm13~ymm12": 1619, "vpblendd~ymm13~ymm9~ymm13": 1620, "vpsrlq~ymm14~ymm4~imm": 1621, "vpand~ymm4~ymm4~ymm15": 1622, "vpsrlq~ymm11~ymm5~imm": 1623, "vpand~ymm5~ymm5~ymm15": 1624, "vpsrlq~ymm12~ymm6~imm": 1625, "vpand~ymm6~ymm6~ymm15": 1626, "vpsrlq~ymm13~ymm7~imm": 1627, "vpand~ymm7~ymm7~ymm15": 1628, "vpsrlq~ymm0~ymm8~imm": 1629, "vpermq~ymm0~ymm0~imm": 1630, "vpblendd~ymm13~ymm0~ymm13": 1631, "vpaddq~ymm7~ymm7~ymm12": 1632, "cmovne~reg8~reg8": 1633, "vpxor~ymm0~ymm0~ymm0": 1634, "vpxor~ymm1~ymm1~ymm1": 1635, "vpxor~ymm2~ymm2~ymm2": 1636, "vpxor~ymm3~ymm3~ymm3": 1637, "vpxor~ymm4~ymm4~ymm4": 1638, "vpxor~ymm5~ymm5~ymm5": 1639, "vpxor~ymm6~ymm6~ymm6": 1640, "vpxor~ymm7~ymm7~ymm7": 1641, "vmovdqa~ymm8~ymm0": 1642, "vpsrlq~ymm9~ymm3~imm": 1643, "vmovd~xmm11~reg4": 1644, "vpaddq~ymm1~ymm1~ymm0": 1645, "vpbroadcastq~ymm11~xmm11": 1646, "vpaddq~ymm3~ymm3~ymm13": 1647, "vpaddq~ymm6~ymm6~ymm13": 1648, "vpermq~ymm9~ymm9~imm": 1649, "vpaddq~ymm7~ymm7~ymm0": 1650, "vmovq~reg8~xmm10": 1651, "vpaddq~ymm2~ymm2~ymm0": 1652, "vpaddq~ymm5~ymm5~ymm0": 1653, "vpblendd~ymm12~ymm9~ymm14": 1654, "vpaddq~ymm8~ymm8~ymm0": 1655, "vmovdqu~ymm12~ptr2": 1656, "vpblendd~ymm9~ymm9~ymm14": 1657, "vpaddq~ymm4~ymm4~ymm9": 1658, "vpmuludq~ymm12~ymm12~ymm10": 1659, "vpaddq~ymm1~ymm1~ymm12": 1660, "vpmuludq~ymm13~ymm13~ymm10": 1661, "vpaddq~ymm2~ymm2~ymm13": 1662, "vpmuludq~ymm0~ymm0~ymm10": 1663, "vpaddq~ymm4~ymm4~ymm12": 1664, "vpaddq~ymm5~ymm5~ymm13": 1665, "vpaddq~ymm6~ymm6~ymm0": 1666, "vpmuludq~ymm9~ymm9~ymm10": 1667, "vpmuludq~ymm0~ymm0~ymm11": 1668, "vpmuludq~ymm12~ymm12~ymm11": 1669, "vpmuludq~ymm13~ymm13~ymm11": 1670, "vpaddq~ymm9~ymm9~ymm13": 1671, "vpaddq~ymm0~ymm1~ymm0": 1672, "vpaddq~ymm1~ymm2~ymm12": 1673, "vpaddq~ymm2~ymm3~ymm13": 1674, "vpaddq~ymm3~ymm4~ymm0": 1675, "vpaddq~ymm4~ymm5~ymm12": 1676, "vpaddq~ymm5~ymm6~ymm13": 1677, "vpaddq~ymm6~ymm7~ymm0": 1678, "vpaddq~ymm7~ymm8~ymm12": 1679, "vmovq~xmm12~reg8": 1680, "vpaddq~ymm8~ymm9~ymm13": 1681, "vpaddq~ymm0~ymm12~ptr2": 1682, "vpsrlq~ymm12~ymm0~imm": 1683, "vpsrlq~ymm13~ymm1~imm": 1684, "vpsrlq~ymm10~ymm2~imm": 1685, "vpsrlq~ymm11~ymm3~imm": 1686, "vpblendd~ymm9~ymm12~ymm14": 1687, "vpermq~ymm10~ymm10~imm": 1688, "vpaddq~ymm0~ymm0~ymm9": 1689, "vpblendd~ymm13~ymm10~ymm13": 1690, "vpblendd~ymm10~ymm11~ymm10": 1691, "vpblendd~ymm11~ymm14~ymm11": 1692, "vpsrlq~ymm12~ymm4~imm": 1693, "vpsrlq~ymm13~ymm5~imm": 1694, "vpsrlq~ymm10~ymm6~imm": 1695, "vpsrlq~ymm11~ymm7~imm": 1696, "vpblendd~ymm11~ymm0~ymm11": 1697, "shrd~reg8~reg8~imm": 1698, "vpermd~ymm0~ymm5~ymm0": 1699, "vmovdqa~ymm0~ptr2": 1700, "vmovdqa~ymm1~ptr2": 1701, "vmovdqa~ymm5~ptr2": 1702, "vpbroadcastd~ymm4~reg16": 1703, "vpaddd~ymm2~ymm0~ymm5": 1704, "vpcmpeqd~ymm0~ymm0~ymm4": 1705, "vpaddd~ymm3~ymm1~ymm5": 1706, "vpcmpeqd~ymm1~ymm1~ymm4": 1707, "vmovdqa~ptr2~ymm0": 1708, "vpaddd~ymm0~ymm2~ymm5": 1709, "vpcmpeqd~ymm2~ymm2~ymm4": 1710, "vpaddd~ymm1~ymm3~ymm5": 1711, "vpcmpeqd~ymm3~ymm3~ymm4": 1712, "vpaddd~ymm8~ymm2~ymm5": 1713, "vpaddd~ymm9~ymm3~ymm5": 1714, "vpaddd~ymm10~ymm8~ymm5": 1715, "vpcmpeqd~ymm8~ymm8~ymm4": 1716, "vpaddd~ymm11~ymm9~ymm5": 1717, "vpcmpeqd~ymm9~ymm9~ymm4": 1718, "vpaddd~ymm12~ymm10~ymm5": 1719, "vpcmpeqd~ymm10~ymm10~ymm4": 1720, "vpaddd~ymm13~ymm11~ymm5": 1721, "vpcmpeqd~ymm11~ymm11~ymm4": 1722, "vpaddd~ymm14~ymm12~ymm5": 1723, "vpcmpeqd~ymm12~ymm12~ymm4": 1724, "vpaddd~ymm15~ymm13~ymm5": 1725, "vpcmpeqd~ymm13~ymm13~ymm4": 1726, "vpcmpeqd~ymm14~ymm14~ymm4": 1727, "vpcmpeqd~ymm15~ymm15~ymm4": 1728, "vmovdqa~ymm2~ptr2": 1729, "vmovdqa~ymm3~ptr2": 1730, "vpand~ymm0~ymm0~ptr2": 1731, 