{"": 0, "endbr64": 1, "sub~reg8~imm": 2, "mov~reg8~ptr8": 3, "test~reg8~reg8": 4, "jne": 5, "stp~reg8~reg8~ptr": 6, "adrp~reg8~imm": 7, "mov~reg8~sp": 8, "ldr~reg8~ptr": 9, "cbnz~reg8": 10, "movabs~reg8~imm": 11, "and~reg8~ptr8": 12, "cmp~reg8~reg8": 13, "lea~reg8~ptr": 14, "cmove~reg8~reg8": 15, "ret": 16, "movz~reg8~imm": 17, "jmp": 18, "hint~imm": 19, "mov~reg8~reg8": 20, "ldp~reg8~reg8~ptr": 21, "b": 22, "test~ptr1~imm": 23, "cmovne~reg8~reg8": 24, "str~reg8~ptr": 25, "bl": 26, "add~reg8~reg8~reg8": 27, "ldrb~reg4~ptr": 28, "cmp~reg4~imm": 29, "csel~reg8~reg8~xzr": 30, "push~reg8": 31, "mul~reg8": 32, "seto~reg1": 33, "js": 34, "umulh~reg8~reg8~reg8": 35, "mul~reg8~reg8~reg8": 36, "cmp~reg8~imm": 37, "cset~reg8~ne": 38, "tbnz~reg8": 39, "pop~reg8": 40, "call": 41, "mov~reg4~imm": 42, "movz~reg4~imm": 43, "adrp~reg8": 44, "add~reg8~reg8": 45, "movk~reg4~lsl #16~imm": 46, "je": 47, "cbz~reg8": 48, "xor~reg8~ptr8": 49, "rol~reg8~imm": 50, "mov~ptr8~reg8": 51, "eor~reg8~reg8~reg8": 52, "ror~reg8~imm": 53, "call~reg8": 54, "nop~ptr2": 55, "blr~reg8": 56, "cmp~ptr8~reg8": 57, "add~reg8~reg8~imm": 58, "mrs~reg8~tpidr_el0": 59, "sub~reg8~reg8~imm": 60, "b.eq": 61, "mov~ptr4~imm": 62, "add~reg8~sp~imm": 63, "str~reg4~ptr": 64, "mov~reg4~ptr4": 65, "ldr~reg4~ptr": 66, "b.ne": 67, "cmp~ptr4~imm": 68, "mov~ptr8~imm": 69, "dec~reg8": 70, "subs~reg8~reg8~imm": 71, "xor~reg4~reg4": 72, "str~wzr~ptr": 73, "hlt": 74, "brk~imm": 75, "mov~reg4~reg4": 76, "mov~ptr4~reg4": 77, "add~reg8~imm": 78, "and~reg4~imm": 79, "and~reg4~reg4~imm": 80, "tbnz~reg4": 81, "icall~ptr8": 82, "test~reg4~reg4": 83, "cbnz~reg4": 84, "shl~reg8~imm": 85, "add~reg8~reg8~reg4": 86, "lock dec~ptr4": 87, "sete~reg1": 88, "test~reg1~reg1": 89, "cmp~reg4~lsl #12~imm": 90, "jbe": 91, "sub~sp~sp~imm": 92, "cmp~reg8~lsl #12~imm": 93, "ccmp~reg4~hi~imm": 94, "cmp~ptr1~imm": 95, "movsx~reg8~ptr1": 96, "cbz~reg4": 97, "lea~reg4~ptr": 98, "ja": 99, "sub~reg4~reg4~imm": 100, "b.ls": 101, "movn~reg8~imm": 102, "mov~reg8~imm": 103, "mov~sp~reg8": 104, "sub~reg8~ptr8": 105, "add~ptr8~reg8": 106, "sub~reg8~reg8~reg8": 107, "mov~ptr1~imm": 108, "and~reg8~imm": 109, "sub~reg8~reg8": 110, "and~reg8~reg8~imm": 111, "sub~reg8~sp~reg8": 112, "cmp~sp~reg8": 113, "lsl~reg8~reg8~imm": 114, "str~reg8~ptr~imm": 115, "imul~reg4~ptr4~imm": 116, "movsxd~reg8~reg4": 117, "stur~reg4~ptr": 118, "lsl~reg4~reg4~imm": 119, "sub~reg4~reg4~reg4": 120, "sxtw~reg8~reg4": 121, "stur~reg8~ptr": 122, "or~reg4~imm": 123, "orr~reg4~reg4~imm": 124, "cmove~reg4~reg4": 125, "csel~reg4~reg4~reg4": 126, "ldur~reg8~ptr": 127, "cmn~reg8~imm": 128, "cmp~ptr8~imm": 129, "push~imm": 130, "movzx~reg4~reg1": 131, "add~reg4~imm": 132, "cset~reg4~eq": 133, "add~reg4~reg4~imm": 134, "nop": 135, "jae": 136, "str~wzr~ptr~imm": 137, "b.hs": 138, "nop~ptr4": 139, "ldr~reg8~ptr~imm": 140, "ldur~reg4~ptr": 141, "tbz~reg4": 142, "sub~ptr4~imm": 143, "str~xzr~ptr": 144, "csel~reg8~reg8~reg8": 145, "stp~xzr~xzr~ptr": 146, "stp~xzr~reg8~ptr": 147, "cmp~reg4~ptr4": 148, "jg": 149, "cmp~reg4~reg4": 150, "b.gt": 151, "cmp~ptr4~reg4": 152, "jl": 153, "b.lt": 154, "stp~reg4~reg4~ptr": 155, "add~reg4~ptr4": 156, "ldp~reg4~reg4~ptr": 157, "add~reg4~reg4~reg4": 158, "cmovl~reg8~reg8": 159, "cmp~reg8~ptr8": 160, "jb": 161, "b.lo": 162, "ldurb~reg4~ptr": 163, "strb~reg4~ptr~imm": 164, "strb~wzr~ptr~imm": 165, "sbfiz~reg8~reg8~imm": 166, "cmovns~reg8~reg8": 167, "jge": 168, "b.ge": 169, "ubfiz~reg8~reg8~imm": 170, "ldrh~reg4~ptr": 171, "mov~ptr1~reg1": 172, "movzx~reg4~ptr1": 173, "sturb~reg4~ptr": 174, "strb~wzr~ptr": 175, "ccmp~reg8~reg8~gt": 176, "csinc~reg4~reg4~wzr": 177, "cmp~reg1~imm": 178, "jle": 179, "setne~reg1": 180, "or~reg1~imm": 181, "test~reg1~imm": 182, "movsx~reg4~ptr1": 183, "ldrsb~reg4~ptr": 184, "strb~reg4~ptr": 185, "and~ptr4~imm": 186, "or~reg4~reg4": 187, "orr~reg4~reg4~reg4": 188, "b.hi": 189, "add~reg8~ptr8": 190, "shr~reg8~imm": 191, "lsr~reg8~reg8~imm": 192, "movsxd~reg8~ptr4": 193, "sub~reg4~reg4": 194, "div~ptr4": 195, "udiv~reg4~reg4~reg4": 196, "msub~reg4~reg4~reg4": 197, "add~ptr8~imm": 198, "movzx~reg4~ptr2": 199, "div~reg4": 200, "test~reg2~reg2": 201, "movzx~reg4~reg2": 202, "cmn~reg4~imm": 203, "movn~reg4~imm": 204, "sub~reg4~ptr4": 205, "imul~reg8~reg8~imm": 206, "umull~reg8~reg4~reg4": 207, "stur~xzr~ptr": 208, "b.le": 209, "sub~reg4~imm": 210, "cmovs~reg4~reg4": 211, "csel~reg4~reg4~wzr": 212, "add~ptr4~imm": 213, "push~ptr8": 214, "cmp~reg8~reg4~uxtw": 215, "cmp~reg8~reg8~lsl #2": 216, "tst~reg8~imm": 217, "movz~reg4~lsl #16~imm": 218, "tst~reg4~reg4": 219, "jns": 220, "rol~reg4~imm": 221, "add~reg4~reg4": 222, "ldrb~reg4~ptr~imm": 223, "ror~reg4~reg4~imm": 224, "test~reg4~imm": 225, "movdqa~reg16~ptr2": 226, "movups~ptr2~reg16": 227, "movdqu~reg16~ptr2": 228, "movaps~ptr2~reg16": 229, "bt~reg4~reg4": 230, "asr~reg4~reg4~reg4": 231, "csinv~reg8~reg8~xzr": 232, "shr~reg4~reg1": 233, "lsr~reg4~reg4~reg4": 234, "and~reg4~ptr4": 235, "and~reg4~reg4~reg4": 236, "neg~reg4": 237, "and~reg4~reg4": 238, "neg~reg4~reg4": 239, "xchg~ptr8~reg8": 240, "str~reg4~ptr~imm": 241, "and~reg2~imm": 242, "cset~reg8~eq": 243, "bswap~reg4": 244, "cmovne~reg4~reg4": 245, "rev~reg4~reg4": 246, "cmova~reg4~reg4": 247, "imul~reg4~reg4~imm": 248, "tst~reg4~imm": 249, "mov~ptr2~reg2": 250, "strh~reg4~ptr": 251, "repe cmpsb~ptr1~ptr1": 252, "seta~reg1": 253, "sbb~reg1~imm": 254, "ccmp~reg8~ne~imm": 255, "ccmp~reg4~ne~imm": 256, "asr~reg4~reg4~imm": 257, "subs~reg8~reg8~reg8": 258, "cset~reg4~ne": 259, "sub~sp~reg8~imm": 260, "add~sp~sp~imm": 261, "cmovb~reg8~reg8": 262, "mvn~reg8~reg8": 263, "adds~reg8~reg8~reg8": 264, "movsx~reg8~reg1": 265, "adc~reg4~imm": 266, "cdqe": 267, "cmp~reg1~ptr1": 268, "cmovle~reg8~reg8": 269, "movsx~reg4~reg1": 270, "b.ls~imm": 271, "or~reg8~imm": 272, "bfxil~reg8~reg8~imm": 273, "shr~reg4~imm": 274, "rep movsq~ptr8~ptr8": 275, "imul~reg4~reg4": 276, "div~reg8": 277, "mul~reg4~reg4~reg4": 278, "udiv~reg8~reg8~reg8": 279, "msub~reg8~reg8~reg8": 280, "ccmp~reg8~eq~imm": 281, "imul~reg8~reg8": 282, "ccmp~reg4~reg4~ne": 283, "fld~ptr2": 284, "fmul~ptr4": 285, "fstp~ptr2": 286, "movsx~reg4~reg2": 287, "orr~reg8~reg8~imm": 288, "fmov~d0~reg8": 289, "fmov~ptr~reg8": 290, "movq~reg8~reg16": 291, "and~reg8~reg8": 292, "fmov~reg8~d0": 293, "movz~reg8~lsl #48~imm": 294, "mulsd~reg16~ptr8": 295, "movsd~ptr8~reg16": 296, "fmov~d0~imm": 297, "fmul~d0~d1~d0": 298, "str~d0~ptr": 299, "shr~reg8~reg1": 300, "movn~reg8~lsl #48~imm": 301, "lsr~reg8~reg8~reg8": 302, "tst~reg8~reg8": 303, "movq~reg16~reg8": 304, "str~d1~ptr": 305, "not~reg8": 306, "subsd~reg16~reg16": 307, "bic~reg8~reg8~reg8": 308, "fmov~d2~reg8": 309, "fsub~d0~d0~d2": 310, "andpd~reg16~ptr2": 311, "movsd~reg16~ptr8": 312, "orpd~reg16~ptr2": 313, "mulsd~reg16~reg16": 314, "ldr~d1~ptr": 315, "bsl~v0.8b~v2.8b~v1.8b": 316, "fmul~d0~d0~d1": 317, "or~reg8~reg8": 318, "orr~reg8~reg8~reg8": 319, "sar~reg8~imm": 320, "fmul~d2~d2~d0": 321, "fmov~reg8~d2": 322, "ubfx~reg8~reg8~imm": 323, "movd~reg4~reg16": 324, "fmov~reg4~s0": 325, "lsr~reg4~reg4~imm": 326, "mulss~reg16~ptr4": 327, "movss~ptr4~reg16": 328, "fmov~s0~imm": 329, "fmul~s0~s1~s0": 330, "str~s0~ptr": 331, "sar~reg4~reg1": 332, "movn~reg4~lsl #16~imm": 333, "movd~reg16~reg4": 334, "fmov~s0~reg4": 335, "str~s1~ptr": 336, "not~reg4": 337, "subss~reg16~reg16": 338, "movaps~reg16~reg16": 339, "bic~reg4~reg4~reg4": 340, "fmov~s2~reg4": 341, "fsub~s0~s0~s2": 342, "andps~reg16~ptr2": 343, "orps~reg16~ptr2": 344, "movi~v0.2s~lsl #24~imm": 345, "fmov~s1~reg4": 346, "fmul~s0~s0~s1": 347, "shl~reg4~imm": 348, "sar~reg4~imm": 349, "fmul~s2~s2~s0": 350, "fmov~reg4~s2": 351, "neg~reg8": 352, "btr~reg8~imm": 353, "str~q0~ptr": 354, "neg~reg8~reg8": 355, "pand~reg16~ptr2": 356, "por~reg16~reg16": 357, "str~q1~ptr": 358, "ldr~q0~ptr": 359, "sar~reg8~reg1": 360, "asr~reg8~reg8~reg8": 361, "and~reg8~reg8~reg8": 362, "ldr~q1~ptr": 363, "fmov~reg8~ptr": 364, "br~reg8": 365, "str~xzr~ptr~imm": 366, "ccmn~reg8~ls~imm": 367, "ands~reg4~reg4~imm": 368, "shl~reg8~reg1": 369, "lsl~reg8~reg8~reg8": 370, "pcmpeqd~reg16~reg16": 371, "orr~reg8~xzr~imm": 372, "ccmp~reg8~ls~imm": 373, "or~ptr8~reg8": 374, "rol~reg8~reg1": 375, "and~ptr8~reg8": 376, "test~ptr8~reg8": 377, "or~reg8~ptr8": 378, "rep stosq~ptr8~reg8": 379, "syscall": 380, "svc~imm": 381, "cmn~reg8~lsl #12~imm": 382, "madd~reg8~reg8~reg8": 383, "stp~reg8~xzr~ptr": 384, "cmovs~reg8~reg8": 385, "imul~reg8~ptr8": 386, "ldr~reg4~ptr~imm": 387, "movsq~ptr8~ptr8": 388, "asr~reg8~reg8~imm": 389, "dmb~ish": 390, "cmp~reg2~ptr2": 391, "cdq": 392, "idiv~reg4": 393, "sdiv~reg4~reg4~reg4": 394, "bfi~reg8~reg8~imm": 395, "cqo": 396, "idiv~reg8": 397, "sdiv~reg8~reg8~reg8": 398, "csinv~reg4~reg4~wzr": 399, "smull~reg8~reg4~reg4": 400, "madd~reg4~reg4~reg4": 401, "cmovns~reg4~reg4": 402, "subs~reg4~reg4~imm": 403, "b.pl": 404, "ldr~d0~ptr": 405, "shr~reg2~imm": 406, "subsd~reg16~ptr8": 407, "fmov~d1~reg8": 408, "fsub~d0~d1~d0": 409, "ldursw~reg8~ptr": 410, "cmp~ptr2~imm": 411, "movk~reg8~lsl #16~imm": 412, "movk~reg8~lsl #32~imm": 413, "ldrsw~reg8~ptr": 414, "cmovge~reg8~reg8": 415, "add~reg8~reg8~lsl #12": 416, "csinc~reg8~reg8~reg8": 417, "shl~reg4~reg1": 418, "lsl~reg4~reg4~reg4": 419, "mvn~reg4~reg4": 420, "add~ptr4~reg4": 421, "seta~ptr1": 422, "cset~reg4~mi": 423, "xorpd~reg16~ptr2": 424, "fneg~d0~d0": 425, "sbb~reg4~imm": 426, "cinc~reg4~reg4~ne": 427, "stp~reg4~wzr~ptr": 428, "cmovne~reg8~ptr8": 429, "movi~v1.2d~imm": 430, "str~q2~ptr": 431, "ccmp~reg4~eq~imm": 432, "csinc~reg8~xzr~reg8": 433, "cinc~reg8~reg8~eq": 434, "ccmp~reg8~reg8~ne": 435, "sbb~reg4~reg4": 436, "cneg~reg4~reg4~hi": 437, "b.mi": 438, "adc~reg8~imm": 439, "cinc~reg8~reg8~hs": 440, "sbb~reg8~imm": 441, "sbc~reg8~reg8~xzr": 442, "sbb~reg8~reg8": 443, "sbc~reg8~reg8~reg8": 444, "setb~reg1": 445, "leave": 446, "bts~reg8~imm": 447, "bsr~reg8~reg8": 448, "xor~reg8~imm": 449, "clz~reg8~reg8": 450, "pextrw~reg4~reg16~imm": 451, "test~reg2~imm": 452, "cmp~ptr1~reg1": 453, "movsb~ptr1~ptr1": 454, "shr~reg1~imm": 455, "xor~reg4~imm": 456, "eor~reg8~reg8~imm": 457, "ubfx~reg4~reg4~imm": 458, "cneg~reg4~reg4~lt": 459, "adds~reg4~reg4~reg4": 460, "negs~reg4~reg4": 461, "csneg~reg4~reg4~reg4": 462, "bsr~reg8~ptr8": 463, "tzcnt~reg8~reg8": 464, "rbit~reg8~reg8": 465, "eor~reg4~reg4~imm": 466, "and~reg1~reg1": 467, "neg~reg8~reg8~lsl #2": 468, "cmp~reg4~reg4~lsl #1": 469, "neg~reg8~reg8~asr #2": 470, "or~ptr4~reg4": 471, "subs~reg4~reg4~reg4": 472, "sub~reg8~reg8~reg4": 473, "sub~ptr8~reg8": 474, "tzcnt~reg8~ptr8": 475, "cmovle~reg4~ptr4": 476, "cmp~reg8~reg4~sxtw": 477, "movk~reg8~imm": 478, "fmov~reg8~d8": 479, "ldr~d8~ptr": 480, "or~ptr2~reg2": 481, "cmp~reg2~imm": 482, "bfi~reg4~reg4~imm": 483, "ubfiz~reg4~reg4~imm": 484, "or~ptr4~imm": 485, "or~ptr8~imm": 486, "sub~sp~sp~reg8": 487, "add~sp~sp~reg8": 488, "cmovbe~reg8~reg8": 489, "csetm~reg4~eq": 490, "csetm~reg4~ne": 491, "cmp~reg1~reg1": 492, "cmp~reg4~reg4~uxtb": 493, "cmove~reg8~ptr8": 494, "test~ptr4~imm": 495, "cmovle~reg4~reg4": 496, "cmovg~reg4~reg4": 497, "stur~wzr~ptr": 498, "repne scasb~reg1~ptr1": 499, "sub~reg8~reg8~lsl #12": 500, "rep movsb~ptr1~ptr1": 501, "sturb~wzr~ptr": 502, "shl~ptr8~imm": 503, "sub~ptr8~imm": 504, "ccmp~reg4~reg4~eq": 505, "csinv~reg8~reg8~reg8": 506, "jmp~reg8": 507, "and~reg1~ptr1": 508, "or~reg1~reg1": 509, "ccmp~reg4~ls~imm": 510, "bics~wzr~reg4~reg4": 511, "cmovae~reg8~reg8": 512, "cinc~reg8~reg8~ne": 513, "and~reg1~imm": 514, "sub~ptr4~reg4": 515, "cmp~reg8~reg8~asr #2": 516, "ccmn~reg4~ne~imm": 517, "cmova~reg8~reg8": 518, "cset~reg4~gt": 519, "mneg~reg8~reg8~reg8": 520, "cmp~reg8~reg8~lsr #1": 521, "cmovg~reg8~reg8": 522, "adds~reg8~reg8~imm": 523, "csneg~reg8~reg8~reg8": 524, "cmp~reg8~reg8~lsl #1": 525, "setg~reg1": 526, "cmp~xzr~reg8~asr #5": 527, "pxor~reg16~reg16": 528, "ccmp~reg4~ge~imm": 529, "eor~reg4~reg4~reg4": 530, "test~reg8~imm": 531, "movz~reg8~lsl #16~imm": 532, "lock xadd~ptr8~reg8": 533, "ldaxr~reg8~ptr": 534, "stxr~reg4~xzr~ptr": 535, "ands~reg8~reg8~imm": 536, "ands~reg8~reg8~reg8": 537, "cmp~reg4~reg4~lsr #4": 538, "setae~reg1": 539, "ccmp~reg8~reg8~eq": 540, "setne~ptr1": 541, "ccmp~reg8~reg8~hi": 542, "ccmp~reg8~hi~imm": 543, "csel~reg8~xzr~reg8": 544, "not~ptr1": 545, "xor~reg8~reg8": 546, "and~ptr1~imm": 547, "or~ptr1~imm": 548, "cmovge~reg8~ptr8": 549, "cmp~xzr~reg8~lsr #32": 550, "jo": 551, "cset~reg4~lo": 552, "cset~reg4~ls": 553, "setbe~reg1": 554, "cinc~reg4~reg4~eq": 555, "cmovbe~reg4~reg4": 556, "cmovb~reg8~ptr8": 557, "bsf~reg8~reg8": 558, "xor~ptr1~imm": 559, "ccmp~reg4~reg4~hs": 560, "or~ptr1~reg1": 561, "pmovmskb~reg4~reg16": 562, "bsr~reg4~reg4": 563, "pcmpeqb~reg16~reg16": 564, "ccmn~reg4~ls~imm": 565, "adds~reg4~reg4~imm": 566, "cset~reg4~vs": 567, "cmp~xzr~reg8~asr #2": 568, "sub~reg2~imm": 569, "add~reg4~reg4~lsl #12": 570, "cneg~reg4~reg4~ls": 571, "setl~reg1": 572, "csetm~reg4~lo": 573, "imul~reg8": 574, "movk~reg8~lsl #48~imm": 575, "smulh~reg8~reg8~reg8": 576, "imul~reg8~ptr8~imm": 577, "fild~ptr8": 578, "fsubp~st(1)": 579, "fstp~ptr8": 580, "mov~v1.16b~v0.16b": 581, "ldr~q2~ptr": 582, "mov~v0.16b~v2.16b": 583, "ror~reg8~reg8~imm": 584, "setle~reg1": 585, "cset~reg8~le": 586, "b.vs": 587, "smaddl~reg8~reg4~reg4": 588, "ldpsw~reg8~reg8~ptr": 589, "cneg~reg4~reg4~eq": 590, "strh~wzr~ptr": 591, "ccmp~reg8~reg8~ls": 592, "setge~reg1": 593, "cset~reg4~ge": 594, "cset~reg4~lt": 595, "test~ptr4~reg4": 596, "cmp~reg8~reg8~lsr #20": 597, "tbz~reg8": 598, "cset~reg4~le": 599, "imul~reg4~ptr4": 600, "cmove~reg4~ptr4": 601, "cneg~reg8~reg8~eq": 602, "cmn~reg4~lsl #12~imm": 603, "csneg~reg4~wzr~reg4": 604, "umaddl~reg8~reg4~reg4": 605, "cmovae~reg8~ptr8": 606, "cmovg~reg8~ptr8": 607, "cmovg~reg4~ptr4": 608, "cmovge~reg4~reg4": 609, "ccmn~reg8~ne~imm": 610, "cinc~reg8~reg8~lo": 611, "cmovns~reg8~ptr8": 612, "sub~reg4~reg4~lsl #12": 613, "cneg~reg8~reg8~ne": 614, "cset~reg4~hi": 615, "ccmn~reg4~hi~imm": 616, "sbfx~reg8~reg8~imm": 617, "and~ptr2~reg2": 618, "cmovb~reg4~reg4": 619, "orr~reg4~wzr~imm": 620, "or~reg2~ptr2": 621, "bt~reg8~reg8": 622, "bfxil~reg4~reg4~imm": 623, "sub~sp~sp~lsl #12": 624, "ccmp~reg4~gt~imm": 625, "ccmp~reg4~reg4~pl": 626, "test~ptr8~imm": 627, "sturh~wzr~ptr": 628, "cmovl~reg4~reg4": 629, "cmp~reg8~reg4~uxtb": 630, "movz~reg8~lsl #32~imm": 631, "csel~reg4~wzr~reg4": 632, "ccmp~reg4~reg4~ge": 633, "and~ptr1~reg1": 634, "stp~wzr~reg4~ptr": 635, "ccmp~reg4~le~imm": 636, "ccmp~reg4~reg4~gt": 637, "ccmn~reg4~eq~imm": 638, "sete~ptr1": 639, "stp~wzr~wzr~ptr": 640, "neg~ptr4": 641, "ldrsh~reg4~ptr": 642, "sxth~reg4~reg4": 643, "xor~reg1~reg1": 644, "sbc~reg4~reg4~wzr": 645, "or~ptr2~imm": 646, "cmn~reg8~reg8": 647, "ccmp~reg8~ge~imm": 648, "cmovns~reg4~ptr4": 649, "ldar~reg8~ptr": 650, "strh~reg4~ptr~imm": 651, "movapd~reg16~reg16": 652, "cmpltsd~reg16~reg16": 653, "andpd~reg16~reg16": 654, "andnpd~reg16~reg16": 655, "orpd~reg16~reg16": 656, "comisd~reg16~reg16": 657, "fcmpe~d0~imm": 658, "fneg~d2~d0": 659, "fcsel~d2~d2~d0": 660, "fcmpe~d2~d1": 661, "fld~st(1)": 662, "fabs": 663, "fxch~st(1)": 664, "fucomip~st(1)": 665, "fstp~st(0)": 666, "fldz": 667, "fchs": 668, "fcomi~st(2)": 669, "fcmovbe~st(0)~st(2)": 670, "fcomi~st(1)": 671, "and~ptr8~imm": 672, "cinc~reg4~reg4~lo": 673, "add~ptr2~imm": 674, "or~reg4~ptr4": 675, "cmp~wzr~reg4~asr #24": 676, "cmp~reg8~reg4~sxtw #2": 677, "rev16~reg4~reg4": 678, "add~reg8~sp~reg8": 679, "cmovbe~reg4~ptr4": 680, "cmp~wzr~reg4~lsr #2": 681, "lock add~ptr4~imm": 682, "cmovne~reg4~ptr4": 683, "rol~reg2~imm": 684, "and~ptr4~reg4": 685, "stlr~reg4~ptr": 686, "cmp~ptr2~reg2": 687, "ccmp~reg8~reg8~lo": 688, "ccmp~reg8~reg8~hs": 689, "movsx~reg4~ptr2": 690, "add~reg2~imm": 691, "jmp~ptr8": 692, "cmovge~reg4~ptr4": 693, "ccmp~reg8~reg8~ge": 694, "cld": 695, "div~ptr8": 696, "cmp~reg2~reg2": 697, "xchg~ptr4~reg4": 698, "or~reg1~ptr1": 699}