{"": 0, "xor~reg4~ptr4": 1, "mov~reg4~ptr4": 2, "sub~reg4~imm": 3, "jmp": 4, "movzx~reg4~reg1": 5, "shr~reg4~imm": 6, "lea~reg8~ptr": 7, "xor~reg4~reg4": 8, "jne": 9, "movzx~reg4~ptr1": 10, "and~reg4~imm": 11, "ret": 12, "shl~reg4~imm": 13, "mov~reg4~reg4": 14, "cmp~reg8~ptr8": 15, "je": 16, "mov~reg4~imm": 17, "and~reg4~reg4": 18, "lea~reg4~ptr": 19, "sub~reg4~reg4": 20, "rol~reg4~imm": 21, "ror~reg4~imm": 22, "cmp~reg4~imm": 23, "mov~reg8~reg8": 24, "test~reg8~imm": 25, "sub~reg8~reg8": 26, "and~reg8~imm": 27, "add~reg8~imm": 28, "nop~ptr4": 29, "cmp~reg8~reg8": 30, "mov~reg8~ptr8": 31, "mov~ptr8~reg8": 32, "call": 33, "mov~ptr4~reg4": 34, "sub~reg8~imm": 35, "nop": 36, "shr~reg8~imm": 37, "add~reg8~reg8": 38, "push~reg8": 39, "leave": 40, "pop~reg8": 41, "cmp~ptr8~imm": 42, "cmp~ptr4~imm": 43, "mov~ptr8~imm": 44, "jbe": 45, "xor~reg8~reg8": 46, "add~ptr8~imm": 47, "sub~ptr8~imm": 48, "add~ptr8~reg8": 49, "ja": 50, "mov~ptr1~reg1": 51, "dec~reg4": 52, "bt~reg8~imm": 53, "jb": 54, "or~reg4~reg4": 55, "cmp~reg8~imm": 56, "test~reg4~imm": 57, "aesenc~reg16~reg16": 58, "movups~reg16~ptr2": 59, "aesenclast~reg16~reg16": 60, "pxor~reg16~reg16": 61, "movups~ptr2~reg16": 62, "endbr64": 63, "xorps~reg16~reg16": 64, "aesdec~reg16~reg16": 65, "aesdeclast~reg16~reg16": 66, "neg~reg8": 67, "pxor~xmm8~reg16": 68, "pxor~xmm9~reg16": 69, "aesenc~xmm8~reg16": 70, "aesenc~xmm9~reg16": 71, "aesenclast~xmm8~reg16": 72, "aesenclast~xmm9~reg16": 73, "movdqu~reg16~ptr2": 74, "movups~ptr2~xmm8": 75, "movdqu~xmm8~ptr2": 76, "movups~ptr2~xmm9": 77, "movdqu~xmm9~ptr2": 78, "xorps~xmm9~xmm9": 79, "movdqa~xmm9~ptr2": 80, "movdqa~reg16~ptr2": 81, "movdqa~reg16~reg16": 82, "pshufb~reg16~reg16": 83, "paddq~reg16~xmm9": 84, "dec~reg8": 85, "xorps~xmm8~reg16": 86, "movaps~ptr2~reg16": 87, "pxor~xmm8~xmm8": 88, "pxor~xmm9~xmm9": 89, "pxor~xmm10~xmm10": 90, "pxor~xmm11~xmm11": 91, "pxor~xmm12~xmm12": 92, "pxor~xmm13~xmm13": 93, "pxor~xmm14~xmm14": 94, "pxor~xmm15~xmm15": 95, "movups~xmm11~ptr2": 96, "xorps~reg16~xmm11": 97, "pxor~xmm10~reg16": 98, "movdqa~xmm8~reg16": 99, "pxor~reg16~xmm10": 100, "pxor~reg16~xmm11": 101, "pxor~reg16~xmm12": 102, "pxor~reg16~xmm13": 103, "pxor~xmm8~xmm15": 104, "pxor~reg16~xmm14": 105, "pxor~reg16~xmm8": 106, "pxor~xmm10~xmm9": 107, "pxor~xmm11~xmm9": 108, "movdqa~ptr2~xmm10": 109, "pxor~xmm12~xmm9": 110, "pxor~xmm13~xmm9": 111, "movdqa~ptr2~xmm11": 112, "pxor~xmm14~xmm9": 113, "movdqa~ptr2~xmm12": 114, "pxor~xmm8~xmm9": 115, "movdqa~ptr2~xmm14": 116, "movdqa~ptr2~xmm8": 117, "pshufd~xmm9~xmm15~imm": 118, "xorps~reg16~xmm10": 119, "pxor~xmm12~reg16": 120, "bsf~reg8~reg8": 121, "shl~reg8~imm": 122, "xorps~reg16~xmm12": 123, "xorps~reg16~xmm13": 124, "movdqa~xmm10~xmm14": 125, "movdqa~xmm11~xmm15": 126, "movdqu~ptr2~reg16": 127, "movdqa~reg16~xmm10": 128, "movdqa~xmm15~reg16": 129, "movaps~xmm10~xmm11": 130, "aesdec~xmm8~reg16": 131, "aesdec~xmm9~reg16": 132, "aesimc~reg16~reg16": 133, "movq~reg16~ptr8": 134, "movaps~xmm11~reg16": 135, "movaps~xmm13~reg16": 136, "movaps~xmm10~xmm13": 137, "movdqa~xmm8~ptr2": 138, "pxor~xmm15~xmm8": 139, "pshufb~xmm15~reg16": 140, "movdqa~xmm9~reg16": 141, "psrlq~reg16~imm": 142, "movdqa~xmm10~reg16": 143, "pand~reg16~reg16": 144, "psllq~reg16~imm": 145, "pxor~reg16~xmm9": 146, "movdqa~xmm10~xmm15": 147, "psrlq~xmm15~imm": 148, "pxor~xmm15~reg16": 149, "pand~xmm15~reg16": 150, "pxor~reg16~xmm15": 151, "psllq~xmm15~imm": 152, "pxor~xmm15~xmm10": 153, "pand~reg16~xmm8": 154, "pand~xmm15~xmm8": 155, "movdqa~xmm12~reg16": 156, "movdqa~xmm11~reg16": 157, "movdqa~xmm13~xmm10": 158, "movdqa~reg16~xmm9": 159, "pxor~xmm11~xmm15": 160, "movdqa~xmm14~xmm10": 161, "por~xmm9~xmm8": 162, "por~xmm10~xmm11": 163, "pxor~xmm14~reg16": 164, "pand~xmm13~xmm11": 165, "pxor~xmm11~xmm8": 166, "pand~xmm14~xmm11": 167, "pand~xmm12~xmm11": 168, "pxor~xmm10~xmm12": 169, "pxor~xmm9~xmm12": 170, "pxor~xmm11~reg16": 171, "movdqa~xmm8~xmm12": 172, "por~xmm8~xmm11": 173, "pxor~xmm10~xmm14": 174, "pxor~xmm9~xmm13": 175, "pxor~xmm8~xmm14": 176, "pxor~xmm8~xmm13": 177, "movdqa~xmm13~reg16": 178, "pand~xmm11~reg16": 179, "movdqa~xmm14~reg16": 180, "pand~xmm12~xmm15": 181, "pand~xmm13~reg16": 182, "por~xmm14~reg16": 183, "pxor~xmm10~xmm11": 184, "movdqa~xmm11~xmm10": 185, "pand~xmm10~xmm8": 186, "movdqa~xmm14~xmm11": 187, "pxor~xmm13~xmm10": 188, "pand~xmm14~xmm13": 189, "movdqa~xmm12~xmm8": 190, "pand~xmm12~xmm10": 191, "movdqa~xmm9~xmm13": 192, "pxor~xmm8~xmm12": 193, "pand~xmm9~reg16": 194, "pand~xmm13~xmm14": 195, "pxor~xmm13~xmm11": 196, "movdqa~xmm9~xmm14": 197, "pand~reg16~xmm14": 198, "pand~reg16~xmm13": 199, "pxor~xmm14~xmm12": 200, "pxor~xmm13~xmm8": 201, "movdqa~xmm9~xmm12": 202, "pxor~xmm10~xmm13": 203, "pxor~xmm9~xmm8": 204, "pand~xmm10~xmm11": 205, "pand~xmm9~xmm15": 206, "pand~reg16~xmm12": 207, "pand~xmm11~xmm13": 208, "pxor~xmm11~xmm10": 209, "pxor~xmm15~xmm11": 210, "pand~xmm10~reg16": 211, "jl": 212, "pxor~xmm15~ptr2": 213, "pxor~reg16~ptr2": 214, "pshufd~reg16~xmm15~imm": 215, "pshufd~xmm8~reg16~imm": 216, "pshufd~xmm9~reg16~imm": 217, "pshufd~xmm10~reg16~imm": 218, "pshufd~xmm11~reg16~imm": 219, "pshufd~xmm12~reg16~imm": 220, "pshufd~xmm13~reg16~imm": 221, "pshufd~xmm14~reg16~imm": 222, "pshufd~xmm15~xmm15~imm": 223, "pshufd~reg16~reg16~imm": 224, "pxor~xmm13~reg16": 225, "movdqa~reg16~xmm8": 226, "pxor~xmm10~xmm15": 227, "pxor~xmm12~xmm15": 228, "movdqa~xmm12~xmm15": 229, "pand~xmm12~reg16": 230, "pxor~xmm15~xmm13": 231, "movdqa~reg16~xmm13": 232, "pcmpeqd~reg16~reg16": 233, "movdqa~ptr2~reg16": 234, "pand~xmm8~reg16": 235, "pcmpeqb~xmm8~reg16": 236, "pcmpeqb~xmm9~reg16": 237, "pcmpeqb~xmm10~reg16": 238, "pcmpeqb~xmm11~reg16": 239, "pcmpeqb~xmm12~reg16": 240, "movdqa~ptr2~xmm9": 241, "pcmpeqb~xmm13~reg16": 242, "pand~xmm14~reg16": 243, "pcmpeqb~xmm14~reg16": 244, "pcmpeqb~xmm15~reg16": 245, "movdqa~ptr2~xmm13": 246, "movdqa~ptr2~xmm15": 247, "movdqu~xmm12~ptr2": 248, "bswap~reg4": 249, "inc~reg4": 250, "pshufd~xmm13~xmm14~imm": 251, "paddq~reg16~reg16": 252, "pand~xmm13~xmm12": 253, "pcmpgtd~xmm14~reg16": 254, "movdqu~ptr2~xmm15": 255, "movdqu~xmm10~ptr2": 256, "add~ptr4~reg4": 257, "add~reg1~ptr1": 258, "add~reg1~imm": 259, "or~ptr1~reg1": 260, "ud2": 261, "mov~reg8~imm": 262, "pandn~reg16~reg16": 263, "psrld~reg16~imm": 264, "pand~reg16~xmm9": 265, "movdqa~reg16~xmm11": 266, "movdqa~reg16~xmm12": 267, "movdqa~reg16~xmm15": 268, "movdqa~reg16~xmm14": 269, "xor~reg8~imm": 270, "palignr~reg16~reg16~imm": 271, "test~reg8~reg8": 272, "movhlps~reg16~reg16": 273, "palignr~reg16~xmm8~imm": 274, "palignr~xmm8~xmm8~imm": 275, "pslldq~reg16~imm": 276, "add~reg4~imm": 277, "xor~reg4~imm": 278, "movaps~reg16~ptr2": 279, "movaps~xmm8~ptr2": 280, "movaps~xmm9~ptr2": 281, "movaps~xmm10~ptr2": 282, "movaps~xmm11~ptr2": 283, "movaps~xmm12~ptr2": 284, "movaps~xmm13~ptr2": 285, "movaps~xmm14~ptr2": 286, "movaps~xmm15~ptr2": 287, "cdqe": 288, "sub~ptr4~imm": 289, "test~reg4~reg4": 290, "cmovs~reg4~reg4": 291, "sar~reg4~imm": 292, "jle": 293, "mov~ptr4~imm": 294, "add~reg4~reg4": 295, "movsxd~reg8~reg4": 296, "test~reg1~reg1": 297, "shl~reg4~reg1": 298, "memcpy": 299, "jg": 300, "or~reg4~imm": 301, "or~reg8~reg8": 302, "cmp~ptr8~reg8": 303, "not~reg4": 304, "cmp~reg4~reg4": 305, "memset": 306, "and~reg4~ptr4": 307, "setne~reg1": 308, "js": 309, "call~reg8": 310, "xor~reg8~ptr8": 311, "sub~ptr8~reg8": 312, "sub~reg8~ptr8": 313, "jns": 314, "add~ptr4~imm": 315, "cmovbe~reg8~ptr8": 316, "push~imm": 317, "cmp~reg1~imm": 318, "cmp~reg4~ptr4": 319, "sub~ptr4~reg4": 320, "cmp~ptr4~reg4": 321, "neg~reg4": 322, "xor~reg1~ptr1": 323, "shr~ptr4~imm": 324, "mov~ptr1~imm": 325, "or~ptr4~reg4": 326, "shl~ptr8~imm": 327, "or~ptr8~reg8": 328, "shr~ptr8~imm": 329, "movabs~reg8~imm": 330, "or~reg1~imm": 331, "and~reg1~imm": 332, "cmp~ptr1~imm": 333, "movsx~reg4~reg1": 334, "imul~reg4": 335, "jge": 336, "or~reg8~imm": 337, "push~ptr8": 338, "fwrite": 339, "mov~ptr2~reg2": 340, "movzx~reg4~ptr2": 341, "and~reg2~ptr2": 342, "mov~ptr2~imm": 343, "or~reg2~ptr2": 344, "movzx~reg4~reg2": 345, "shr~reg1~imm": 346, "and~reg2~imm": 347, "sub~reg4~ptr4": 348, "or~reg8~ptr8": 349, "or~reg4~ptr4": 350, "or~ptr4~imm": 351, "strncmp": 352, "strcmp": 353, "strtoul": 354, "and~ptr8~reg8": 355, "and~ptr4~reg4": 356, "imul~reg4~reg4~imm": 357, "movsx~reg4~ptr1": 358, "cmp~ptr1~reg1": 359, "time": 360, "setg~reg1": 361, "__imp__strnicmp": 362, "rep stosq~ptr8~reg8": 363, "rep movsq~ptr8~ptr8": 364, "shl~ptr4~imm": 365, "sar~ptr4~imm": 366, "memcmp": 367, "strncpy": 368, "strrchr": 369, "setle~reg1": 370, "sete~reg1": 371, "mul~reg8": 372, "and~reg8~reg8": 373, "and~ptr1~imm": 374, "and~ptr4~imm": 375, "cmovle~reg4~reg4": 376, "qsort": 377, "jmp~reg8": 378, "mfence": 379, "not~reg8": 380, "__imp_DeleteFiber": 381, "__imp_CreateFiber": 382, "__imp_SwitchToFiber": 383, "memmove": 384, "cmp~reg2~imm": 385, "__imp_ntohs": 386, "strchr": 387, "__imp___iob_func": 388, "fputs": 389, "cmovle~reg4~ptr4": 390, "cdq": 391, "idiv~ptr4": 392, "imul~reg4~ptr4": 393, "jae": 394, "imul~reg8~reg8~imm": 395, "movsd~reg16~ptr8": 396, "movsd~ptr8~reg16": 397, "setb~reg1": 398, "neg~ptr4": 399, "div~reg8": 400, "cmovge~reg4~ptr4": 401, "ucomisd~reg16~ptr8": 402, "xorpd~reg16~reg16": 403, "mulsd~reg16~reg16": 404, "cvttsd2si~reg8~reg16": 405, "cvtsi2sd~reg16~ptr8": 406, "subsd~reg16~reg16": 407, "movapd~reg16~reg16": 408, "cvttsd2si~reg4~reg16": 409, "cvtsi2sd~reg16~ptr4": 410, "jp": 411, "movq~reg8~reg16": 412, "divsd~reg16~reg16": 413, "mul~reg4": 414, "setbe~reg1": 415, "__imp_getsockopt": 416, "__imp_WSAGetLastError": 417, "__imp_gethostbyname": 418, "__imp_ioctlsocket": 419, "repne scasb~reg1~ptr1": 420, "strcpy": 421, "strcat": 422, "__imp_setsockopt": 423, "__imp_getsockname": 424, "cld": 425, "shl~reg8~reg1": 426, "__imp_socket": 427, "__imp_connect": 428, "__imp_bind": 429, "__imp_closesocket": 430, "__imp_shutdown": 431, "__imp_WSASetLastError": 432, "__imp_recv": 433, "__imp_send": 434, "__imp_sendto": 435, "perror": 436, "__imp_GetSystemTime": 437, "__imp_SystemTimeToFileTime": 438, "__imp__close": 439, "__imp_SetLastError": 440, "__imp__read": 441, "__imp__write": 442, "__imp__lseek": 443, "__imp_GetLastError": 444, "__imp__errno": 445, "fclose": 446, "fread": 447, "ferror": 448, "fflush": 449, "ftell": 450, "fseek": 451, "feof": 452, "__imp__fileno": 453, "fgets": 454, "mul~ptr8": 455, "adc~reg8~imm": 456, "adc~reg8~reg8": 457, "sar~reg8~imm": 458, "and~reg8~ptr8": 459, "shr~reg8~reg1": 460, "neg~ptr8": 461, "shl~ptr4~reg1": 462, "shr~ptr8~reg1": 463, "sar~reg4~reg1": 464, "imul~reg8~reg8": 465, "imul~reg8~ptr8": 466, "div~ptr8": 467, "cmovge~reg4~reg4": 468, "xor~ptr8~reg8": 469, "imul~reg4~reg4": 470, "seta~reg1": 471, "sar~ptr8~imm": 472, "shl~ptr8~reg1": 473, "cmove~reg4~reg4": 474, "movq~reg16~reg8": 475, "mulx~reg8~reg8~reg8": 476, "mulx~reg8~reg8~ptr8": 477, "adcx~reg8~reg8": 478, "adox~reg8~reg8": 479, "add~reg8~ptr8": 480, "adc~reg8~ptr8": 481, "sbb~reg8~reg8": 482, "psrldq~reg16~imm": 483, "pclmulqdq~reg16~reg16~imm": 484, "cmovb~reg8~reg8": 485, "adc~reg4~imm": 486, "shr~reg4~reg1": 487, "xor~ptr4~reg4": 488, "vmovdqa~ptr2~xmm11": 489, "vmovdqa~ptr2~reg16": 490, "vmovdqa~ptr2~xmm14": 491, "vpxor~reg16~reg16~ptr2": 492, "vpxor~xmm13~xmm13~ptr2": 493, "vpxor~xmm15~xmm15~ptr2": 494, "vpxor~xmm10~xmm10~ptr2": 495, "vpxor~xmm9~xmm9~ptr2": 496, "vpxor~xmm11~xmm11~ptr2": 497, "vpxor~xmm14~xmm14~ptr2": 498, "vpxor~xmm8~xmm8~ptr2": 499, "vpxor~xmm12~xmm12~ptr2": 500, "vmovdqu~ptr2~reg16": 501, "vmovdqu~ptr2~xmm13": 502, "vmovdqu~ptr2~xmm15": 503, "vmovdqu~ptr2~xmm10": 504, "vmovdqu~ptr2~xmm9": 505, "vmovdqu~ptr2~xmm11": 506, "vmovdqu~ptr2~xmm14": 507, "vmovdqu~ptr2~xmm8": 508, "vmovdqu~ptr2~xmm12": 509, "vmovdqa~ptr2~xmm8": 510, "vmovdqa~ptr2~xmm12": 511, "vmovdqa~ptr2~ymm3": 512, "vmovdqa~ptr2~ymm7": 513, "vbroadcasti128~ymm0~cs:xmmword_135B40": 514, "vbroadcasti128~ymm1~ptr2": 515, "vbroadcasti128~ymm2~ptr2": 516, "vbroadcasti128~ymm3~ptr2": 517, "vmovdqa32~ymm16~ymm0": 518, "vmovdqa32~ymm17~ymm1": 519, "vmovdqa32~ymm18~ymm2": 520, "vpaddd~ymm3~ymm3~ptr2": 521, "vmovdqa32~ymm20~ptr2": 522, "vmovdqa32~ymm19~ymm3": 523, "vpaddd~zmm0~zmm0~zmm1": 524, "vpxord~zmm3~zmm3~zmm0": 525, "vprold~zmm3~zmm3~10h": 526, "vpaddd~zmm2~zmm2~zmm3": 527, "vpxord~zmm1~zmm1~zmm2": 528, "vprold~zmm1~zmm1~0Ch": 529, "vprold~zmm3~zmm3~imm": 530, "vprold~zmm1~zmm1~imm": 531, "vpshufd~zmm2~zmm2~imm": 532, "vpshufd~zmm1~zmm1~imm": 533, "vpshufd~zmm3~zmm3~imm": 534, "vpaddd~ymm0~ymm0~ymm4": 535, "vpaddd~ymm1~ymm1~ymm5": 536, "vpaddd~ymm2~ymm2~ymm6": 537, "vpaddd~ymm3~ymm3~ymm7": 538, "vpxor~ymm12~ymm12~ymm0": 539, "vpxor~ymm13~ymm13~ymm1": 540, "vpxor~ymm14~ymm14~ymm2": 541, "vpxor~ymm15~ymm15~ymm3": 542, "vprold~ymm12~ymm12~10h": 543, "vprold~ymm13~ymm13~10h": 544, "vprold~ymm14~ymm14~10h": 545, "vprold~ymm15~ymm15~10h": 546, "vpaddd~ymm8~ymm8~ymm12": 547, "vpaddd~ymm9~ymm9~ymm13": 548, "vpaddd~ymm10~ymm10~ymm14": 549, "vpaddd~ymm11~ymm11~ymm15": 550, "vpxor~ymm4~ymm4~ymm8": 551, "vpxor~ymm5~ymm5~ymm9": 552, "vpxor~ymm6~ymm6~ymm10": 553, "vpxor~ymm7~ymm7~ymm11": 554, "vprold~ymm4~ymm4~0Ch": 555, "vprold~ymm5~ymm5~0Ch": 556, "vprold~ymm6~ymm6~0Ch": 557, "vprold~ymm7~ymm7~0Ch": 558, "vprold~ymm12~ymm12~imm": 559, "vprold~ymm13~ymm13~imm": 560, "vprold~ymm14~ymm14~imm": 561, "vprold~ymm15~ymm15~imm": 562, "vprold~ymm4~ymm4~imm": 563, "vprold~ymm5~ymm5~imm": 564, "vprold~ymm6~ymm6~imm": 565, "vprold~ymm7~ymm7~imm": 566, "vpaddd~ymm0~ymm0~ymm5": 567, "vpaddd~ymm1~ymm1~ymm6": 568, "vpaddd~ymm2~ymm2~ymm7": 569, "vpaddd~ymm3~ymm3~ymm4": 570, "vpxor~ymm15~ymm15~ymm0": 571, "vpxor~ymm12~ymm12~ymm1": 572, "vpxor~ymm13~ymm13~ymm2": 573, "vpxor~ymm14~ymm14~ymm3": 574, "vpaddd~ymm10~ymm10~ymm15": 575, "vpaddd~ymm11~ymm11~ymm12": 576, "vpaddd~ymm8~ymm8~ymm13": 577, "vpaddd~ymm9~ymm9~ymm14": 578, "vpxor~ymm5~ymm5~ymm10": 579, "vpxor~ymm6~ymm6~ymm11": 580, "vpxor~ymm7~ymm7~ymm8": 581, "vpxor~ymm4~ymm4~ymm9": 582, "vpxor~ymm5~ymm5~ptr2": 583, "vpxor~ymm13~ymm13~ptr2": 584, "vmovdqu~ptr2~ymm5": 585, "vmovdqu~ptr2~ymm13": 586, "vpbroadcastd~ymm2~ptr4": 587, "vpbroadcastd~ymm3~ptr4": 588, "vpaddd~ymm28~ymm28~ptr2": 589, "vmovdqa64~ymm4~ymm20": 590, "vmovdqa64~ymm5~ymm21": 591, "vmovdqa64~ymm6~ymm22": 592, "vmovdqa64~ymm7~ymm23": 593, "vmovdqa64~ymm8~ymm24": 594, "vmovdqa64~ymm9~ymm25": 595, "vmovdqa64~ymm10~ymm26": 596, "vmovdqa64~ymm11~ymm27": 597, "vmovdqa64~ymm12~ymm28": 598, "vmovdqa64~ymm13~ymm29": 599, "vmovdqa64~ymm14~ymm30": 600, "vmovdqa64~ymm15~ymm31": 601, "vmovdqa64~ymm16~ymm0": 602, "vmovdqa64~ymm17~ymm1": 603, "vmovdqa64~ymm18~ymm2": 604, "vmovdqa64~ymm19~ymm3": 605, "strtol": 606, "__imp__stricmp": 607, "test~reg2~reg2": 608, "imul~reg8": 609, "malloc": 610, "strdup": 611, "free": 612, "__imp__strdup": 613, "strlen": 614, "movsxd~reg8~ptr4": 615, "shl~ptr1~imm": 616, "and~reg1~ptr1": 617, "shr~ptr1~imm": 618, "xor~ptr1~reg1": 619, "and~ptr1~reg1": 620, "mov~reg2~imm": 621, "atoi": 622, "adc~ptr8~reg8": 623, "sbb~ptr8~reg8": 624, "shrd~reg8~reg8~imm": 625, "div~reg4": 626, "div~ptr4": 627, "tzcnt~reg4~reg4": 628, "cmp~reg1~reg1": 629, "sar~ptr1~imm": 630, "sar~reg1~imm": 631, "not~ptr8": 632, "lock xadd~ptr4~reg4": 633, "fprintf": 634, "strstr": 635, "add~ptr1~imm": 636, "cmp~ptr2~imm": 637, "sub~ptr2~imm": 638, "shr~reg2~imm": 639, "sub~ptr2~reg2": 640, "bswap~reg8": 641, "cmovbe~reg4~ptr4": 642, "cmovns~reg4~ptr4": 643, "cmovns~reg8~ptr8": 644, "memchr": 645, "getenv": 646, "cqo": 647, "idiv~ptr8": 648, "lock add~ptr8~imm": 649, "lock add~ptr4~imm": 650, "movsx~reg8~reg1": 651, "rol~ptr4~reg1": 652, "cmp~reg1~ptr1": 653, "raise": 654, "_exit": 655, "__imp_GetEnvironmentVariableW": 656, "_onexit": 657, "__imp_GetModuleHandleExW": 658, "realloc": 659, "__imp_VirtualProtect": 660, "xor~ptr8~imm": 661, "cmovae~reg8~ptr8": 662, "__imp_MultiByteToWideChar": 663, "gmtime": 664, "cmovs~reg8~reg8": 665, "or~ptr8~imm": 666, "cvtsi2sd~reg16~reg4": 667, "ucomisd~reg16~reg16": 668, "cvtsi2sd~reg16~reg8": 669, "addsd~reg16~reg16": 670, "or~reg1~ptr1": 671, "bt~reg4~imm": 672, "movd~reg4~reg16": 673, "cpuid": 674, "vmovdqu~reg16~ptr2": 675, "vpxor~reg16~reg16~reg16": 676, "vmovdqu~xmm15~ptr2": 677, "vpaddb~xmm10~reg16~reg16": 678, "vpaddb~xmm11~xmm10~reg16": 679, "vpaddb~xmm12~xmm11~reg16": 680, "vpaddb~xmm13~xmm12~reg16": 681, "vpaddb~xmm14~xmm13~reg16": 682, "vpxor~xmm9~reg16~xmm15": 683, "vpaddb~reg16~xmm14~reg16": 684, "vpxor~xmm10~xmm10~xmm15": 685, "vpxor~xmm11~xmm11~xmm15": 686, "vpshufb~reg16~reg16~reg16": 687, "vpaddd~xmm10~reg16~ptr2": 688, "vpaddd~xmm11~reg16~reg16": 689, "vpaddd~xmm12~xmm10~reg16": 690, "vpshufb~xmm10~xmm10~reg16": 691, "vpaddd~xmm13~xmm11~reg16": 692, "vpshufb~xmm11~xmm11~reg16": 693, "vpaddd~xmm14~xmm12~reg16": 694, "vpshufb~xmm12~xmm12~reg16": 695, "vpaddd~reg16~xmm13~reg16": 696, "vpshufb~xmm13~xmm13~reg16": 697, "vpshufb~xmm14~xmm14~reg16": 698, "vpclmulqdq~reg16~reg16~reg16": 699, "vpxor~xmm12~xmm12~xmm15": 700, "vmovups~reg16~ptr2": 701, "vaesenc~xmm9~xmm9~reg16": 702, "vpxor~xmm13~xmm13~xmm15": 703, "vaesenc~xmm10~xmm10~reg16": 704, "vpxor~xmm14~xmm14~xmm15": 705, "setae~reg1": 706, "vaesenc~xmm11~xmm11~reg16": 707, "vaesenc~xmm12~xmm12~reg16": 708, "vpxor~xmm8~xmm8~reg16": 709, "vaesenc~xmm13~xmm13~reg16": 710, "vmovups~xmm15~ptr2": 711, "vaesenc~xmm14~xmm14~reg16": 712, "vaesenc~xmm9~xmm9~xmm15": 713, "vaesenc~xmm10~xmm10~xmm15": 714, "movbe~reg8~ptr8": 715, "vaesenc~xmm11~xmm11~xmm15": 716, "vaesenc~xmm12~xmm12~xmm15": 717, "vaesenc~xmm13~xmm13~xmm15": 718, "vaesenc~xmm14~xmm14~xmm15": 719, "vpclmulqdq~reg16~xmm8~reg16": 720, "vpclmulqdq~xmm8~xmm8~reg16": 721, "vpslldq~reg16~reg16~imm": 722, "vpxor~reg16~reg16~xmm8": 723, "vpalignr~reg16~reg16~reg16": 724, "vpsrldq~reg16~reg16~imm": 725, "vpalignr~xmm8~reg16~reg16": 726, "vaesenclast~xmm9~xmm9~reg16": 727, "vaesenclast~xmm10~xmm10~reg16": 728, "vpaddb~reg16~reg16~reg16": 729, "vaesenclast~xmm11~xmm11~reg16": 730, "vaesenclast~xmm12~xmm12~reg16": 731, "vaesenclast~xmm13~xmm13~reg16": 732, "vaesenclast~xmm14~xmm14~reg16": 733, "vmovups~ptr2~xmm9": 734, "vmovups~ptr2~xmm10": 735, "vmovdqa~xmm10~reg16": 736, "vmovups~ptr2~xmm11": 737, "vmovdqa~xmm11~reg16": 738, "vmovups~ptr2~xmm12": 739, "vmovdqa~xmm12~reg16": 740, "vmovups~ptr2~xmm13": 741, "vmovdqa~xmm13~reg16": 742, "vmovups~ptr2~xmm14": 743, "vmovdqa~xmm14~reg16": 744, "cmp~reg4": 745, "movaps~ptr2~xmm8": 746, "movaps~ptr2~xmm9": 747, "movaps~ptr2~xmm10": 748, "movaps~ptr2~xmm11": 749, "movaps~ptr2~xmm12": 750, "movaps~ptr2~xmm13": 751, "movaps~ptr2~xmm14": 752, "movaps~ptr2~xmm15": 753, "movdqa~xmm10~ptr2": 754, "pshufb~reg16~xmm10": 755, "vpunpckhqdq~xmm8~xmm15~xmm15": 756, "vpclmulqdq~reg16~xmm15~reg16": 757, "vpxor~xmm8~xmm8~xmm15": 758, "vmovdqu~xmm14~ptr2": 759, "vpshufb~xmm15~xmm14~xmm13": 760, "and~ptr8~imm": 761, "strspn": 762, "strcspn": 763, "xor~ptr4~imm": 764, "vmovd~reg16~ptr4": 765, "setbuf": 766, "clearerr": 767, "__imp__chmod": 768, "inc~reg1": 769, "add~reg1~reg1": 770, "cmove~reg8~reg8": 771, "mov~reg1~ptr1": 772, "cmp~reg2~ptr2": 773, "setl~reg1": 774, "rol~reg8~imm": 775, "xchg~reg8~reg8": 776, "punpckldq~reg16~reg16": 777, "punpcklqdq~reg16~reg16": 778, "punpckhqdq~xmm8~reg16": 779, "pshufd~xmm8~xmm8~imm": 780, "movd~reg16~ptr4": 781, "shrd~reg4~reg4~imm": 782, "add~reg4~ptr4": 783, "vpaddd~xmm9~xmm11~reg16": 784, "shld~reg4~reg4~imm": 785, "vpsrldq~xmm8~reg16~imm": 786, "vmovdqa~ptr2~xmm9": 787, "vpsrld~xmm8~reg16~imm": 788, "vpslldq~xmm10~reg16~imm": 789, "vpaddd~reg16~reg16~reg16": 790, "vpsrld~xmm9~xmm10~imm": 791, "vpor~reg16~reg16~xmm8": 792, "vpslld~xmm10~xmm10~imm": 793, "vpxor~reg16~reg16~xmm9": 794, "vpxor~reg16~reg16~xmm10": 795, "vmovdqa~xmm11~ptr2": 796, "vpslld~reg16~reg16~imm": 797, "pshufd~xmm12~xmm12~imm": 798, "pshufd~xmm13~xmm13~imm": 799, "pshufd~xmm14~xmm14~imm": 800, "punpckldq~xmm12~xmm14": 801, "punpckhdq~reg16~xmm14": 802, "punpckldq~xmm13~xmm15": 803, "punpckhdq~reg16~xmm15": 804, "movq~ptr8~xmm12": 805, "psrldq~xmm12~imm": 806, "movq~ptr8~reg16": 807, "movq~ptr8~xmm13": 808, "psrldq~xmm13~imm": 809, "movq~xmm12~ptr8": 810, "movq~xmm13~ptr8": 811, "movq~xmm8~ptr8": 812, "movq~xmm9~ptr8": 813, "movq~xmm10~ptr8": 814, "movq~xmm11~ptr8": 815, "punpckldq~xmm12~reg16": 816, "punpckldq~xmm13~reg16": 817, "punpckldq~xmm8~xmm9": 818, "punpckldq~xmm10~xmm11": 819, "movdqa~xmm14~xmm12": 820, "movdqa~xmm15~xmm13": 821, "punpcklqdq~xmm12~xmm8": 822, "punpcklqdq~xmm13~xmm10": 823, "punpckhqdq~xmm14~xmm8": 824, "punpckhqdq~xmm15~xmm10": 825, "xor~reg1~imm": 826, "rol~ptr8~imm": 827, "rol~reg4~reg1": 828, "fputc": 829, "fopen": 830, "signal": 831, "sscanf": 832, "setge~reg1": 833, "cmovg~reg4~reg4": 834, "ror~reg8~reg1": 835, "ror~reg4~reg1": 836, "__imp_tolower": 837, "add~ptr2~reg2": 838, "shr~ptr2~imm": 839}