{"": 0, "push~reg8": 1, "mov~reg8~reg8": 2, "sub~reg8~imm": 3, "mov~reg8~ptr8": 4, "mov~ptr8~reg8": 5, "xor~reg4~reg4": 6, "test~reg8~reg8": 7, "jne": 8, "mov~reg4~imm": 9, "call": 10, "lea~reg8~ptr": 11, "call~reg8": 12, "movsd~reg16~ptr8": 13, "mulsd~reg16~reg16": 14, "cvttsd2si~reg8~reg16": 15, "jmp": 16, "__imp___iob_func": 17, "add~reg8~imm": 18, "fwrite": 19, "exit": 20, "mov~ptr4~reg4": 21, "mov~reg4~ptr4": 22, "sar~reg4~imm": 23, "mov~reg4~reg4": 24, "xor~reg4~ptr4": 25, "sub~reg4~reg4": 26, "mov~ptr4~imm": 27, "movsxd~reg8~reg4": 28, "add~reg8~reg8": 29, "movzx~reg4~ptr1": 30, "movsx~reg4~reg1": 31, "and~reg4~imm": 32, "cmp~reg4~imm": 33, "je": 34, "add~ptr4~imm": 35, "cmp~reg4~ptr4": 36, "jl": 37, "cmp~ptr4~imm": 38, "jns": 39, "nop": 40, "leave": 41, "ret": 42, "pop~reg8": 43, "sub~reg4~ptr4": 44, "cmp~reg1~imm": 45, "movzx~reg4~reg1": 46, "movzx~reg4~ptr2": 47, "movzx~reg4~reg2": 48, "test~reg4~reg4": 49, "sub~reg4~imm": 50, "jbe": 51, "add~ptr8~imm": 52, "cmp~ptr8~imm": 53, "test~reg1~reg1": 54, "sete~reg1": 55, "sub~reg8~reg8": 56, "rep stosq~ptr8~reg8": 57, "mov~ptr8~imm": 58, "fopen": 59, "add~reg4~imm": 60, "cmp~ptr4~reg4": 61, "jge": 62, "add~reg4~reg4": 63, "cdqe": 64, "realloc": 65, "fgets": 66, "free": 67, "mov~ptr1~imm": 68, "sub~ptr4~imm": 69, "jle": 70, "mov~ptr1~reg1": 71, "cmp~ptr1~imm": 72, "shl~reg8~imm": 73, "movsx~reg8~reg1": 74, "imul~reg8~reg8": 75, "memset": 76, "lea~reg4~ptr": 77, "memcpy": 78, "cmp~ptr1~reg1": 79, "__imp_isalpha": 80, "movsx~reg4~ptr1": 81, "xor~reg8~ptr8": 82, "strncmp": 83, "xor~reg8~reg8": 84, "rol~reg8~imm": 85, "ror~reg8~imm": 86, "not~reg8": 87, "and~reg8~ptr8": 88, "jg": 89, "cmovs~reg4~reg4": 90, "shr~reg4~imm": 91, "cmp~reg4~reg4": 92, "jb": 93, "mov~reg8~imm": 94, "strlen": 95, "movq~reg8~reg16": 96, "shr~reg8~imm": 97, "push~imm": 98, "cmp~ptr8~reg8": 99, "fseek": 100, "ftell": 101, "rewind": 102, "fclose": 103, "fread": 104, "__imp__stat64": 105, "mov~ptr2~reg2": 106, "js": 107, "__imp__errno": 108, "cmp~reg8~ptr8": 109, "mov~ptr2~imm": 110, "sar~reg4~reg1": 111, "movsd~ptr8~reg16": 112, "setg~reg1": 113, "or~ptr4~imm": 114, "imul~reg4~reg4~imm": 115, "cvtsi2sd~reg16~reg4": 116, "subsd~reg16~reg16": 117, "movapd~reg16~reg16": 118, "sar~ptr8~imm": 119, "add~ptr8~reg8": 120, "cmp~reg8~reg8": 121, "cmp~reg8~imm": 122, "shl~reg8~reg1": 123, "or~ptr8~reg8": 124, "memcmp": 125, "memmove": 126, "and~reg8~imm": 127, "fprintf": 128, "ja": 129, "add~ptr4~reg4": 130, "shl~reg4~imm": 131, "sub~ptr4~reg4": 132, "neg~ptr4": 133, "cmp~reg1~reg1": 134, "imul~reg4~reg4": 135, "imul~reg4": 136, "or~reg8~reg8": 137, "pxor~reg16~reg16": 138, "ucomisd~reg16~reg16": 139, "movq~reg16~ptr8": 140, "xorpd~reg16~reg16": 141, "sar~reg8~imm": 142, "movabs~reg8~imm": 143, "and~reg8~reg8": 144, "shl~ptr8~imm": 145, "neg~ptr8": 146, "sub~ptr8~imm": 147, "sub~reg8~ptr8": 148, "sar~ptr8~reg1": 149, "setl~reg1": 150, "neg~reg8": 151, "cqo": 152, "idiv~reg8": 153, "shl~reg4~reg1": 154, "or~ptr4~reg4": 155, "not~reg4": 156, "and~reg4~ptr4": 157, "or~reg4~reg4": 158, "jmp~reg8": 159, "neg~reg4": 160, "or~reg4~imm": 161, "setne~reg1": 162, "imul~reg8~reg8~imm": 163, "divsd~reg16~reg16": 164, "setae~reg1": 165, "addsd~reg16~reg16": 166, "cvtsi2sd~reg16~ptr4": 167, "shr~reg2~imm": 168, "setle~reg1": 169, "cdq": 170, "idiv~reg4": 171, "fflush": 172, "getenv": 173, "system": 174, "__imp__unlink": 175, "fputc": 176, "strstr": 177, "fputs": 178, "__imp_isprint": 179, "__imp_isspace": 180, "atoi": 181, "cmp~reg1~ptr1": 182, "putc": 183, "malloc": 184, "strcmp": 185, "__imp__strdup": 186, "sscanf": 187, "and~reg4~reg4": 188, "cmovge~reg4~ptr4": 189, "imul~reg8~ptr8": 190, "or~reg4~ptr4": 191, "fgetc": 192, "idiv~ptr4": 193, "printf": 194, "puts": 195, "__imp__access": 196, "__imp__pclose": 197, "__imp__wunlink": 198, "or~reg1~imm": 199, "__imp__popen": 200, "strncpy": 201, "strchr": 202, "strtol": 203, "and~reg1~imm": 204, "and~ptr4~imm": 205, "setvbuf": 206, "__imp__isatty": 207, "getpid": 208, "__imp_SetConsoleCtrlHandler": 209, "idiv~ptr8": 210, "imul~reg4~ptr4": 211, "addsd~reg16~ptr8": 212, "divsd~reg16~ptr8": 213, "jae": 214, "ucomisd~reg16~ptr8": 215, "imul~reg8": 216, "cvttsd2si~reg4~reg16": 217, "localtime": 218, "cvtsi2sd~reg16~reg8": 219, "fld~ptr2": 220, "fnstcw~ptr2": 221, "fldcw~ptr2": 222, "fistp~ptr4": 223, "fild~ptr4": 224, "fstp~ptr2": 225, "fsubp~st(1)": 226, "fmulp~st(1)": 227, "mul~reg8": 228, "div~reg8": 229, "fld~ptr8": 230, "fldz": 231, "fucomip~st(1)": 232, "fstp~st(0)": 233, "fchs": 234, "fstp~ptr8": 235, "faddp~st(1)": 236, "fld1": 237, "fdivp~st(1)": 238, "cmovns~reg4~ptr4": 239, "add~ptr1~reg1": 240, "rep movsq~ptr8~ptr8": 241, "shr~reg1~imm": 242, "sar~ptr4~imm": 243, "xor~reg4~imm": 244, "cvtsi2sd~reg16~ptr8": 245, "fild~ptr8": 246, "cvtsi2ss~reg16~ptr8": 247, "movss~reg16~ptr4": 248, "mulss~reg16~reg16": 249, "cvtss2sd~reg16~reg16": 250, "shr~ptr8~imm": 251, "shl~ptr4~imm": 252, "shr~ptr4~imm": 253, "bswap~reg4": 254, "jno": 255, "cmp~reg2~ptr2": 256, "movsx~reg4~ptr2": 257, "bsr~reg8~ptr8": 258, "xor~reg8~imm": 259, "shr~ptr8~reg1": 260, "sub~reg2~imm": 261, "div~ptr4": 262, "div~reg4": 263, "mul~reg4": 264, "test~reg2~reg2": 265, "cwde": 266, "seta~reg1": 267, "cmp~reg2~imm": 268, "cmovbe~reg8~reg8": 269, "mov~reg1~imm": 270, "cmovbe~reg4~ptr4": 271, "push~ptr8": 272, "cmovle~reg4~ptr4": 273, "cmp~reg2~reg2": 274, "rol~reg2~imm": 275, "cmovle~reg4~reg4": 276, "cmovg~reg4~reg4": 277, "sub~reg2~ptr2": 278, "sub~reg1~ptr1": 279, "and~reg2~ptr2": 280, "cmp~ptr2~imm": 281, "cmovle~reg8~ptr8": 282, "or~reg2~imm": 283, "setp~reg1": 284, "cmovne~reg4~reg4": 285, "jp": 286, "and~reg2~imm": 287, "movsx~reg4~reg2": 288, "or~reg2~ptr2": 289, "or~reg8~imm": 290, "subsd~reg16~ptr8": 291, "mulsd~reg16~ptr8": 292, "or~reg8~ptr8": 293, "shr~reg8~reg1": 294, "cmovns~reg8~reg8": 295, "cmovl~reg8~reg8": 296, "cmovl~reg4~reg4": 297, "cmp~ptr2~reg2": 298, "movsx~reg8~reg2": 299, "div~ptr8": 300, "strrchr": 301, "movsx~reg8~ptr2": 302, "cmova~reg4~reg4": 303, "sub~ptr8~reg8": 304, "strcspn": 305, "sar~reg1~imm": 306, "or~ptr1~imm": 307, "xor~reg1~imm": 308, "and~ptr8~reg8": 309, "and~reg1~ptr1": 310, "xor~reg1~ptr1": 311, "movsx~reg8~ptr1": 312, "cmovs~reg8~reg8": 313, "xor~ptr4~imm": 314}