{"": 0, "sub~reg8~imm": 1, "mov~reg8~ptr8": 2, "test~reg8~reg8": 3, "je": 4, "call~reg8": 5, "__gmon_start__": 6, "add~reg8~imm": 7, "ret": 8, "push~ptr8": 9, "jmp~ptr8": 10, "getenv": 11, "raise": 12, "free": 13, "putchar": 14, "pthread_create": 15, "localtime": 16, "__errno_location": 17, "unlink": 18, "strncpy": 19, "strncmp": 20, "mkdir": 21, "puts": 22, "isatty": 23, "fread": 24, "readlink": 25, "getpid": 26, "__xstat64": 27, "opendir": 28, "getpwuid": 29, "strlen": 30, "chdir": 31, "pthread_mutexattr_destroy": 32, "__stack_chk_fail": 33, "getuid": 34, "system": 35, "strchr": 36, "printf": 37, "rewind": 38, "_IO_putc": 39, "pthread_mutex_destroy": 40, "symlink": 41, "pthread_mutexattr_init": 42, "strrchr": 43, "gettimeofday": 44, "__assert_fail": 45, "fputs": 46, "memset": 47, "fgetc": 48, "closedir": 49, "fputc": 50, "strcspn": 51, "memcmp": 52, "fgets": 53, "utimes": 54, "__fxstat64": 55, "strcmp": 56, "signal": 57, "fprintf": 58, "ftell": 59, "fopen64": 60, "strtol": 61, "memcpy": 62, "time": 63, "dlopen": 64, "tolower": 65, "pthread_mutex_unlock": 66, "pthread_mutexattr_settype": 67, "malloc": 68, "fflush": 69, "__isoc99_sscanf": 70, "fseek": 71, "dlclose": 72, "realloc": 73, "setvbuf": 74, "chmod": 75, "open64": 76, "memmove": 77, "readdir64": 78, "fsync": 79, "access": 80, "popen": 81, "getrusage": 82, "sysconf": 83, "pthread_join": 84, "atoi": 85, "__lxstat64": 86, "exit": 87, "fwrite": 88, "lseek64": 89, "strdup": 90, "sleep": 91, "pthread_mutex_init": 92, "strstr": 93, "pthread_mutex_lock": 94, "pthread_mutex_trylock": 95, "dlerror": 96, "__ctype_b_loc": 97, "__imp_fclose": 98, "__imp_pclose": 99, "__imp___cxa_finalize": 100, "xor~reg4~reg4": 101, "mov~reg8~reg8": 102, "pop~reg8": 103, "and~reg8~imm": 104, "push~reg8": 105, "lea~reg8~ptr": 106, "icall~ptr8": 107, "__libc_start_main": 108, "hlt": 109, "cmp~reg8~reg8": 110, "jmp~reg8": 111, "cmp~ptr1~imm": 112, "jne": 113, "cmp~ptr8~imm": 114, "call": 115, "mov~ptr1~imm": 116, "jmp": 117, "mov~ptr8~reg8": 118, "mov~reg4~imm": 119, "mov~reg4~ptr4": 120, "cmp~reg4~imm": 121, "jle": 122, "movsd~reg16~ptr8": 123, "mulsd~reg16~reg16": 124, "cvttsd2si~reg8~reg16": 125, "xor~reg8~ptr8": 126, "leave": 127, "test~reg4~reg4": 128, "nop": 129, "sub~reg8~reg8": 130, "cvtsi2sd~reg16~reg8": 131, "addsd~reg16~reg16": 132, "movsd~ptr8~reg16": 133, "movapd~reg16~reg16": 134, "mov~ptr4~reg4": 135, "sar~reg4~imm": 136, "mov~reg4~reg4": 137, "xor~reg4~ptr4": 138, "sub~reg4~reg4": 139, "mov~ptr4~imm": 140, "movsxd~reg8~reg4": 141, "add~reg8~reg8": 142, "movzx~reg4~ptr1": 143, "movsx~reg4~reg1": 144, "and~reg4~imm": 145, "add~ptr4~imm": 146, "cmp~reg4~ptr4": 147, "test~reg1~reg1": 148, "jl": 149, "cmp~ptr4~imm": 150, "jns": 151, "sub~reg4~ptr4": 152, "cmp~reg1~imm": 153, "add~ptr8~imm": 154, "movzx~reg4~reg1": 155, "movzx~reg4~ptr2": 156, "movzx~reg4~reg2": 157, "sete~reg1": 158, "rep stosq~ptr8~reg8": 159, "add~reg4~imm": 160, "cmp~ptr4~reg4": 161, "jge": 162, "add~reg4~reg4": 163, "cdqe": 164, "sub~ptr4~imm": 165, "mov~ptr1~reg1": 166, "jg": 167, "movsx~reg4~ptr1": 168, "sub~reg4~imm": 169, "mov~ptr8~imm": 170, "shl~reg8~imm": 171, "movsx~reg8~reg1": 172, "imul~reg8~reg8": 173, "neg~reg8": 174, "cmp~ptr1~reg1": 175, "cmp~reg4~reg4": 176, "lea~reg4~ptr": 177, "xor~reg8~reg8": 178, "rol~reg8~imm": 179, "ror~reg8~imm": 180, "not~reg8": 181, "and~reg8~ptr8": 182, "cmovs~reg4~reg4": 183, "shr~reg4~imm": 184, "jb": 185, "ja": 186, "mov~reg8~imm": 187, "movaps~ptr2~reg16": 188, "shr~reg8~imm": 189, "movq~reg8~reg16": 190, "push~imm": 191, "cmp~ptr8~reg8": 192, "cmp~reg8~ptr8": 193, "js": 194, "sar~reg4~reg1": 195, "shl~ptr8~imm": 196, "setg~reg1": 197, "or~ptr4~imm": 198, "imul~reg4~reg4~imm": 199, "cvtsi2sd~reg16~reg4": 200, "subsd~reg16~reg16": 201, "sar~ptr8~imm": 202, "add~ptr8~reg8": 203, "cmp~reg8~imm": 204, "shl~reg8~reg1": 205, "or~ptr8~reg8": 206, "add~ptr4~reg4": 207, "jbe": 208, "shl~reg4~imm": 209, "neg~ptr4": 210, "sub~ptr4~reg4": 211, "cmp~reg1~reg1": 212, "imul~reg4~reg4": 213, "imul~reg4": 214, "or~reg8~reg8": 215, "pxor~reg16~reg16": 216, "ucomisd~reg16~reg16": 217, "movq~reg16~ptr8": 218, "xorpd~reg16~reg16": 219, "sar~reg8~imm": 220, "movabs~reg8~imm": 221, "and~reg8~reg8": 222, "neg~ptr8": 223, "sub~ptr8~imm": 224, "sub~reg8~ptr8": 225, "sar~ptr8~reg1": 226, "setl~reg1": 227, "cqo": 228, "idiv~reg8": 229, "shl~reg4~reg1": 230, "or~ptr4~reg4": 231, "not~reg4": 232, "and~reg4~ptr4": 233, "mov~ptr2~reg2": 234, "or~reg4~reg4": 235, "neg~reg4": 236, "or~reg4~imm": 237, "setne~reg1": 238, "imul~reg8~reg8~imm": 239, "divsd~reg16~reg16": 240, "jp": 241, "setae~reg1": 242, "shr~reg2~imm": 243, "setle~reg1": 244, "cvtsi2sd~reg16~ptr4": 245, "cdq": 246, "idiv~reg4": 247, "mov~ptr2~imm": 248, "cmp~reg1~ptr1": 249, "imul~reg8~ptr8": 250, "and~reg4~reg4": 251, "cmovge~reg4~ptr4": 252, "or~reg4~ptr4": 253, "idiv~ptr4": 254, "or~reg1~imm": 255, "and~reg1~imm": 256, "and~ptr4~imm": 257, "idiv~ptr8": 258, "imul~reg4~ptr4": 259, "divsd~reg16~ptr8": 260, "addsd~reg16~ptr8": 261, "jae": 262, "ucomisd~reg16~ptr8": 263, "imul~reg8": 264, "cvttsd2si~reg4~reg16": 265, "mfence": 266, "fld~ptr2": 267, "fnstcw~ptr2": 268, "fldcw~ptr2": 269, "fistp~ptr4": 270, "fild~ptr4": 271, "fstp~ptr2": 272, "fsubp~st(1)": 273, "fmulp~st(1)": 274, "mul~reg8": 275, "div~reg8": 276, "fld~ptr8": 277, "fldz": 278, "fucomip~st(1)": 279, "fstp~st(0)": 280, "fchs": 281, "fstp~ptr8": 282, "faddp~st(1)": 283, "fld1": 284, "fdivp~st(1)": 285, "cmovns~reg4~ptr4": 286, "add~ptr1~reg1": 287, "rep movsq~ptr8~ptr8": 288, "shr~reg1~imm": 289, "sar~ptr4~imm": 290, "xor~reg4~imm": 291, "cvtsi2sd~reg16~ptr8": 292, "fild~ptr8": 293, "cvtsi2ss~reg16~ptr8": 294, "movss~reg16~ptr4": 295, "mulss~reg16~reg16": 296, "cvtss2sd~reg16~reg16": 297, "shr~ptr8~imm": 298, "shl~ptr4~imm": 299, "shr~ptr4~imm": 300, "bswap~reg4": 301, "jno": 302, "cmp~reg2~ptr2": 303, "movsx~reg4~ptr2": 304, "bsr~reg8~ptr8": 305, "xor~reg8~imm": 306, "shr~ptr8~reg1": 307, "sub~reg2~imm": 308, "div~ptr4": 309, "div~reg4": 310, "geteuid": 311, "fchown": 312, "close": 313, "fchmod": 314, "ftruncate64": 315, "fcntl": 316, "cmp~reg2~imm": 317, "rmdir": 318, "read": 319, "write": 320, "munmap": 321, "mmap64": 322, "and~reg2~ptr2": 323, "test~reg2~reg2": 324, "or~reg2~ptr2": 325, "mremap": 326, "getcwd": 327, "mul~reg4": 328, "cwde": 329, "movsx~reg4~reg2": 330, "seta~reg1": 331, "cmovbe~reg8~reg8": 332, "mov~reg1~imm": 333, "cmovbe~reg4~ptr4": 334, "cmovle~reg4~ptr4": 335, "cmp~reg2~reg2": 336, "rol~reg2~imm": 337, "cmovle~reg4~reg4": 338, "cmp~ptr2~imm": 339, "sub~reg2~ptr2": 340, "sub~reg1~ptr1": 341, "setge~reg1": 342, "cmovle~reg8~ptr8": 343, "or~reg2~imm": 344, "setp~reg1": 345, "cmovne~reg4~reg4": 346, "and~reg2~imm": 347, "or~ptr2~imm": 348, "shr~reg4~reg1": 349, "add~ptr2~imm": 350, "cmp~ptr2~reg2": 351, "subsd~reg16~ptr8": 352, "mulsd~reg16~ptr8": 353, "or~reg8~ptr8": 354, "shr~reg8~reg1": 355, "cmovns~reg8~reg8": 356, "or~reg8~imm": 357, "cmovl~reg8~reg8": 358, "cmovl~reg4~reg4": 359, "cmovg~reg4~reg4": 360, "movsx~reg8~reg2": 361, "cbw": 362, "and~ptr1~imm": 363, "div~ptr8": 364, "movsx~reg8~ptr2": 365, "cmova~reg4~reg4": 366, "or~ptr1~imm": 367, "sub~ptr8~reg8": 368, "sar~reg1~imm": 369, "and~ptr8~imm": 370, "xor~reg1~imm": 371, "and~ptr8~reg8": 372, "and~reg1~ptr1": 373, "xor~reg1~ptr1": 374, "movsx~reg8~ptr1": 375, "and~ptr2~imm": 376, "cmovs~reg8~reg8": 377, "xor~ptr4~imm": 378, "nop~ptr4": 379, "__set_app_type": 380, "movsxd~reg8~ptr4": 381, "__getmainargs": 382, "__imp_Sleep": 383, "lock cmpxchg~ptr8~reg8": 384, "__imp_SetUnhandledExceptionFilter": 385, "cmove~reg4~reg4": 386, "test~ptr1~imm": 387, "cmovne~reg2~ptr2": 388, "_cexit": 389, "_amsg_exit": 390, "_initterm": 391, "xchg~ptr8~reg8": 392, "__imp_GetStartupInfoA": 393, "__imp__fileno": 394, "__imp__setmode": 395, "__imp_GetCurrentProcess": 396, "__imp_LoadLibraryA": 397, "__imp_GetProcAddress": 398, "__imp_FreeLibrary": 399, "__imp___iob_func": 400, "vfprintf": 401, "fopen": 402, "fclose": 403, "__imp_isalpha": 404, "__imp_isalnum": 405, "__imp_SystemTimeToFileTime": 406, "__imp_FindFirstFileW": 407, "__imp_FindClose": 408, "__imp__stat64": 409, "__imp__mkdir": 410, "__imp__errno": 411, "xor~reg2~ptr2": 412, "__imp__chmod": 413, "__imp_GetSystemTime": 414, "__imp_CreateFileW": 415, "__imp_SetFileTime": 416, "__imp_CloseHandle": 417, "__imp_isspace": 418, "__imp__unlink": 419, "__imp_isprint": 420, "putc": 421, "__imp__strdup": 422, "sscanf": 423, "__imp__access": 424, "__imp__pclose": 425, "__imp__wunlink": 426, "__imp_SetCurrentDirectoryW": 427, "__imp__popen": 428, "__imp_tolower": 429, "__imp_GetStdHandle": 430, "__imp_GetConsoleScreenBufferInfo": 431, "__imp_SetConsoleTextAttribute": 432, "__imp__isatty": 433, "__imp_DebugBreak": 434, "__imp_SetConsoleCtrlHandler": 435, "lock cmpxchg~ptr4~reg4": 436, "__imp_InitializeCriticalSection": 437, "__imp_DeleteCriticalSection": 438, "__imp_EnterCriticalSection": 439, "__imp_TryEnterCriticalSection": 440, "__imp_LeaveCriticalSection": 441, "__imp__endthreadex": 442, "__imp__beginthreadex": 443, "__imp_GetCurrentThreadId": 444, "OutputDebugStringA": 445, "Sleep": 446, "WaitForSingleObjectEx": 447, "GetVersionExA": 448, "MultiByteToWideChar": 449, "WideCharToMultiByte": 450, "AreFileApisANSI": 451, "FormatMessageW": 452, "LocalFree": 453, "FormatMessageA": 454, "GetLastError": 455, "LockFileEx": 456, "LockFile": 457, "UnlockFileEx": 458, "UnlockFile": 459, "SetFilePointer": 460, "CloseHandle": 461, "ReadFile": 462, "WriteFile": 463, "SetEndOfFile": 464, "FlushViewOfFile": 465, "FlushFileBuffers": 466, "GetFileSize": 467, "or~reg1~ptr1": 468, "UnmapViewOfFile": 469, "or~ptr2~reg2": 470, "CreateFileMappingW": 471, "MapViewOfFile": 472, "GetTempPathW": 473, "GetTempPathA": 474, "GetFileAttributesExW": 475, "GetFileAttributesA": 476, "CreateFileW": 477, "CreateFileA": 478, "GetFileAttributesW": 479, "DeleteFileW": 480, "DeleteFileA": 481, "GetFullPathNameW": 482, "GetFullPathNameA": 483, "LoadLibraryW": 484, "LoadLibraryA": 485, "GetProcAddress": 486, "FreeLibrary": 487, "GetSystemTime": 488, "GetCurrentProcessId": 489, "GetTickCount": 490, "QueryPerformanceCounter": 491, "GetSystemTimeAsFileTime": 492, "GetSystemInfo": 493, "_lock": 494, "__dllonexit": 495, "_unlock": 496, "__imp_GetSystemTimeAsFileTime": 497, "__imp_GetCurrentProcessId": 498, "__imp_GetTickCount": 499, "__imp_QueryPerformanceCounter": 500, "__imp_RtlCaptureContext": 501, "__imp_RtlLookupFunctionEntry": 502, "__imp_RtlVirtualUnwind": 503, "__imp_UnhandledExceptionFilter": 504, "__imp_TerminateProcess": 505, "abort": 506, "__setusermatherr": 507, "movaps~ptr2~xmm8": 508, "movsd~xmm8~ptr8": 509, "__iob_func": 510, "movsd~ptr8~xmm8": 511, "movaps~reg16~ptr2": 512, "movaps~xmm8~ptr2": 513, "fninit": 514, "add~reg8~ptr8": 515, "__imp_VirtualQuery": 516, "__imp_VirtualProtect": 517, "__imp_GetLastError": 518, "nop~ptr2": 519, "add~reg4~ptr4": 520, "__imp_RtlAddFunctionTable": 521, "__imp_TlsGetValue": 522, "calloc": 523, "cmovne~reg8~reg8": 524, "or~ptr8~imm": 525, "_errno": 526, "__imp_GetFileAttributesA": 527, "test~reg1~imm": 528, "_fullpath": 529, "test~reg4~imm": 530, "cmove~reg8~reg8": 531, "add~reg1~reg1": 532, "sbb~reg8~imm": 533, "_findnext64": 534, "strcpy": 535, "_findfirst64": 536, "_findclose": 537, "__imp_GetModuleFileNameW": 538, "_snwprintf": 539, "__imp_MessageBoxW": 540, "wcscpy": 541, "_exit": 542, "fwprintf": 543, "_fstat64": 544, "Run Time: real %.3f user %f sys %f": 545, "Error: out of memory": 546, "%*s%s": 547, "%s%*s": 548, "PRAGMA \"%w\".table_info=%Q;": 549, "/* %s */": 550, "CREATE": 551, "%.*s \"%w\".%s": 552, "%.*s %s.%s": 553, "%s /* %s */": 554, "%z /* %s */": 555, "SHA3 size should be one of: 224 256 384 512": 556, "error SQL statement [%s]: %s": 557, "non-query: [%s]": 558, "sha3_query": 559, "wrong number of arguments to function writefile()": 560, "failed to create symlink: %s": 561, "failed to create directory: %s": 562, "failed to write file: %s": 563, "CREATE TABLE x(name,mode,mtime,data,path HIDDEN,dir HIDDEN)": 564, "cannot read directory: %s": 565, "%s/%s": 566, "cannot stat file: %s": 567, "table function fsdir requires an argument": 568, "argc==idxNum && (argc==1 || argc==2)": 569, "table function fsdir requires a non-NULL argument": 570, "fsdir": 571, "readfile": 572, "writefile": 573, "lsmode": 574, "PRAGMA database_list": 575, "%z%sSELECT name FROM \"%w\".sqlite_schema": 576, "UNION": 577, "completion": 578, "pFile == ORIGFILE(paf)": 579, "Start-Of-SQLite3-": 580, "apnd(%lld)/%z": 581, "SQLite format 3": 582, "MEMTRACE: allocate %d bytes": 583, "MEMTRACE: free %d bytes": 584, "MEMTRACE: resize %d -> %d bytes": 585, "decimal_sum": 586, "decimal": 587, "ieee754(%lld,%d)": 588, "CREATE TABLE x(value,start hidden,stop hidden,step hidden)": 589, "iCol>=0 && iCol<=2": 590, "first argument to \"generate_series()\" missing or unusable": 591, "generate_series() requires SQLite 3.8.12 or later": 592, "generate_series": 593, "afnrtv\\()*.+?[$^{|}]": 594, "unknown \\ escape": 595, "unmatched '('": 596, "'*' without operand": 597, "'+' without operand": 598, "'?' without operand": 599, "'{m,n}' without operand": 600, "unmatched '{'": 601, "n less than m in '{m,n}'": 602, "both m and n are zero in '{m,n}'": 603, "POSIX character classes not supported": 604, "unclosed '['": 605, "out of memory": 606, "unrecognized character": 607, "regexp": 608, "regexpi": 609, "*pRc==SQLITE_OK": 610, "nByte>0": 611, "iHash>=0": 612, "zIn[0]=='\\''": 613, "zIn[n-1]=='\\''": 614, "zIn[iIn+1]=='\\''": 615, "internal error!": 616, "sqlite3_stricmp(p->pTab->zName, argv[2])==0": 617, "pCsr->pData": 618, "SELECT * FROM main.%Q WHERE sample()": 619, "expert": 620, "PRAGMA table_xinfo=%Q": 621, "binary": 622, "shell.c": 623, "COLLATE %Q": 624, "COLLATE %s": 625, "DESC": 626, "PRAGMA index_list=%Q": 627, "PRAGMA index_xInfo=%Q": 628, "%s_idx_%08x": 629, "rc==SQLITE_OK": 630, "CREATE INDEX \"%w\" ON \"%w\"(%s)": 631, "CREATE INDEX %s ON %s(%s)": 632, "pCon->pLink==0": 633, "EXPLAIN QUERY PLAN %s": 634, "USING INDEX": 635, "USING COVERING INDEX": 636, "ALTER TABLE temp.%Q RENAME TO %Q": 637, "INSERT INTO %Q VALUES(": 638, "UPDATE %Q SET": 639, "%s%Q=?": 640, "pWrite->eOp==SQLITE_DELETE": 641, "DELETE FROM %Q": 642, "CREATE TABLE x(": 643, "%s%Q COLLATE %s": 644, "CREATE VIRTUAL TABLE %Q USING expert(%Q)": 645, "argc==0": 646, "argc==2": 647, "iSlot<=p->nSlot": 648, "p->iSample>0": 649, "%sx.%Q IS rem(%d, x.%Q) COLLATE %s": 650, "SELECT %s FROM %Q x ORDER BY %s": 651, "SELECT %s FROM temp.t592690916721053953805701627921227776 x ORDER BY %s": 652, "pEntry->zVal2==0": 653, "DROP TABLE IF EXISTS temp.t592690916721053953805701627921227776": 654, "CREATE TABLE temp.t592690916721053953805701627921227776 AS SELECT * FROM %Q": 655, "INSERT INTO sqlite_stat1 VALUES(?, ?, ?)": 656, "ANALYZE; PRAGMA writable_schema=1": 657, "sample": 658, "ANALYZE sqlite_schema": 659, ":memory:": 660, "Cannot find a unique index name to propose.": 661, "-- stat1:": 662, "%s;%s%s": 663, "(%d) %s": 664, "line %d:": 665, "VISUAL": 666, "no editor for edit()": 667, "NULL input to edit()": 668, "temp%llx": 669, "edit() cannot open temp file": 670, "edit() could not write the whole file": 671, "%s \"%s\"": 672, "EDITOR returned non-zero": 673, "edit() cannot reopen temp file after edit": 674, "could not read back the whole file": 675, "(%s%u)": 676, "replace(": 677, ",'%s',char(13))": 678, ",'%s',char(10))": 679, "\\%03o": 680, "u%04x": 681, "&amp;": 682, "&quot;": 683, "&#39;": 684, "cannot run ATTACH in safe mode": 685, "cannot use the %s() function in safe mode": 686, "authorizer: %s": 687, "CREATE TABLE ['\"]*": 688, "CREATE TABLE IF NOT EXISTS %s%s": 689, "%d,%d,%s": 690, "%s%s%s": 691, "QUERY PLAN": 692, "Progress limit reached (%u)": 693, "Progress %u": 694, "%*s = %s%s": 695, "nArg==1": 696, "CREATE VIEW%": 697, "CREATE TRIG%": 698, "</TH>": 699, "</TR>": 700, "</TD>": 701, "INSERT INTO %s": 702, "VALUES(": 703, "1e999": 704, "-1e999": 705, "%!.20g": 706, "SELFTEST initialization failure: %s": 707, "RELEASE selftest_init": 708, "/**** ERROR: (%d) %s *****/": 709, "%s (%d)": 710, "/proc/%d/io": 711, "%-36s %s": 712, "%-36s %d": 713, "VM-steps: %d": 714, "Number of Outstanding Allocations:": 715, "Number of Pcache Pages Used:": 716, "Largest Pcache Allocation:": 717, "Lookaside failures due to OOM: %d": 718, "Statement Heap/Lookaside Usage: %d bytes": 719, "Memory used by prepared stmt: %d": 720, "Rewind": 721, "explain": 722, "sqlite_parameters": 723, "SELECT value FROM temp.sqlite_parameters WHERE key=?1": 724, "%*s%s%*s": 725, "%*s%s%*s%s": 726, "Interrupt": 727, "pState->expert.pExpert": 728, "pzErr==0 || *pzErr==0": 729, "bCancel || pzErr==0 || *pzErr==0": 730, "-- Candidates -----------------------------": 731, "(no new indexes)": 732, "-- Query %d --------------------------------": 733, "pState->expert.pExpert==0": 734, "-verbose": 735, "-sample": 736, "option requires an argument: %s": 737, "value out of range: %s": 738, "unknown option: %s": 739, "sqlite3_expert_new: %s": 740, "in prepare, %s (%d)": 741, "EXPLAIN %s": 742, "stepping, %s (%d)": 743, "PRAGMA table_info=%Q": 744, "INTEGER": 745, "SELECT 1 FROM pragma_index_list(%Q) WHERE origin='pk'": 746, "PRAGMA reverse_unordered_selects": 747, "PRAGMA reverse_unordered_selects(%d)": 748, "sqlite_sequence": 749, "DELETE FROM sqlite_sequence;": 750, "sqlite_stat?": 751, "ANALYZE sqlite_schema;": 752, "sqlite_": 753, "CREATE VIRTUAL TABLE": 754, "PRAGMA writable_schema=ON;": 755, "table": 756, "SELECT": 757, "FROM": 758, "/****** CORRUPTION ERROR *******/": 759, "/****** %s ******/": 760, "%s ORDER BY rowid DESC": 761, "/****** ERROR: %s ******/": 762, "--all": 763, "%%%s%%": 764, "%.zip": 765, "cannot open \"%s\" for reading": 766, "| size %d pagesize %d": 767, "Out of memory!": 768, "invalid pagesize": 769, "| page %d offset %d": 770, "| end": 771, "| %d: %x %x %x %x %x %x %x %x %x %x %x %x %x %x %x %x": 772, "Error on line %d of --hexdb input": 773, "replace(replace(": 774, "', char(10))": 775, "', char(13))": 776, "apndvfs": 777, "Error: unable to open database \"%s\": %s": 778, "usleep": 779, "CREATE VIRTUAL TABLE zip USING zipfile(%Q);": 780, "Error: sqlite3_deserialize() returns %d": 781, "Error: sqlite3_close() returns %d: %s": 782, "ERROR: Not a boolean value: \"%s\". Assuming \"no\".": 783, "stdout": 784, "stderr": 785, "Error: cannot open \"%s\"": 786, "-- closing database connection": 787, "%.*s;": 788, "%.*s; -- %lld ns": 789, "%s:%d: unescaped %c character": 790, "%s:%d: unterminated %c-quoted field": 791, "SELECT * FROM \"%w\"": 792, "Error %d: %s on [%s]": 793, "INSERT OR IGNORE INTO \"%s\" VALUES(?": 794, "Error %d: %s": 795, "SELECT * FROM \"%w\" ORDER BY rowid DESC;": 796, "Warning: cannot step \"%s\" backwards": 797, "SELECT name, sql FROM sqlite_schema WHERE %s": 798, "Error: (%d) %s on [%s]": 799, "%s...": 800, "Error: %s SQL: [%s]": 801, "SELECT name, sql FROM sqlite_schema WHERE %s ORDER BY rowid DESC": 802, "File \"%s\" already exists.": 803, "Cannot create output database: %s": 804, "PRAGMA writable_schema=OFF;": 805, "%s %s": 806, "Failed: [%s]": 807, "SELECT data FROM sqlite_dbpage(?1) WHERE pgno=1": 808, "error: %s": 809, "unable to read database header": 810, "%-20s %d": 811, "%-20s %u": 812, "(utf8)": 813, "(utf16le)": 814, "(utf16be)": 815, "main.sqlite_schema": 816, "sqlite_temp_schema": 817, "\"%w\".sqlite_schema": 818, "Error: %s": 819, "%s/temp%llx.%s": 820, "%z.%s": 821, "nVal==4": 822, "SEARCH * USING INTEGER PRIMARY KEY (rowid=?)": 823, "-groupbyparent": 824, "Usage: %s %s ?-verbose? ?-groupbyparent?": 825, "fkey_collate_clause": 826, "Error: internal error": 827, "-- Parent table %s": 828, "%s%s --> %s": 829, "%s/* no extra indexes required for %s -> %s */": 830, "fkey-indexes": 831, "sql error: %s (%d)": 832, "SQL error: %s": 833, "Usage: .auth ON|OFF": 834, "backup": 835, "cannot run .%s in safe mode": 836, "-append": 837, "-async": 838, "Usage: .backup ?DB? ?OPTIONS? FILENAME": 839, "missing FILENAME argument on .backup": 840, "PRAGMA synchronous=OFF; PRAGMA journal_mode=OFF;": 841, "Usage: .bail on|off": 842, "Usage: .binary on|off": 843, "breakpoint": 844, "cannot run .cd in safe mode": 845, "Cannot change to directory \"%s\"": 846, "Usage: .cd DIRECTORY": 847, "changes": 848, "Usage: .changes on|off": 849, "check": 850, "Usage: .check GLOB-PATTERN": 851, "testcase-out.txt": 852, "Error: cannot read 'testcase-out.txt'": 853, "testcase-%s FAILED Expected: [%s] Got: [%s]": 854, "testcase-%s ok": 855, "clone": 856, "cannot run .clone in safe mode": 857, "Usage: .clone FILENAME": 858, "connection": 859, "(not open)": 860, "(memory)": 861, "(temporary-file)": 862, "ACTIVE %d: %s": 863, "%d: %s": 864, "cannot close the active database connection": 865, "Usage: .connection [close] [CONNECTION-NUMBER]": 866, "databases": 867, "read-txn": 868, "write-txn": 869, "%s: %s %s%s": 870, "dbconfig": 871, "%19s %s": 872, "Enter \".dbconfig\" with no arguments for a list": 873, "dbinfo": 874, "preserve-rowids": 875, "newlines": 876, "data-only": 877, "nosys": 878, "Unknown option \"%s\" on \".dump\"": 879, "%z OR %z": 880, "BEGIN TRANSACTION;": 881, "SAVEPOINT dump; PRAGMA writable_schema=ON": 882, "RELEASE dump;": 883, "ROLLBACK; -- due to errors": 884, "COMMIT;": 885, "Usage: .echo on|off": 886, "PRAGMA vdbe_trace=OFF;": 887, "trigger": 888, "Usage: .eqp off|on|trace|trigger|full": 889, "filectrl": 890, "--schema": 891, "-schema": 892, "Available file-controls:": 893, ".filectrl %s %s": 894, "Error: ambiguous file-control: \"%s\" Use \".filectrl --help\" for help": 895, "Error: unknown file-control: %s Use \".filectrl --help\" for help": 896, "Usage: .filectrl %s %s": 897, "fullschema": 898, "indent": 899, "Usage: .fullschema ?--indent?": 900, "SELECT rowid FROM sqlite_schema WHERE name GLOB 'sqlite_stat[134]'": 901, "/* No STAT tables available */": 902, "headers": 903, "Usage: .headers on|off": 904, "Nothing matches '%s'": 905, "import": 906, "cannot run .import in safe mode": 907, "-skip": 908, "-ascii": 909, "TABLE": 910, "Error: non-null column separator required for import": 911, "Error: multi-character column separators not allowed for import": 912, "Error: non-null row separator required for import": 913, "Error: multi-character row separators not allowed for import": 914, "<pipe>": 915, ", row separator": 916, "no such table: *": 917, "CREATE TABLE \"%w\"": 918, "%z%c \"%w\" TEXT": 919, "%s: empty file": 920, "CREATE TABLE \"%s\"(...) failed: %s": 921, "INSERT INTO \"%w\" VALUES(?": 922, "Insert using: %s": 923, "BEGIN": 924, "%s:%d: expected %d columns but found %d - filling the rest with NULL": 925, "%s:%d: expected %d columns but found %d - extras ignored": 926, "%s:%d: INSERT failed: %s": 927, "COMMIT": 928, "Added %d rows with %d errors using %d lines of input": 929, "imposter": 930, "Usage: .imposter INDEX IMPOSTER .imposter off": 931, "PRAGMA index_xinfo='%q'": 932, "_ROWID_": 933, "expr%d": 934, "%z,\"%w\"": 935, "no such index: \"%s\"": 936, "CREATE TABLE \"%w\"(%s,PRIMARY KEY(%.*s))WITHOUT ROWID": 937, "Error in [%s]: %s": 938, "index": 939, "WARNING: writing to an imposter table will corrupt the \"%s\" %s!": 940, "SQLITE_TESTCTRL_IMPOSTER returns %d": 941, "limits": 942, "%20s %d": 943, "Usage: .limit NAME ?NEW-VALUE?": 944, "ambiguous limit: \"%s\"": 945, "unknown limit: \"%s\" enter \".limits\" with no arguments for a list.": 946, "cannot run .load in safe mode": 947, "Usage: .load FILE ?ENTRYPOINT?": 948, "cannot run .log in safe mode": 949, "Usage: .log FILENAME": 950, "lines": 951, "columns": 952, "insert": 953, "quote": 954, "ascii": 955, "markdown": 956, "current output mode: %s": 957, "nonce": 958, "Usage: .nonce NONCE": 959, "line %d: incorrect nonce: \"%s\"": 960, "nullvalue": 961, "Usage: .nullvalue STRING": 962, "append": 963, "readonly": 964, "nofollow": 965, "deserialize": 966, "hexdb": 967, "maxsize": 968, "extra argument: \"%s\"": 969, "cannot open disk-based database files in safe mode": 970, "Error: cannot open '%s'": 971, "output": 972, "excel": 973, "ERROR: unknown option: \"%s\". Usage:": 974, "%z %s": 975, "ERROR: extra parameter: \"%s\". Usage:": 976, "Error: cannot open pipe \"%s\"": 977, "Error: cannot write to \"%s\"": 978, "parameter": 979, "clear": 980, "DROP TABLE IF EXISTS temp.sqlite_parameters;": 981, "SELECT max(length(key)) FROM temp.sqlite_parameters;": 982, "SELECT key, quote(value) FROM temp.sqlite_parameters;": 983, "%-*s %s": 984, "REPLACE INTO temp.sqlite_parameters(key,value)VALUES(%Q,%s);": 985, "REPLACE INTO temp.sqlite_parameters(key,value)VALUES(%Q,%Q);": 986, "unset": 987, "DELETE FROM temp.sqlite_parameters WHERE key=%Q": 988, "print": 989, "progress": 990, "quiet": 991, "reset": 992, "limit": 993, "Error: missing argument on --limit": 994, "Error: unknown option: \"%s\"": 995, "prompt": 996, "cannot run .read in safe mode": 997, "Usage: .read FILE": 998, "restore": 999, "cannot run .restore in safe mode": 1000, "Usage: .restore ?DB? FILE": 1001, "Error: source database is busy": 1002, "scanstats": 1003, "Warning: .scanstats not available in this build.": 1004, "Usage: .scanstats on|off": 1005, "schema": 1006, "debug": 1007, "Unknown option: \"%s\"": 1008, "Usage: .schema ?--indent? ?--nosys? ?LIKE-PATTERN?": 1009, "sqlite_master": 1010, "sqlite_schema": 1011, "sqlite_temp_master": 1012, "SELECT name FROM pragma_database_list": 1013, "SELECT sql FROM": 1014, "SELECT shell_add_schema(sql,": 1015, ".sqlite_schema": 1016, ") WHERE": 1017, "lower(printf('%s.%s',sname,tbl_name))": 1018, "lower(tbl_name)": 1019, "GLOB": 1020, "LIKE": 1021, "ESCAPE '\\'": 1022, "AND": 1023, "name NOT LIKE 'sqlite_%%' AND": 1024, "sql IS NOT NULL ORDER BY snum, rowid": 1025, "SQL: %s;": 1026, "Error: querying schema information": 1027, "selecttrace": 1028, "selftest": 1029, "-init": 1030, "Should be one of: --init -v": 1031, "SELECT tno,op,cmd,ans FROM selftest ORDER BY tno": 1032, "Error querying the selftest table": 1033, "%d: %s %s": 1034, "Result: %s": 1035, "%d: error-code-%d: %s": 1036, "%d: Got: [%s]": 1037, "Unknown operation \"%s\" on selftest line %d": 1038, "%d errors out of %d tests": 1039, "separator": 1040, "Usage: .separator COL ?ROW?": 1041, "sha3sum": 1042, "sha3-224": 1043, "sha3-256": 1044, "sha3-384": 1045, "sha3-512": 1046, "Unknown option \"%s\" on \"%s\"": 1047, "Usage: .sha3sum ?OPTIONS? ?LIKE-PATTERN?": 1048, "sqlite\\_%": 1049, "NOT INDEXED;": 1050, "SELECT type,name,tbl_name,sql FROM sqlite_schema ORDER BY name;": 1051, "SELECT name,seq FROM sqlite_sequence ORDER BY name;": 1052, "sqlite_stat1": 1053, "SELECT tbl,idx,stat FROM sqlite_stat1 ORDER BY tbl,idx;": 1054, "sqlite_stat4": 1055, "ORDER BY tbl, idx, rowid;": 1056, "shell": 1057, "Usage: .system COMMAND": 1058, "%z \"%s\"": 1059, "System command returns %d": 1060, "Usage: .show": 1061, "%12.12s: %s": 1062, "%12.12s:": 1063, "vmstep": 1064, "stats": 1065, "Usage: .stats ?on|off|stmt|vmstep?": 1066, "tables": 1067, "indices": 1068, "indexes": 1069, "Usage: .indexes ?LIKE-PATTERN?": 1070, "UNION ALL": 1071, "SELECT name FROM": 1072, "||'.'||name FROM": 1073, "WHERE type='index' AND tbl_name LIKE ?1": 1074, "ORDER BY 1": 1075, "%s%-*s": 1076, "testcase": 1077, "Error: cannot open 'testcase-out.txt'": 1078, "testctrl": 1079, "Available test-controls:": 1080, ".testctrl %s %s": 1081, "Error: ambiguous test-control: \"%s\" Use \".testctrl --help\" for help": 1082, "Error: unknown test-control: %s Use \".testctrl --help\" for help": 1083, "random": 1084, "-- random seed: %d": 1085, "%llu": 1086, "Usage: .testctrl %s %s": 1087, "0x%08x": 1088, "timeout": 1089, "timer": 1090, "Usage: .timer on|off": 1091, "trace": 1092, "expanded": 1093, "plain": 1094, "profile": 1095, "Unknown option \"%s\" on \".trace\"": 1096, "version": 1097, "gcc-7.5.0": 1098, "vfsinfo": 1099, "vfs.mxPathname = %d": 1100, "vfslist": 1101, "<--- CURRENT": 1102, "-----------------------------------": 1103, "vfsname": 1104, "wheretrace": 1105, "width": 1106, "nArg<=ArraySize(azArg)": 1107, "Error: unknown command or invalid arguments: \"%s\". Enter \".help\" for help": 1108, "cWait==0": 1109, "Error: near line %d:": 1110, "Error:": 1111, "changes: %lld total_changes: %lld": 1112, "nAlloc>0 && zSql!=0": 1113, "-- warning: cannot find home directory; cannot read ~/.sqliterc": 1114, "%s/.sqliterc": 1115, "-- Loading resources from %s": 1116, "cannot open: \"%s\"": 1117, "OPTIONS include: %s": 1118, "Use the -help option for additional information": 1119, "WARNING: attempt to configure SQLite after initialization.": 1120, "...>": 1121, "\u001b[1m%s\u001b[0m": 1122, "%s: Error: missing argument to %s": 1123, "SQLITE_DEBUG_BREAK": 1124, "attach debugger to process %d and press any key to continue.": 1125, "SQLite header and source version mismatch %s %s": 1126, "argc>=1 && argv && argv[0]": 1127, "-separator": 1128, "-nullvalue": 1129, "-newline": 1130, "-batch": 1131, "-heap": 1132, "-pagecache": 1133, "-lookaside": 1134, "-threadsafe": 1135, "-mmap": 1136, "-deserialize": 1137, "-maxsize": 1138, "-readonly": 1139, "-nofollow": 1140, "-memtrace": 1141, "-bail": 1142, "-nonce": 1143, "-safe": 1144, "no such VFS: \"%s\"": 1145, "-html": 1146, "-list": 1147, "-quote": 1148, "-line": 1149, "-column": 1150, "-json": 1151, "-markdown": 1152, "-table": 1153, "-tabs": 1154, "-header": 1155, "-noheader": 1156, "-echo": 1157, "-eqpfull": 1158, "-stats": 1159, "-scanstats": 1160, "-backslash": 1161, "-version": 1162, "-interactive": 1163, "-help": 1164, "Error: unable to process SQL \"%s\"": 1165, "Use -help for a list of options.": 1166, "Error: unable to process SQL: %s": 1167, "SQLite version %s %.19s Enter \".help\" for usage hints.": 1168, ". Use \".open FILENAME\" to reopen on a persistent database.": 1169, "SQLITE_HISTORY": 1170, "%s/.sqlite_history": 1171, "20b:20e": 1172, "20c:20e": 1173, "40f-21a-21d": 1174, "local time unavailable": 1175, "unixepoch": 1176, "weekday": 1177, "start of": 1178, "month": 1179, "%04d-%02d-%02d %02d:%02d:%02d": 1180, "%02d:%02d:%02d": 1181, "%04d-%02d-%02d": 1182, "%06.3f": 1183, "%.16g": 1184, "failed to allocate %u bytes of memory": 1185, "failed memory resize %u to %u bytes": 1186, "thstndrd": 1187, "0123456789ABCDEF0123456789abcdef": 1188, "(NULL)": 1189, "SUBQUERY %u": 1190, "922337203685477580": 1191, "API call with %s database connection pointer": 1192, "unopened": 1193, "invalid": 1194, "/dev/null": 1195, "os_unix.c:%d: (%d) %s(%s) - %s": 1196, "cannot fstat db file %s": 1197, "file unlinked while open: %s": 1198, "multiple links to file: %s": 1199, "file renamed while open: %s": 1200, "openDirectory": 1201, "full_fsync": 1202, "ftruncate": 1203, "%s-shm": 1204, "readonly_shm": 1205, "unix-excl": 1206, "%s.lock": 1207, "TMPDIR": 1208, "%s/etilqs_%llx%c": 1209, "modeof": 1210, "lstat": 1211, "/dev/urandom": 1212, "memdb(%p,%lld)": 1213, "PRAGMA \"%w\".page_count": 1214, "ATTACH x AS %Q": 1215, "recovered %d pages from %s": 1216, "-journal": 1217, "nolock": 1218, "immutable": 1219, "recovered %d frames from WAL file %s": 1220, "cannot limit WAL size: %s": 1221, "invalid page number %d": 1222, "2nd reference to page %d": 1223, "Failed to read ptrmap key=%d": 1224, "Bad ptr map entry key=%d expected=(%d,%d) got=(%d,%d)": 1225, "failed to get page %d": 1226, "freelist leaf count too big on page %d": 1227, "overflow list length": 1228, "%s is %d but should be %d": 1229, "Page %u:": 1230, "unable to get the page. error code=%d": 1231, "btreeInitPage() returns error code %d": 1232, "free space corruption": 1233, "On tree page %u cell %d:": 1234, "On page %u at right child:": 1235, "Offset %d out of range %d..%d": 1236, "Extends off end of page": 1237, "Rowid %lld out of order": 1238, "Child page depth differs": 1239, "Multiple uses for byte %u of page %u": 1240, "Fragmentation of %d bytes reported as %d on page %u": 1241, "Main freelist:": 1242, "max rootpage (%d) disagrees with header (%d)": 1243, "incremental_vacuum enabled with a max rootpage of zero": 1244, "Page %d is never used": 1245, "Pointer map page %d is referenced": 1246, "unknown database %s": 1247, "destination database is in use": 1248, "source and destination must be distinct": 1249, "%!.15g": 1250, "BINARY": 1251, ",%s%s%s": 1252, "%.18s-%s": 1253, "%s(%d)": 1254, "(blob)": 1255, "vtab:%p": 1256, "program": 1257, "%.4c%s%.16c": 1258, "MJ delete: %s": 1259, "MJ collide: %s": 1260, "-mj%06X9%02X": 1261, "FOREIGN KEY constraint failed": 1262, "a CHECK constraint": 1263, "a generated column": 1264, "an index": 1265, "non-deterministic use of %s() in %s": 1266, "API called with finalized prepared statement": 1267, "API called with NULL prepared statement": 1268, "string or blob too big": 1269, "bind on a busy prepared statement: [%s]": 1270, "'%.*q'": 1271, "zeroblob(%d)": 1272, "%s constraint failed": 1273, "%z: %s": 1274, "abort at %d in [%s]: %s": 1275, "cannot store %s value in %s column %s.%s": 1276, "cannot open savepoint - SQL statements in progress": 1277, "no such savepoint: %s": 1278, "cannot release savepoint - SQL statements in progress": 1279, "cannot commit transaction - SQL statements in progress": 1280, "cannot rollback - no transaction is active": 1281, "cannot commit - no transaction is active": 1282, "cannot start a transaction within a transaction": 1283, "database schema has changed": 1284, "index corruption": 1285, "SELECT*FROM\"%w\".%s WHERE %s ORDER BY rowid": 1286, "too many levels of trigger recursion": 1287, "out of": 1288, "cannot change %s wal mode from within a transaction": 1289, "database table is locked: %s": 1290, "-- %s": 1291, "statement aborts at %d: [%s] %s": 1292, "integer": 1293, "cannot open value of type %s": 1294, "no such rowid: %lld": 1295, "cannot open virtual table: %s": 1296, "cannot open table without rowid: %s": 1297, "cannot open view: %s": 1298, "no such column: \"%s\"": 1299, "foreign key": 1300, "indexed": 1301, "cannot open %s column for writing": 1302, "excluded": 1303, "misuse of aliased aggregate %s": 1304, "misuse of aliased window function %s": 1305, "row value misused": 1306, "double-quoted string literal: \"%w\"": 1307, "no such column": 1308, "ambiguous column name": 1309, "%s: %s.%s.%s": 1310, "%s: %s.%s": 1311, "%s: %s": 1312, "partial index WHERE clauses": 1313, "index expressions": 1314, "CHECK constraints": 1315, "generated columns": 1316, "%s prohibited in %s": 1317, "false": 1318, "the \".\" operator": 1319, "second argument to likelihood() must be a constant between 0.0 and 1.0": 1320, "not authorized to use function: %s": 1321, "non-deterministic functions": 1322, "%.*s() may not be used as a window function": 1323, "window": 1324, "aggregate": 1325, "misuse of %s function %.*s()": 1326, "no such function: %.*s": 1327, "wrong number of arguments to function %.*s()": 1328, "FILTER may not be used with non-aggregate %.*s()": 1329, "subqueries": 1330, "parameters": 1331, "%r %s BY term out of range - should be between 1 and %d": 1332, "too many terms in ORDER BY clause": 1333, "ORDER": 1334, "%r ORDER BY term does not match any column in the result set": 1335, "too many terms in %s BY clause": 1336, "a GROUP BY clause is required before HAVING": 1337, "GROUP": 1338, "aggregate functions are not allowed in the GROUP BY clause": 1339, "Expression tree is too large (maximum depth %d)": 1340, "IN(...) element has %d term%s - expected %d": 1341, "too many arguments on function %T": 1342, "unsafe use of %s()": 1343, "variable number must be between ?1 and ?%d": 1344, "too many SQL variables": 1345, "%d columns assigned %d values": 1346, "too many columns in %s": 1347, "ROWID": 1348, "USING ROWID SEARCH ON TABLE %s FOR IN-OPERATOR": 1349, "USING INDEX %s FOR IN-OPERATOR": 1350, "sub-select returns %d columns - expected %d": 1351, "REUSE LIST SUBQUERY %d": 1352, "CORRELATED": 1353, "%sLIST SUBQUERY %d": 1354, "REUSE SUBQUERY %d": 1355, "%sSCALAR SUBQUERY %d": 1356, "hex literal too big: %s%s": 1357, "generated column loop on \"%s\"": 1358, "misuse of aggregate: %s()": 1359, "unknown function: %s()": 1360, "RAISE() may only be used within a trigger-program": 1361, "table %s may not be altered": 1362, "there is already another table or index with this name: %s": 1363, "view %s may not be altered": 1364, "UPDATE \"%w\".sqlite_sequence set name = %Q WHERE name = %Q": 1365, "after rename": 1366, "SELECT raise(ABORT,%Q) FROM \"%w\".\"%w\"": 1367, "Cannot add a PRIMARY KEY column": 1368, "Cannot add a UNIQUE column": 1369, "Cannot add a REFERENCES column with non-NULL default value": 1370, "Cannot add a NOT NULL column with default value NULL": 1371, "Cannot add a column with non-constant default": 1372, "cannot add a STORED column": 1373, "virtual tables may not be altered": 1374, "Cannot add a column to a view": 1375, "sqlite_altertab_%s": 1376, "virtual table": 1377, "drop column from": 1378, "rename columns of": 1379, "cannot %s %s \"%s\"": 1380, "error in %s %s%s%s: %s": 1381, "\"%w\"": 1382, "%.*s%s": 1383, "PRIMARY KEY": 1384, "UNIQUE": 1385, "cannot drop %s column: \"%s\"": 1386, "cannot drop column \"%s\": no other columns exist": 1387, "after drop column": 1388, "CREATE TABLE %Q.%s(%s)": 1389, "DELETE FROM %Q.%s WHERE %s=%Q": 1390, "unordered*": 1391, "sz=[0-9]*": 1392, "noskipscan*": 1393, "SELECT tbl,idx,stat FROM %Q.sqlite_stat1": 1394, "memdb": 1395, "too many attached databases - max %d": 1396, "database %s is already in use": 1397, "database is already attached": 1398, "attached databases must use the same text encoding as main database": 1399, "unable to open database: %s": 1400, "no such database: %s": 1401, "cannot detach database %s": 1402, "database %s is locked": 1403, "%s cannot use variables": 1404, "%s %T cannot reference objects in database %s": 1405, "authorizer malfunction": 1406, "%s.%s": 1407, "%s.%z": 1408, "access to %z is prohibited": 1409, "not authorized": 1410, "pragma_": 1411, "no such view": 1412, "no such table": 1413, "corrupt database": 1414, "unknown database %T": 1415, "object name reserved for internal use: %s": 1416, "temporary table name must be unqualified": 1417, "table %T already exists": 1418, "there is already an index named %s": 1419, "sqlite_returning": 1420, "cannot use RETURNING in a trigger": 1421, "too many columns on %s": 1422, "always": 1423, "generated": 1424, "duplicate column name: %s": 1425, "default value of column [%s] is not constant": 1426, "cannot use DEFAULT on a generated column": 1427, "generated columns cannot be part of the PRIMARY KEY": 1428, "table \"%s\" has more than one primary key": 1429, "AUTOINCREMENT is only allowed on an INTEGER PRIMARY KEY": 1430, "virtual tables cannot use computed columns": 1431, "virtual": 1432, "stored": 1433, "error in generated column \"%s\"": 1434, "CREATE TABLE": 1435, "unknown datatype for %s.%s: \"%s\"": 1436, "missing datatype for %s.%s": 1437, "AUTOINCREMENT not allowed on WITHOUT ROWID tables": 1438, "PRIMARY KEY missing on table %s": 1439, "must have at least one non-generated column": 1440, "CREATE %s %.*s": 1441, "CREATE TABLE %Q.sqlite_sequence(name,seq)": 1442, "tbl_name='%q' AND type!='trigger'": 1443, "parameters are not allowed in views": 1444, "view %s is circularly defined": 1445, "corrupt schema": 1446, "UPDATE %Q.sqlite_master SET rootpage=%d WHERE #%d AND rootpage=#%d": 1447, "sqlite_stat%d": 1448, "DELETE FROM %Q.sqlite_sequence WHERE name=%Q": 1449, "DELETE FROM %Q.sqlite_master WHERE tbl_name=%Q and type!='trigger'": 1450, "table %s may not be dropped": 1451, "use DROP TABLE to delete table %s": 1452, "use DROP VIEW to delete view %s": 1453, "foreign key on %s should reference only one column of table %T": 1454, "unknown column \"%s\" in foreign key definition": 1455, "FIRST": 1456, "unsupported use of NULLS %s": 1457, "cannot create a TEMP index on non-TEMP table \"%s\"": 1458, "table %s may not be indexed": 1459, "views may not be indexed": 1460, "virtual tables may not be indexed": 1461, "there is already a table named %s": 1462, "index %s already exists": 1463, "sqlite_autoindex_%s_%d": 1464, "expressions prohibited in PRIMARY KEY and UNIQUE constraints": 1465, "conflicting ON CONFLICT clauses specified": 1466, "invalid rootpage": 1467, "CREATE%s INDEX %.*s": 1468, "INSERT INTO %Q.sqlite_master VALUES('index',%Q,%Q,#%d,%Q);": 1469, "name='%q' AND type='index'": 1470, "no such index: %S": 1471, "index associated with UNIQUE or PRIMARY KEY constraint cannot be dropped": 1472, "DELETE FROM %Q.sqlite_master WHERE name=%Q AND type='index'": 1473, "too many FROM clause terms, max: %d": 1474, "USING": 1475, "a JOIN clause is required before %s": 1476, "ROLLBACK": 1477, "unable to open a temporary database file for storing temporary tables": 1478, "index '%q'": 1479, "%s.rowid": 1480, "unable to identify the object to be reindexed": 1481, "duplicate WITH table name: %s": 1482, "no such collation sequence: %s": 1483, "table %s may not be modified": 1484, "cannot modify %s because it is a view": 1485, "rows deleted": 1486, "integer overflow": 1487, "LIKE or GLOB pattern too complex": 1488, "ESCAPE expression must be a single character": 1489, "%!.20e": 1490, "0123456789ABCDEF": 1491, "MATCH": 1492, "foreign key mismatch - \"%w\" referencing \"%w\"": 1493, "cannot INSERT into generated column \"%s\"": 1494, "table %S has no column named %s": 1495, "table %S has %d columns but %d values were supplied": 1496, "%d values for %d columns": 1497, "UPSERT not implemented for virtual table \"%s\"": 1498, "cannot UPSERT a view": 1499, "rows inserted": 1500, "sqlite3_extension_init": 1501, "sqlite3_": 1502, "_init": 1503, "no entry point [%s] in shared library [%s]": 1504, "error during initialization: %s": 1505, "unable to open shared library [%.*s]": 1506, "automatic extension loading failed: %s": 1507, "onoffalseyestruextrafull": 1508, "exclusive": 1509, "normal": 1510, "incremental": 1511, "memory": 1512, "temporary storage cannot be changed from within a transaction": 1513, "SET NULL": 1514, "SET DEFAULT": 1515, "CASCADE": 1516, "RESTRICT": 1517, "NO ACTION": 1518, "sissii": 1519, "not a writable directory": 1520, "Safety level may not be changed inside a transaction": 1521, "issisii": 1522, "issisi": 1523, "SELECT*FROM\"%w\"": 1524, "shadow": 1525, "sssiii": 1526, "isisi": 1527, "iissssss": 1528, "*** in database %s ***": 1529, "NULL value in %s.%s": 1530, "non-%s value in %s.%s": 1531, "CHECK constraint failed in %s": 1532, "missing from index": 1533, "non-unique entry in index": 1534, "wrong # of entries in index": 1535, "unsupported encoding: %s": 1536, "restart": 1537, "truncate": 1538, "ANALYZE \"%w\".\"%w\"": 1539, "CREATE TABLE x": 1540, "%c\"%s\"": 1541, "(\"%s\"": 1542, ",arg HIDDEN": 1543, ",schema HIDDEN": 1544, "PRAGMA": 1545, "error in %s %s after %s: %s": 1546, "malformed database schema (%s)": 1547, "%z - %s": 1548, "orphan index": 1549, "CREATE TABLE x(type text,name text,tbl_name text,rootpage int,sql text)": 1550, "unsupported file format": 1551, "SELECT*FROM\"%w\".%s ORDER BY rowid": 1552, "database schema is locked: %s": 1553, "statement too long": 1554, "naturaleftouterightfullinnercross": 1555, "unknown or unsupported join type: %T %T%s%T": 1556, "RIGHT and FULL OUTER JOINs are not currently supported": 1557, "a NATURAL join may not have an ON or USING clause": 1558, "cannot have both ON and USING clauses in the same join": 1559, "cannot join using column %s - column not present in both tables": 1560, "INTERSECT": 1561, "EXCEPT": 1562, "USE TEMP B-TREE FOR %s": 1563, "rowid": 1564, "column%d": 1565, "%.*z:%u": 1566, "cannot use window functions in recursive queries": 1567, "recursive aggregate queries not supported": 1568, "SETUP": 1569, "RECURSIVE STEP": 1570, "SCAN %d CONSTANT ROW%s": 1571, "LEFT-MOST SUBQUERY": 1572, "%s USING TEMP B-TREE": 1573, "all VALUES must have the same number of terms": 1574, "RIGHT": 1575, "no such index: %s": 1576, "'%s' is not a function": 1577, "multiple references to recursive table: %s": 1578, "circular reference: %s": 1579, "table %s has %d values for %d columns": 1580, "multiple recursive references: %s": 1581, "recursive reference in a subquery: %s": 1582, "subquery_%u": 1583, "too many references to \"%s\": max 65535": 1584, "access to view \"%s\" prohibited": 1585, "unsafe use of virtual table \"%s\"": 1586, "%s.%s.%s": 1587, "no such table: %s": 1588, "no tables specified": 1589, "too many columns in result set": 1590, "DISTINCT aggregates must have exactly one argument": 1591, "USE TEMP B-TREE FOR %s(DISTINCT)": 1592, "SCAN %s%s%s": 1593, "target object/alias may not appear in FROM clause: %s": 1594, "expected %d columns for '%s' but got %d": 1595, "CO-ROUTINE %!S": 1596, "MATERIALIZE %!S": 1597, "DISTINCT": 1598, "GROUP BY": 1599, "RIGHT PART OF ORDER BY": 1600, "ORDER BY": 1601, "sqlite3_get_table() called with two or more incompatible queries": 1602, "temporary trigger may not have qualified name": 1603, "cannot create triggers on virtual tables": 1604, "trigger %T already exists": 1605, "cannot create trigger on system table": 1606, "BEFORE": 1607, "AFTER": 1608, "cannot create %s trigger on view: %S": 1609, "cannot create INSTEAD OF trigger on table: %S": 1610, "type='trigger' AND name='%q'": 1611, "no such trigger: %S": 1612, "DELETE FROM %Q.sqlite_master WHERE name=%Q AND type='trigger'": 1613, "DELETE": 1614, "UPDATE": 1615, "%s RETURNING is not available on virtual tables": 1616, "RETURNING may not use \"TABLE.*\" wildcards": 1617, "-- TRIGGER %s": 1618, "cannot UPDATE generated column \"%s\"": 1619, "no such column: %s": 1620, "rows updated": 1621, "%sON CONFLICT clause does not match any PRIMARY KEY or UNIQUE constraint": 1622, "cannot VACUUM from within a transaction": 1623, "cannot VACUUM - SQL statements in progress": 1624, "non-text filename": 1625, "ATTACH %Q AS vacuum_db": 1626, "output file already exists": 1627, "SELECT sql FROM \"%w\".sqlite_schema WHERE type='index'": 1628, "name=%Q AND sql=%Q": 1629, "vtable constructor called recursively: %s": 1630, "vtable constructor failed: %s": 1631, "vtable constructor did not declare schema: %s": 1632, "hidden": 1633, "no such module: %s": 1634, "<expr>": 1635, "ANY(%s)": 1636, "SEARCH": 1637, "%s %S": 1638, "AUTOMATIC PARTIAL COVERING INDEX": 1639, "AUTOMATIC COVERING INDEX": 1640, "COVERING INDEX %s": 1641, "INDEX %s": 1642, ">? AND rowid<": 1643, "USING INTEGER PRIMARY KEY (rowid%s?)": 1644, "VIRTUAL TABLE INDEX %d:%s": 1645, "MULTI-INDEX OR": 1646, "INDEX %d": 1647, "&\"regexp": 1648, "ON clause references tables to its right": 1649, "NOCASE": 1650, "too many arguments on %s() - max %d": 1651, "automatic index on %s(%s)": 1652, "auto-index": 1653, "%s.xBestIndex malfunction": 1654, "abbreviated query algorithm search": 1655, "no query solution": 1656, "at most %d tables in a join": 1657, "SCAN CONSTANT ROW": 1658, "second argument to nth_value must be a positive integer": 1659, "argument of ntile must be a positive integer": 1660, "no such window: %s": 1661, "RANGE with offset PRECEDING/FOLLOWING requires one ORDER BY expression": 1662, "FILTER clause may only be used with aggregate window functions": 1663, "ntile": 1664, "unsupported frame specification": 1665, "PARTITION clause": 1666, "ORDER BY clause": 1667, "frame specification": 1668, "cannot override %s of window: %s": 1669, "DISTINCT is not supported for window functions": 1670, "nth_value": 1671, "first_value": 1672, "LIMIT": 1673, "%s clause should come after %s not before": 1674, "too many terms in compound SELECT": 1675, "syntax error after column name \"%.*s\"": 1676, "parser stack overflow": 1677, "unknown table option: %.*s": 1678, "strict": 1679, "set list": 1680, "near \"%T\": syntax error": 1681, "incomplete input": 1682, "unrecognized token: \"%.*s\"": 1683, "%s in \"%s\"": 1684, "create": 1685, "temporary": 1686, "3.37.0": 1687, "unable to close due to unfinalized statements or unfinished backups": 1688, "unknown error": 1689, "abort due to ROLLBACK": 1690, "another row available": 1691, "no more rows available": 1692, "unable to delete/modify user-function due to active statements": 1693, "unable to use function %s in the requested context": 1694, "unknown database: %s": 1695, "unable to delete/modify collation sequence due to active statements": 1696, "file:": 1697, "localhost": 1698, "invalid uri authority: %.*s": 1699, "cache": 1700, "no such %s mode: %s": 1701, "%s mode not allowed: %s": 1702, "no such vfs: %s": 1703, "RTRIM": 1704, "%s at line %d of [%.10s]": 1705, "database corruption": 1706, "misuse": 1707, "cannot open file": 1708, "no such table column: %s.%s": 1709, "SQLITE_": 1710, "Kernel32.dll": 1711, "GetProcessTimes": 1712, "Error: timer not available on this system.": 1713, "gcc-7.3-win32 20180312": 1714, "USERPROFILE": 1715, "HOMEPATH": 1716, "OsError 0x%lx (%lu)": 1717, "os_win.c:%d: (%lu) %s(%s) - %s": 1718, "delayed %dms for lock/sharing conflict at line %d": 1719, "winSeekFile": 1720, "winClose": 1721, "winRead": 1722, "winWrite1": 1723, "winWrite2": 1724, "winTruncate1": 1725, "winTruncate2": 1726, "winSync1": 1727, "winSync2": 1728, "winFileSize": 1729, "winUnlockReadLock": 1730, "winUnlock": 1731, "winLockSharedMemory": 1732, "winOpenShm": 1733, "winShmMap1": 1734, "winShmMap2": 1735, "winShmMap3": 1736, "winUnmapfile1": 1737, "winUnmapfile2": 1738, "winMapfile1": 1739, "winMapfile2": 1740, "etilqs_": 1741, "winGetTempname1": 1742, "winGetTempname2": 1743, "winGetTempname3": 1744, "winGetTempname4": 1745, "winGetTempname5": 1746, "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789": 1747, "winOpen": 1748, "winDelete": 1749, "winAccess": 1750, "%s%c%s": 1751, "winFullPathname1": 1752, "winFullPathname2": 1753, "winFullPathname3": 1754, "winFullPathname4": 1755, "temp_schema": 1756, "CADDEB": 1757, "0123456789ABCDEF%!.20e": 1758, "Argument domain error (DOMAIN)": 1759, "_matherr(): %s in %s(%g, %g) (retval=%g)": 1760, "Argument singularity (SIGN)": 1761, "Overflow range error (OVERFLOW)": 1762, "The result is too small to be represented (UNDERFLOW)": 1763, "Total 